/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for am.
 */
export default {
  feedback_messages: {
    blur_detected: "ካርዱን እና ስልኩን ቀጥ አድርገው ይያዙ",
    blur_detected_desktop: "ካርዱን እና መሣሪያውን ቀጥ አድርገው ይያዙ",
    camera_angle_too_steep: "ካርዱን ከስልክ ጋር ትይዩ ያድርጉት",
    camera_angle_too_steep_desktop: "ካርዱን ከማያ ገጽ ጋር ትይዩ ያድርጉት",
    card_number_scanned: "ተሳክቷል! የካርድ ቁጥር ጎኑ ተቃኝቷል",
    card_scanned: "ተሳክቷል! ካርዱ ተቃኝቷል",
    document_too_close_to_edge: "ራቅ ብለው ይሂዱ",
    flip_card: "ካርዱን ይገልብጡት",
    flip_to_back_side: "ካርዱን ይገልብጡት",
    move_closer: "ይቅረቡ",
    move_farther: "ራቅ ብለው ይሂዱ",
    occluded: "ካርዱን ሙሉ በሙሉ እንዲታይ ያድርጉ",
    scan_the_back_side: "የካርዱን ሌላኛውን ጎን ይቃኙ",
    scan_the_front_side: "የካርድ ቁጥሩን ይቃኙ",
  },
  help_button: { aria_label: "እገዛ", tooltip: "እርዳታ ይፈልጋሉ?" },
  help_modal: {
    aria: "የመቃኘት እገዛ",
    back_btn: "ተመለስ",
    blur: {
      details:
        "በሚቃኙበት ጊዜ ስልኩን እና ካርዱን ጸንተው ይዘው ለማቆየት ይሞክሩ። አንዱን ማንቀሳቀስ ምስሉን ሊያደበዝዝ እና በካርዱ ላይ ያለውን ውሂብ የማይነበብ እንዲሆን ያደርገዋል።",
      details_desktop:
        "በሚቃኙበት ጊዜ መሣሪያዎን እና ካርዱን ቀጥ አድርገው ይዘው ለማቆየት ይሞክሩ። አንዱን ማንቀሳቀስ ምስሉን ሊያደበዝዝ እና በካርዱ ላይ ያለውን ውሂብ የማይነበብ እንዲሆን ያደርገዋል።",
      title: "በሚቃኙበት ጊዜ ሳይንቀሳቀሱ ይቆዩ",
    },
    camera_lens: {
      details:
        "የካሜራዎ ሌንሶች ቆሻሻ ወይም አቧራ መኖሩን ይፈትሹ። የቆሸሹ ሌንሶች የመጨረሻው ምስል እንዲደበዝዝ ያደርጋሉ፣ ይህም የካርድ ዝርዝሮች እንዳይነበቡ በማድረግ የተሳካ የውሂቡን ቅኝት ይከላከላል።",
      title: "የካሜራዎን ሌንሶች ያጽዱ",
    },
    card_number: {
      details:
        "የካርድ ቁጥሩ ብዙውን ጊዜ ባለ 16 አሃዝ ቁጥር ነው፣ ቢሆንም ከ12 እስከ 19 አሃዞች ሊኖረው ይችላል። በካርዱ ላይ በተነሱ ቁጥሮች መታተም ወይም መቀረጽ አለበት። በካርድዎ ፊት ወይም ጀርባ ላይ ሊሆን ይችላል።",
      title: "የካርድ ቁጥሩ የቱ ጋር ነው?",
    },
    done_btn: "ተከናውኗል",
    done_btn_aria: "መቃኘት ቀጥል",
    lighting: {
      details:
        "ካርዱ ላይ ስለሚያንፀባርቅ እና የካርዱን ክፍሎች እንዳይነበብ ስለሚያደርግ ቀጥተኛ ኃይለኛ ብርሃንን ያስወግዱ፣ በካርዱ ላይ ያለውን ውሂብ ማንበብ ካልቻሉ ለካሜራም የሚታይ አይሆንም።",
      title: "ከአደገኛ ብርሃን ይጠንቀቁ",
    },
    next_btn: "ቀጣይ",
    occlusion: {
      details:
        "የታችኛውን መስመሮች ጨምሮ የካርዱን ክፍሎች በጣት አለመሸፈንዎን ያረጋግጡ። እንዲሁም በካርዶች መስኮች ላይ የሚሄዱ የሆሎግራም ነጸብራቆችን ይመልከቱ።",
      title: "ሁሉንም መስኮች እንዲታዩ ያድርጉ",
    },
  },
  onboarding_modal: {
    aria: "የመጋኘት መመርያዎች",
    btn: "መቃኘት ጀምር",
    details:
      "የካርድ ቁጥር ብዙውን ጊዜ ባለ 16 አሃዝ ቁጥር ነው። በካርዱ ላይ ጎላ ባሉ ቁጥሮች መታተም ወይም መቀረጽ አለበት። ካርዱ በደንብ መብራቱን እና ሁሉም ዝርዝሮች የሚታዩ መሆናቸውን ያረጋግጡ።",
    details_desktop:
      "የካርድ ቁጥር ብዙውን ጊዜ ባለ 16 አሃዝ ቁጥር ነው። በካርዱ ላይ ጎላ ባሉ ቁጥሮች መታተም ወይም መቀረጽ አለበት። የካሜራዎ ሌንሶች ንፁህ መሆናቸውን፣ ካርዱ በቂ ብርሃን ባለበት ቦታ መኖሩን እና ሁሉም ዝርዝሮች የሚታዩ መሆናቸውን ያረጋግጡ።",
    title: "መጀመሪያ የካርድ ቁጥሩን ይቃኙ",
  },
  sdk_aria: "የካርድ ቅኝት ማያ ገጽ",
  timeout_modal: {
    cancel_btn: "ተወው",
    details: "ካርዱን ማንበብ አልተቻለም። እባክዎ እንደገና ይሞክሩ።",
    retry_btn: "እንደገና ይሞክሩ",
    title: "መቃኘት አልተሳካም",
  },
} as const;
