/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ar.
 */
export default {
  feedback_messages: {
    blur_detected: "يرجى الحفاظ على ثبات البطاقة والهاتف",
    blur_detected_desktop: "يرجى الحفاظ على ثبات البطاقة والجهاز",
    camera_angle_too_steep: "ضع البطاقة موازية للهاتف",
    camera_angle_too_steep_desktop: "إبقاء البطاقة موازية للشاشة",
    card_number_scanned: "تم بنجاح! تم مسح رقم البطاقة ضوئياً.",
    card_scanned: "تم بنجاح! تم مسح البطاقة ضوئياً",
    document_too_close_to_edge: "انقل إلى موضع أبعد",
    flip_card: "اقلب البطاقة",
    flip_to_back_side: "اقلب البطاقة",
    move_closer: "انقل إلى موضع أقرب",
    move_farther: "انقل إلى موضع أبعد",
    occluded: "سهِّل الوصول إلى بيانات البطاقة لأقصى درجة",
    scan_the_back_side: "امسح الجانب الآخر من البطاقة ضوئياً",
    scan_the_front_side: "قم بمسح رقم البطاقة ضوئيًا",
  },
  help_button: { aria_label: "المساعدة", tooltip: "هل تحتاج مساعدة؟" },
  help_modal: {
    aria: "مساعدة في المسح الضوئي",
    back_btn: "عودة",
    blur: {
      details:
        "حاول إبقاء الهاتف والبطاقة ثابتين أثناء المسح. يمكن أن يؤدي تحريك أي منهما إلى تعتيم الصورة وجعل البيانات الموجودة على البطاقة غير قابلة للقراءة.",
      details_desktop:
        "يجب إبقاء الجهاز والبطاقة ثابتين خلال المسح. تحريك أي منهما قد يشوش الصورة ويجعل البيانات الموجودة على البطاقة غير قابلة للقراءة.",
      title: "حافظ على الثبات أثناء إجراء المسح",
    },
    camera_lens: {
      details:
        "يجب الحرص على خلو عدسة الكاميرا من البقع أو الغبار. فالعدسة المتسخة تتسبب في تشويش الصورة النهائية، وهذا يجعل تفاصيل البطاقة غير قابلة للقراءة ويمنع مسح البيانات بنجاح.",
      title: "يرجى تنظيف عدسة الكاميرا",
    },
    card_number: {
      details:
        "يتكون رقم البطاقة عادةً من 16 رقمًا، على الرغم من أنه قد يتراوح بين 12 و 19 رقمًا. يجب أن تكون مطبوعة أو منقوشة بأرقام بارزة في البطاقة. يمكن أن تكون موجودة في وجه البطاقة أو ظهرها.",
      title: "أين يوجد رقم البطاقة؟",
    },
    done_btn: "انتهى",
    done_btn_aria: "استئناف المسح الضوئي",
    lighting: {
      details:
        "تجنب الضوء الشديد المباشر لأنه ينعكس من البطاقة وقد يجعل أجزاء من البطاقة غير قابلة للقراءة. إذا لم تتمكن من قراءة البيانات الموجودة على البطاقة، فلن تكون مرئية للكاميرا أيضًا.",
      title: "احترس من الإضاءة الساطعة",
    },
    next_btn: "التالي",
    occlusion: {
      details:
        "تأكد من أنك لا تغطي أي جزء من البطاقة بإصبعك، بما في ذلك الخطوط السفلية. واحترس أيضًا من انعكاسات الهولوغرام التي تمر عبر حقول البطاقات.",
      title: "تأكد من وضوح جميع الخانات",
    },
  },
  onboarding_modal: {
    aria: "تعليمات المسح الضوئي",
    btn: "بدء المسح",
    details:
      "يتكون رقم البطاقة عادةً من 16 رقمًا. يجب أن يكون مطبوعًا أو منقوشًا بشكل بارز في البطاقة. تأكد من أن البطاقة موجودة في مكان جيد الإضاءة وأن جميع التفاصيل مرئية.",
    details_desktop:
      "يتكون رقم البطاقة عادةً من 16 عدداً. وينبغي أن يكون مطبوعاً أو منقوشاً بشكل بارز في البطاقة. يجب الحرص على نظافة عدسات الكاميرا ووجود البطاقة في إضاءة مناسبة ووضوح جميع التفاصيل.",
    title: "امسح رقم البطاقة أولًا",
  },
  sdk_aria: "شاشة مسح البطاقة",
  timeout_modal: {
    cancel_btn: "إلغاء",
    details: "تعذرت قراءة البطاقة. الرجاء إعادة المحاولة.",
    retry_btn: "إعادة المحاولة",
    title: "تمت عملية المسح بنجاح",
  },
} as const;
