/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for bn.
 */
export default {
  feedback_messages: {
    blur_detected: "কার্ড এবং ফোন স্থির রাখুন",
    blur_detected_desktop: "কার্ড এবং ডিভাইস স্থির রাখুন",
    camera_angle_too_steep: "কার্ডটি ফোনের সঙ্গে সমান্তরাল করে ধরুন",
    camera_angle_too_steep_desktop: "কার্ডটি স্ক্রিনের সমান্তরালে রাখুন",
    card_number_scanned: "সফল! কার্ডের নম্বর সাইড স্ক্যান হয়েছে",
    card_scanned: "সফল! কার্ড স্ক্যান হয়েছে",
    document_too_close_to_edge: "আরও দূরে যান",
    flip_card: "কার্ডটি উল্টে দিন",
    flip_to_back_side: "কার্ডটি উল্টে দিন",
    move_closer: "আরও কাছে যান",
    move_farther: "আরও দূরে যান",
    occluded: "কার্ডটি পুরোপুরি দৃশ্যমান রাখুন",
    scan_the_back_side: "কার্ডের অন্য দিকটি স্ক্যান করুন",
    scan_the_front_side: "কার্ড নম্বর স্ক্যান করুন",
  },
  help_button: { aria_label: "সহায়তা", tooltip: "সাহায্য দরকার?" },
  help_modal: {
    back_btn: "পেছনে",
    blur: {
      details:
        "স্ক্যান করার সময় ফোন এবং কার্ড দুটোই স্থির রাখার চেষ্টা করুন। যেকোনো একটিকে নাড়ালে ছবি ঝাপসা হয়ে যেতে পারে এবং কার্ডের তথ্য পড়া অসম্ভব হয়ে যেতে পারে।",
      details_desktop:
        "স্ক্যান করার সময় ডিভাইস ও কার্ড দুটিই স্থির রাখার চেষ্টা করুন। যেকোনো একটি নড়াচড়া করলে ছবি ঝাপসা হতে পারে এবং কার্ডের তথ্য পড়া সম্ভব নাও হতে পারে।",
      title: "স্ক্যান করার সময় স্থির থাকুন",
    },
    camera_lens: {
      details:
        "আপনার ক্যামেরার লেন্সে ময়লা বা দাগ আছে কি না পরীক্ষা করুন। লেন্স নোংরা হলে ছবিটি ঝাপসা হয়ে যায়, ফলে কার্ডের তথ্য পড়া যায় না এবং ডেটা সফলভাবে স্ক্যান করা সম্ভব হয় না।",
      title: "আপনার ক্যামেরার লেন্স পরিষ্কার করুন",
    },
    card_number: {
      details:
        "কার্ড নম্বর সাধারণত 16 সংখ্যার হয়, তবে এটি 12 থেকে 19 সংখ্যারও হতে পারে। এটি কার্ডের উপর উঁচু অক্ষরে খোদাই করা বা ছাপানো থাকে। এটি কার্ডের সামনে বা পিছনে থাকতে পারে।",
      title: "কার্ড নম্বর কোথায় থাকে?",
    },
    done_btn: "সম্পন্ন",
    lighting: {
      details:
        "অত্যধিক তীব্র আলো ব্যবহার করা থেকে বিরত থাকুন, কারণ সেটি কার্ডে প্রতিফলিত হয়ে কিছু অংশ পড়া কঠিন করে তুলতে পারে। যদি আপনি নিজেই কার্ডের তথ্য পড়তে না পারেন, তাহলে ক্যামেরাও তা ধরতে পারবে না।",
      title: "তীব্র আলো এড়িয়ে চলুন",
    },
    next_btn: "পরবর্তী",
    occlusion: {
      details:
        "নিশ্চিত করুন যে আপনি আঙুল দিয়ে কার্ডের কোনো অংশ, বিশেষ করে নিচের দিকের লাইনগুলো ঢেকে ফেলছেন না। এছাড়াও কার্ডের উপর থাকা হলোগ্রামের প্রতিফলন যেন কার্ডের তথ্যের উপর না পড়ে, সেদিকেও খেয়াল রাখুন।",
      title: "সমস্ত ফিল্ড দৃশ্যমান রাখুন",
    },
  },
  onboarding_modal: {
    btn: "স্ক্যান শুরু করুন",
    details:
      "কার্ড নম্বর সাধারণত 16-সংখ্যার একটি নম্বর হয়। এটি কার্ডের উপর উঁচু অক্ষরে ছাপানো বা খোদাই করা থাকে। নিশ্চিত করুন যে কার্ডটি ভালোভাবে আলোকিত এবং সব বিবরণ স্পষ্টভাবে দৃশ্যমান।",
    details_desktop:
      "কার্ড নম্বর সাধারণত 16 সংখ্যার হয়। এটি কার্ডের ওপর ছাপা থাকতে পারে অথবা উঁচু করে লেখা থাকতে পারে। নিশ্চিত করুন আপনার ক্যামেরার লেন্স পরিষ্কার, কার্ডে পর্যাপ্ত আলো আছে এবং সব তথ্য স্পষ্টভাবে দেখা যাচ্ছে।",
    title: "প্রথমে কার্ড নম্বর স্ক্যান করুন",
  },
  timeout_modal: {
    cancel_btn: "বাতিল করুন",
    details: "কার্ডটি পড়া যাচ্ছে না। অনুগ্রহ করে আবার চেষ্টা করুন।",
    retry_btn: "পুনরায় চেষ্টা করুন",
    title: "স্ক্যান ব্যর্থ হয়েছে",
  },
} as const;
