/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for el.
 */
export default {
  feedback_messages: {
    blur_detected: "Κρατήστε την κάρτα και το τηλέφωνο ακίνητα",
    blur_detected_desktop: "Κρατήστε την κάρτα και τη συσκευή ακίνητες",
    camera_angle_too_steep: "Κρατήστε την κάρτα παράλληλα με το τηλέφωνο",
    camera_angle_too_steep_desktop: "Κρατήστε την κάρτα παράλληλα με την οθόνη",
    card_number_scanned:
      "Επιτυχής σάρωση της πλευράς της κάρτας με τον αριθμό!",
    card_scanned: "Επιτυχής σάρωση κάρτας!",
    document_too_close_to_edge: "Απομακρυνθείτε",
    flip_card: "Αντιστρέψτε την κάρτα",
    flip_to_back_side: "Αντιστρέψτε την κάρτα",
    move_closer: "Πλησιάστε",
    move_farther: "Απομακρυνθείτε",
    occluded: "Κρατήστε την κάρτα έτσι ώστε να είναι πλήρως ορατή",
    scan_the_back_side: "Σαρώστε την άλλη πλευρά της κάρτας",
    scan_the_front_side: "Σαρώστε τον αριθμό κάρτας",
  },
  help_button: { aria_label: "Βοήθεια", tooltip: "Χρειάζεστε βοήθεια;" },
  help_modal: {
    aria: "Βοήθεια για τη σάρωση",
    back_btn: "Πίσω",
    blur: {
      details:
        "Προσπαθήστε να κρατήσετε το τηλέφωνο και την κάρτα ακίνητα κατά τη σάρωση. Η μετακίνηση οποιουδήποτε από τα δύο μπορεί να θολώσει την εικόνα και να καταστήσει τα δεδομένα στην κάρτα δυσανάγνωστα.",
      details_desktop:
        "Προσπαθήστε να κρατήσετε τη συσκευή και την κάρτα ακίνητες κατά τη σάρωση. Η μετακίνηση οποιασδήποτε από τις δύο μπορεί να θαμπώσει την εικόνα και να καταστήσει τα δεδομένα στην κάρτα δυσανάγνωστα.",
      title: "Μείνετε ακίνητοι κατά τη σάρωση",
    },
    camera_lens: {
      details:
        "Ελέγξτε τον φακό της κάμεράς σας για λεκέδες ή σκόνη. Ένας βρώμικος φακός προκαλεί θάμπωμα της τελικής εικόνας, καθιστώντας τα στοιχεία της κάρτας δυσανάγνωστα και εμποδίζοντας την επιτυχή σάρωση των δεδομένων.",
      title: "Καθαρίστε τον φακό της κάμεράς σας",
    },
    card_number: {
      details:
        "Ο αριθμός της κάρτας είναι συνήθως 16ψήφιος, παρότι ενδέχεται να περιλαμβάνει από 12 έως 19 ψηφία. Θα αναγράφεται ή θα είναι χαραγμένος με ανάγλυφους αριθμούς πάνω στην κάρτα. Μπορεί να αναγράφεται στην μπροστινή ή την πίσω όψη της.",
      title: "Πού βρίσκεται ο αριθμός κάρτας;",
    },
    done_btn: "Τέλος",
    done_btn_aria: "Συνέχιση σάρωσης",
    lighting: {
      details:
        "Αποφύγετε το άμεσο, έντονο φως, επειδή αντανακλάται από την κάρτα και μπορεί να κάνει ορισμένα μέρη της δυσανάγνωστα. Εάν δεν μπορείτε να διαβάσετε δεδομένα στην κάρτα, δεν θα είναι ορατά ούτε στην κάμερα.",
      title: "Προσέξτε το έντονο φως",
    },
    next_btn: "Επόμενο",
    occlusion: {
      details:
        "Βεβαιωθείτε ότι δεν καλύπτετε μέρη της κάρτας με το δάχτυλό σας, συμπεριλαμβανομένων των κάτω γραμμών. Επίσης, προσέξτε τις αντανακλάσεις ολογράμματος που καλύπτουν τα πεδία της κάρτας.",
      title: "Φροντίστε όλα τα πεδία να είναι ορατά",
    },
  },
  onboarding_modal: {
    aria: "Οδηγίες σάρωσης",
    btn: "Έναρξη σάρωσης",
    details:
      "Ο αριθμός της κάρτας είναι συνήθως 16ψήφιος. Θα αναγράφεται ή θα είναι χαραγμένος με ανάγλυφους αριθμούς πάνω στην κάρτα. Βεβαιωθείτε ότι η κάρτα είναι καλά φωτισμένη και όλα τα στοιχεία της είναι ορατά.",
    details_desktop:
      "Ο αριθμός της κάρτας είναι συνήθως ένας 16ψήφιος αριθμός. Θα πρέπει να είναι είτε τυπωμένος είτε ανάγλυφος με υπερυψωμένους αριθμούς σε ολόκληρη την κάρτα. Βεβαιωθείτε ότι ο φακός της κάμεράς σας είναι καθαρός, η κάρτα είναι καλά φωτισμένη και όλες οι λεπτομέρειες είναι ορατές.",
    title: "Σαρώστε πρώτα τον αριθμό κάρτας",
  },
  sdk_aria: "Οθόνη σάρωσης κάρτας",
  timeout_modal: {
    cancel_btn: "Ακύρωση",
    details: "Δεν είναι δυνατή η ανάγνωση της κάρτας. Δοκιμάστε ξανά.",
    retry_btn: "Επανάληψη",
    title: "Η σάρωση ήταν ανεπιτυχής.",
  },
} as const;
