/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for fa-latn.
 */
export default {
  feedback_messages: {
    blur_detected: "کارت و تلفن را ثابت نگه دارید",
    blur_detected_desktop: "کارت و دستگاه را ثابت نگه دارید",
    camera_angle_too_steep: "کارت را موازی با تلفن نگه دارید",
    camera_angle_too_steep_desktop: "کارت را موازی با صفحه نمایش نگه دارید",
    card_number_scanned: "با موفقیت انجام شد! شماره کارت اسکن شد",
    card_scanned: "با موفقیت انجام شد! کارت اسکن شد",
    document_too_close_to_edge: "دورتر حرکت کن",
    flip_card: "کارت را برگردانید",
    flip_to_back_side: "کارت را برگردانید",
    move_closer: "نزدیکتر حرکت کن",
    move_farther: "دورتر حرکت کن",
    occluded: "کارت را کاملاً قابل مشاهده نگه دارید",
    scan_the_back_side: "طرف دیگر کارت را اسکن کنید",
    scan_the_front_side: "شماره کارت را اسکن کنید",
  },
  help_button: { aria_label: "کمک", tooltip: "به کمک نیاز دارید؟" },
  help_modal: {
    aria: "کمک در اسکن",
    back_btn: "برگشت",
    blur: {
      details:
        "سعی کنید هنگام اسکن، گوشی و کارت را ثابت نگه دارید. حرکت دادن هر دو می‌تواند تصویر را تار کند و اطلاعات روی کارت را غیرقابل خواندن کند.",
      details_desktop:
        "سعی کنید هنگام اسکن، دستگاه و کارت را ثابت نگه دارید. حرکت دادن هر یک از آنها می‌تواند تصویر را تار کند و داده‌های روی کارت را غیرقابل خواندن کند.",
      title: "هنگام اسکن کردن بی‌حرکت بمانید",
    },
    camera_lens: {
      details:
        "لنز دوربین خود را از نظر لکه یا گرد و غبار بررسی کنید. لنز کثیف باعث تار شدن تصویر نهایی می‌شود و جزئیات کارت را غیرقابل خواندن می‌کند و مانع از اسکن موفقیت‌آمیز داده‌ها می‌شود.",
      title: "لنز دوربین خود را تمیز کنید",
    },
    card_number: {
      details:
        "شماره کارت معمولاً یک عدد ۱۶ رقمی است، اگرچه ممکن است بین ۱۲ تا ۱۹ رقم داشته باشد. این شماره باید یا چاپ شده باشد یا به صورت اعداد برجسته در سراسر کارت حک شده باشد. می‌تواند در جلو یا پشت کارت شما باشد.",
      title: "شماره کارت کجاست؟",
    },
    done_btn: "انجام شد",
    done_btn_aria: "اسکن را از سر بگیرید",
    lighting: {
      details:
        "از نور مستقیم و شدید پرهیز کنید زیرا از کارت منعکس می‌شود و می‌تواند بخش‌هایی از کارت را غیرقابل خواندن کند. اگر نتوانید داده‌های روی کارت را بخوانید، برای دوربین نیز قابل مشاهده نخواهد بود.",
      title: "مراقب نور شدید باشید",
    },
    next_btn: "بعدی",
    occlusion: {
      details:
        "مطمئن شوید که قسمت‌هایی از کارت، از جمله خطوط پایینی، را با انگشت نمی‌پوشانید. همچنین، مراقب بازتاب‌های هولوگرام باشید که از روی زمینه کارت‌ها عبور می‌کنند.",
      title: "همه فیلدها را قابل مشاهده نگه دارید",
    },
  },
  onboarding_modal: {
    aria: "دستورالعمل‌های اسکن",
    btn: "شروع اسکن",
    details:
      "شماره کارت معمولاً یک عدد ۱۶ رقمی است. این شماره باید یا چاپ شده باشد یا به صورت اعداد برجسته روی کارت حک شده باشد. مطمئن شوید که کارت به خوبی روشن است و تمام جزئیات آن قابل مشاهده است.",
    details_desktop:
      "شماره کارت معمولاً یک عدد ۱۶ رقمی است. باید یا چاپ شده باشد یا به صورت اعداد برجسته روی کارت حک شده باشد. مطمئن شوید که لنز دوربین شما تمیز است، کارت به خوبی روشن است و تمام جزئیات قابل مشاهده است.",
    title: "ابتدا شماره کارت را اسکن کنید",
  },
  sdk_aria: "صفحه اسکن کارت",
  timeout_modal: {
    cancel_btn: "لغو",
    details: "قادر به خواندن کارت نیست. لطفاً دوباره امتحان کنید.",
    retry_btn: "دوباره امتحان کنید",
    title: "اسکن ناموفق بود",
  },
} as const;
