/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for he.
 */
export default {
  feedback_messages: {
    blur_detected: "יש לדאוג שהכרטיס והטלפון לא יזוזו",
    blur_detected_desktop: "יש לדאוג שהכרטיס והמכשיר לא יזוזו",
    camera_angle_too_steep: "על הכרטיס להיות במקביל לטלפון",
    camera_angle_too_steep_desktop: "החזיקו את הכרטיס במקביל למסך",
    card_number_scanned: "הצלחנו! חזית הכרטיס נסרקה",
    card_scanned: "הצלחנו! הכרטיס נסרק",
    document_too_close_to_edge: "התרחק/י",
    flip_card: "הפוך את הכרטיס",
    flip_to_back_side: "הפוך את הכרטיס",
    move_closer: "קרב/י",
    move_farther: "התרחק/י",
    occluded: "שמור על הכרטיס גלוי לחלוטין",
    scan_the_back_side: "סרוק את הצד השני של הכרטיס",
    scan_the_front_side: "סרוק את מספר הכרטיס",
  },
  help_button: { aria_label: "עזרה", tooltip: "זקוקים לעזרה?" },
  help_modal: {
    aria: "סיוע בסריקה",
    back_btn: "חזור",
    blur: {
      details:
        "נסה לשמור על יציבות הטלפון והכרטיס בזמן הסריקה. הזזתם עלולה לטשטש את התמונה ולהפוך את הנתונים בכרטיס לבלתי קריאים.",
      details_desktop:
        "נסו לשמור על המכשיר והכרטיס יציבים בזמן הסריקה. תזוזה של כל אחד מהם עלולה לטשטש את התמונה ולהפוך את הנתונים בכרטיס לבלתי קריאים.",
      title: "הישאר יציב בזמן הסריקה",
    },
    camera_lens: {
      details:
        "בדקו את עדשת המצלמה שלכם לאיתור כתמים או אבק. עדשה מלוכלכת גורמת לטשטוש התמונה הסופית, מה שהופך את פרטי הכרטיס לבלתי קריאים ומונעת סריקה מוצלחת של הנתונים.",
      title: "יש לנקות את עדשת המצלמה",
    },
    card_number: {
      details:
        "מספר הכרטיס הוא בדרך כלל באורך 16 ספרות, אם כי הוא יכול להיות באורך של בין 12 ל-19 ספרות. זה צריך להיות מודפס או מוטבע עם מספרים בולטים על פני הכרטיס. זה יכול להיות בחלק הקדמי או האחורי של הכרטיס שלך.",
      title: "היכן מספר הכרטיס?",
    },
    done_btn: "בוצע",
    done_btn_aria: "המשך סריקה",
    lighting: {
      details:
        "הימנע מאור ישיר חזק מכיוון שהוא משתקף מהכרטיס ועלול להפוך חלקים מהכרטיס לבלתי קריאים. אם אינך יכול לקרוא את הנתונים בכרטיס, הם גם לא יהיו גלויים גם למצלמה.",
      title: "התרחק מאור חזק",
    },
    next_btn: "הבא",
    occlusion: {
      details:
        "יש להקפיד שלא לכסות חלקים מהמסמך באצבע, כולל השורות התחתונות.כמו כן, יש לשים לב להשתקפויות הולוגרמה העוברות על שדות הכרטיסים.",
      title: "כל השדות צריכים להיות גלויים",
    },
  },
  onboarding_modal: {
    aria: "הנחיות סריקה",
    btn: "התחלת סריקה",
    details:
      "מספר הכרטיס הוא בדרך כלל באורך 16 ספרות. זה צריך להיות מודפס או מוטבע עם מספרים בולטים על פני הכרטיס. יש לוודא שהתאורה טובה וכל הפרטים גלויים.",
    details_desktop:
      "מספר הכרטיס הוא בדרך כלל מספר בן 16 ספרות. עליו להיות מודפס או מוטבע בספרות מובלטות לרוחב הכרטיס. יש לוודא שעדשת המצלמה נקייה, שהכרטיס מואר היטב וכל פרטיו גלויים.",
    title: "תחילה סרוק את מספר הכרטיס",
  },
  sdk_aria: "מסך סריקת כרטיס",
  timeout_modal: {
    cancel_btn: "ביטול",
    details: "לא ניתן לקרוא את הכרטיס. נא לנסות שוב.",
    retry_btn: "לנסות שוב",
    title: "הסריקה נכשלה",
  },
} as const;
