/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for hi.
 */
export default {
  feedback_messages: {
    blur_detected: "कार्ड और फोन को स्थिर रखें",
    blur_detected_desktop: "कार्ड और डिवाइस को स्थिर रखें",
    camera_angle_too_steep: "कार्ड को फोन के समानांतर रखें",
    camera_angle_too_steep_desktop: "कार्ड को स्क्रीन के समानांतर रखें",
    card_number_scanned: "सफलता! कार्ड नंबर साइड स्कैन हो गया",
    card_scanned: "सफलता! कार्ड स्कैन हो गया",
    document_too_close_to_edge: "दूर जाएँ",
    flip_card: "कार्ड को पलटें",
    flip_to_back_side: "कार्ड को पलटें",
    move_closer: "पास आएँ",
    move_farther: "दूर जाएँ",
    occluded: "कार्ड पूरी तरह से दिखाई देना चाहिए.",
    scan_the_back_side: "कार्ड के दूसरे साइड को स्कैन करें",
    scan_the_front_side: "कार्ड नंबर को स्कैन करें",
  },
  help_button: { aria_label: "सहायता", tooltip: "मदद चाहिए?" },
  help_modal: {
    back_btn: "पिछला",
    blur: {
      details:
        "स्कैन करते समय फ़ोन और कार्ड को स्थिर रखने का प्रयास करें. किसी भी एक को हिलाने से छवि धुंधली हो सकती है और कार्ड पर मौजूद डेटा पढ़ने योग्य नहीं रह सकता.",
      details_desktop:
        "स्कैन करते समय डिवाइस और कार्ड को स्थिर रखने की कोशिश करें. हिलते-डुलते रहने से छवि धुंधली हो सकती है और कार्ड पर मौजूद डेटा नहीं पढ़ा जा सकता है.",
      title: "स्कैन करते समय स्थिर रहें",
    },
    camera_lens: {
      details:
        "अपने कैमरे के लेंस पर लगे धब्बों या धूल की जांच करें. गंदे लेंस के कारण अंतिम छवि धुंधली हो जाती है, जिससे कार्ड की जानकारी पढ़ना मुश्किल हो जाता है और डेटा को सफलतापूर्वक स्कैन नहीं किया जा सकता है.",
      title: "अपने कैमरे के लेंस को साफ करें",
    },
    card_number: {
      details:
        "कार्ड नंबर आमतौर पर 16 अंकों का होता है, हालाँकि इसमें 12 से 19 अंक भी हो सकते हैं. इसे कार्ड पर उभरे हुए अंकों में या तो प्रिंट किया होना चाहिए या फिर उभरा हुआ होना चाहिए. यह आपके कार्ड के आगे या पीछे हो सकता है.",
      title: "कार्ड नंबर कहां है?",
    },
    done_btn: "हो गया",
    lighting: {
      details:
        "कार्ड पर सीधी और तेज़ रोशनी डालने से बचें क्योंकि यह कार्ड से परावर्तित होकर कार्ड के कुछ हिस्सों को न पढ़ सकने लायक बना सकती हैं. अगर आप कार्ड पर मौजूद डेटा को नहीं पढ़ पा रहे हैं, तो वह कैमरे को भी दिखाई नहीं देगा.",
      title: "कठोर प्रकाश से सावधान रहें",
    },
    next_btn: "अगला",
    occlusion: {
      details:
        "ध्यान रखें कि आप अपनी उँगलियों से कार्ड के नीचे की रेखाओं सहित, किसी भी हिस्से को न ढकें. साथ ही, कार्ड के किनारों पर पड़ने वाले होलोग्राम प्रतिबिंबों पर भी ध्यान दें.",
      title: "इस प्रकार रखें की सभी फील्ड पूरी तरह दिखाई दे",
    },
  },
  onboarding_modal: {
    btn: "स्कैन करना शुरू करें",
    details:
      "कार्ड नंबर आमतौर पर 16 अंकों का होता है. इसे कार्ड पर उभरे हुए अंकों में या तो प्रिंट किया हुआ या उभरा हुआ होना चाहिए. सुनिश्चित करें कि कार्ड पर पर्याप्त रोशनी हो और सभी विवरण दिखाई दे रहे हों.",
    details_desktop:
      "कार्ड नंबर आमतौर पर 16 अंकों का होता है. यह कार्ड पर छपा हुआ या उभरे हुए अंकों में होना चाहिए. सुनिश्चित कर लें कि आपके कैमरे का लेंस साफ हो, कार्ड पर पर्याप्त रोशनी हो और सभी विवरण स्पष्ट रूप से दिखाई दे रहे हों.",
    title: "पहले कार्ड नंबर को स्कैन करें",
  },
  timeout_modal: {
    cancel_btn: "रद्द करें",
    details: "कार्ड पढ़ा नहीं जा सका. कृपया दोबारा प्रयास करें।",
    retry_btn: "दोबारा प्रयास करें",
    title: "स्कैन असफल हुआ",
  },
} as const;
