/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ka_GE.
 */
export default {
  feedback_messages: {
    blur_detected: "არ გაამოძრაოთ ბარათი და ტელეფონი",
    blur_detected_desktop: "არ გაამოძრაოთ ბარათი და მოწყობილობა",
    camera_angle_too_steep: "ბარათი ტელეფონის პარალელურად დაიჭირეთ",
    camera_angle_too_steep_desktop: "ბარათი ეკრანის პარალელურად დაიჭირეთ",
    card_number_scanned: "წარმატებული! ბარათის ნომრის მხარე დასკანერებულია",
    card_scanned: "წარმატებული! ბარათი დასკანერებულია",
    document_too_close_to_edge: "გადადით მოშორებით",
    flip_card: "ამოატრიალეთ ბარათი",
    flip_to_back_side: "ამოატრიალეთ ბარათი",
    move_closer: "მიუახლოვდით",
    move_farther: "გადადით მოშორებით",
    occluded: "ბარათი სრულად უნდა ჩანდეს",
    scan_the_back_side: "დაასკანერეთ ბარათის მეორე მხარე",
    scan_the_front_side: "დაასკანერეთ ბარათის ნომერი",
  },
  help_button: { aria_label: "დახმარება", tooltip: "დახმარება გჭირდებათ?" },
  help_modal: {
    aria: "დასკანერებაში დახმარება",
    back_btn: "უკან",
    blur: {
      details:
        "დასკანერებისას ეცადეთ არ გაამოძრაოთ ტელეფონი და ბარათი. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და ბარათზე ასახული მონაცემები გარჩევადი არ იყოს.",
      details_desktop:
        "დასკანერებისას ეცადეთ არ გაამოძრაოთ მოწყობილობა და ბარათი. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და ბარათზე ასახული მონაცემები გარჩევადი არ იყოს.",
      title: "არ იმოძრაოთ დასკანერებისას",
    },
    camera_lens: {
      details:
        "დაათვალიერეთ კამერის ლინზა ლაქების ან მტვრის აღმოსაჩენად. ჭუჭყიანი ლინზა გამოიწვევს საბოლოო ფოტოს დაბურვას, ბარათის დეტალები გარჩევადი არ იქნება და მონაცემების წარმატებით დასკანერება ვერ მოხერხდება.",
      title: "გაწმინდეთ თქვენი კამერის ლინზა",
    },
    card_number: {
      details:
        "ბარათის ნომერი, როგორც წესი, 16 ციფრისგან შედგება, თუმცა მასში შეიძლება იყოს 12-დან 19 ციფრამდე. ეს ნომერი ან დაბეჭდილი უნდა იყოს, ან ამოტვიფრული ამობურცული ციფრებით ბარათზე. ის შეიძლება თქვენი ბარათის წინა ან უკანა მხარეს იყოს დატანილი.",
      title: "სად არის დატანილი ბარათის ნომერი?",
    },
    done_btn: "დასრულდა",
    done_btn_aria: "დასკანერების გაგრძელება",
    lighting: {
      details:
        "მოერიდეთ პირდაპირ მკვეთრ განათებას, რადგან ის ბარათზე ანარეკლს აჩენს და ბარათის ნაწილები შესაძლოა გარჩევადი აღარ იყოს. თუ ბარათზე მოცემულ მონაცემებს ვერ კითხულობთ, მას ვერც კამერა დააფიქსირებს.",
      title: "მოერიდეთ მკვეთრ განათებას",
    },
    next_btn: "შემდეგი",
    occlusion: {
      details:
        "დარწმუნდით, რომ თითით ბარათის ნაწილებს არ ფარავთ, მათ შორის ქვედა ხაზებსაც. ასევე, ფრთხილად იყავით ჰოლოგრამულ ანარეკლებთანაც, რომლებიც ბარათის ველებზე გადადის.",
      title: "ყველა ველი უნდა ჩანდეს",
    },
  },
  onboarding_modal: {
    aria: "დასკანერების ინსტრუქციები",
    btn: "დასკანერების დაწყება",
    details:
      "ბარათის ნომერი, როგორც წესი, 16 ციფრისგან შედგება. ეს ნომერი ან დაბეჭდილი უნდა იყოს, ან ამოტვიფრული ამობურცული ციფრებით ბარათზე. დარწმუნდით, რომ ბარათი კარგადაა განათებული და ყველა დეტალი ჩანს.",
    details_desktop:
      "ბარათის ნომერი, როგორც წესი, 16 ციფრისგან შედგება. ეს ნომერი ან დაბეჭდილი უნდა იყოს, ან ამოტვიფრული ამობურცული ციფრებით ბარათზე. დარწმუნდით, რომ კამერის ლინზა სუფთაა, ბარათი კარგადაა განათებული და ყველა დეტალი ჩანს.",
    title: "ჯერ ბარათის ნომერი დაასკანერეთ",
  },
  sdk_aria: "ბარათის დასკანერების ეტაპი",
  timeout_modal: {
    cancel_btn: "გაუქმება",
    details: "ბარათის წაკითხვა ვერ ხერხდება. ხელახლა სცადეთ.",
    retry_btn: "ხელახლა ცდა",
    title: "სკანირება წარუმატებელია",
  },
} as const;
