/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for kk.
 */
export default {
  feedback_messages: {
    blur_detected: "Карта мен телефонды қозғалтпай ұстаңыз",
    blur_detected_desktop: "Карта мен құрылғыны қозғалтпай ұстаңыз",
    camera_angle_too_steep: "Картаны телефонға параллель етіп ұстаңыз",
    camera_angle_too_steep_desktop: "Картаны дисплейге параллель етіп ұстаңыз",
    card_number_scanned: "Сәтті! Карта нөмірлері жағы сканерленді",
    card_scanned: "Сәтті! Карта сканерленді",
    document_too_close_to_edge: "Алыстаңыз",
    flip_card: "Картаны айналдырыңыз",
    flip_to_back_side: "Картаны айналдырыңыз",
    move_closer: "Жақындатыңыз",
    move_farther: "Алыстаңыз",
    occluded: "Картаны толықтай көрінетін етіп ұстаңыз",
    scan_the_back_side: "Картаның басқа жағын сканерлеңіз",
    scan_the_front_side: "Карта нөмірін сканерлеңіз",
  },
  help_button: { aria_label: "Анықтама", tooltip: "Көмек керек пе?" },
  help_modal: {
    back_btn: "Артқа қайту",
    blur: {
      details:
        "Сканерлеу кезінде телефон мен картаны мүмкіндігінше қозғалтпай ұстаңыз. Екеуінің де қозғалысы суретті бұлыңғыр етіп, картадағы деректерді оқылмайтындай етіп жіберуі мүмкін.",
      details_desktop:
        "Сканерлеу кезінде құрылғы мен картаны мүмкіндігінше қозғалтпай ұстаңыз. Екеуінің де қозғалысы суретті бұлыңғыр етіп, картадағы деректерді оқылмайтындай етіп жіберуі мүмкін.",
      title: "Сканерлеу кезінде қозғалмаңыз",
    },
    camera_lens: {
      details:
        "Камера объективінде дақ немесе шаң бар-жоғын тексеріңіз. Лас объектив қорытынды кескіннің бұлыңғырлануына әкеледі, ал бұл өз кезегінде карта деректерінің оқылмауына алып келеді және сканерлеуге кедергі келтіреді.",
      title: "Камера объективін тазалаңыз",
    },
    card_number: {
      details:
        "Карта нөмірі әдетте 16 таңбалы саннан тұрады және сондай-ақ 12 мен 19 сан аралығында болуы мүмкін. Ол басып шығарылуы немесе карта бойынша жоғары сандармен бедерлі болуы керек. Ол картаның алдыңғы немесе артында болуы мүмкін.",
      title: "Карта нөмірі қай жерде?",
    },
    done_btn: "Дайын",
    lighting: {
      details:
        "Тікелей және қатты жарықтан арырақ тұрыңыз, себебі ол картадан шағылысып, кейбір бөліктерін оқуға мүмкіндік бермейді. Егер картадағы деректер сізге көрінбесе, олар камераға да көрінбейді.",
      title: "Тым жарық жерден әрі тұрыңыз",
    },
    next_btn: "Келесі",
    occlusion: {
      details:
        "Саусағыңызбен картаның кейбір бөліктерін, әсіресе төменгі жолдарын жауып қалмаңыз. Сондай-ақ, карта өрістерінің үстінен өтетін голограммалық шағылыстарға да назар аударыңыз.",
      title: "Барлық өрістердің көрініп тұрғанына көз жеткізіңіз",
    },
  },
  onboarding_modal: {
    btn: "Сканерлеуді бастау",
    details:
      "Карта нөмірі әдетте 16 таңбалы саннан тұрады. Ол басып шығарылуы немесе карта бойынша жоғары сандармен бедерлі болуы керек. Картаның жақсы жарық бар жерде орналасқанына және барлық мәліметтер көрінетініне көз жеткізіңіз.",
    details_desktop:
      "Карта нөмірі әдетте 16 таңбалы саннан тұрады. Ол басып шығарылуы немесе карта бойынша жоғары сандармен бедерлі болуы керек. Камера объективі таза екеніне, картаның жақсы жарық бар жерде орналасқанына және барлық мәліметтер көрінетініне көз жеткізіңіз.",
    title: "Алдымен карта нөмірін сканерлеңіз",
  },
  timeout_modal: {
    cancel_btn: "Бас тарту",
    details: "Картаны оқу мүмкін болмады. Әрекетті қайталаңыз.",
    retry_btn: "Қайталау",
    title: "Сканерлене алмады",
  },
} as const;
