/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for km_KH.
 */
export default {
  feedback_messages: {
    blur_detected: "រក្សាកាត និងទូរស័ព្ទឱ្យនៅដដែល",
    blur_detected_desktop: "រក្សាកាត និងឧបករណ៍ឱ្យនៅដដែល",
    camera_angle_too_steep: "រក្សាកាតស្របទៅនឹងទូរស័ព្ទ",
    camera_angle_too_steep_desktop: "រក្សាកាតស្របទៅនឹងអេក្រង់",
    card_number_scanned: "ជោគជ័យ! បានស្កេនផ្នែកខាងលេខកាត",
    card_scanned: "ជោគជ័យ! បានស្កេនកាត",
    document_too_close_to_edge: "ផ្លាស់ទីទៅឆ្ងាយ",
    flip_card: "ត្រឡប់កាត",
    flip_to_back_side: "ត្រឡប់កាត",
    move_closer: "ផ្លាស់ទីទៅជិត",
    move_farther: "ផ្លាស់ទីទៅឆ្ងាយ",
    occluded: "រក្សា​កាត​ឱ្យ​មើល​ឃើញ​យ៉ាង​ពេញលេញ",
    scan_the_back_side: "ស្កេនផ្នែកម្ខាងទៀតនៃកាត",
    scan_the_front_side: "ស្កេនលេខកាត",
  },
  help_button: { aria_label: "ជំនួយ", tooltip: "ត្រូវការជំនួយ?" },
  help_modal: {
    aria: "ជំនួយក្នុងការស្កេន",
    back_btn: "ត្រឡប់មកវិញ",
    blur: {
      details:
        "ព្យាយាមរក្សាទូរស័ព្ទ និងកាតឱ្យនៅស្ងៀមពេលកំពុងស្កេន។ ការផ្លាស់ទីទាំងពីរអាចធ្វើឱ្យរូបភាពព្រិល និងធ្វើឱ្យទិន្នន័យនៅលើកាតមិនអាចអានបាន។",
      details_desktop:
        "ព្យាយាមរក្សាឧបករណ៍ និងកាតឱ្យនៅដដែល ពេលកំពុងស្កេន។ ការផ្លាស់ទីទាំងពីរអាចធ្វើឱ្យរូបភាពព្រិល និងធ្វើឱ្យទិន្នន័យនៅលើកាតមិនអាចអានបាន។",
      title: "រក្សាភាពស្ងៀមស្ងាត់ខណៈពេលកំពុងស្កេន",
    },
    camera_lens: {
      details:
        "ពិនិត្យមើលកញ្ចក់កាមេរ៉ារបស់អ្នកសម្រាប់ស្នាមប្រឡាក់ ឬធូលី។ កញ្ចក់កខ្វក់ធ្វើឱ្យរូបភាពចុងក្រោយព្រាល ធ្វើឱ្យព័ត៌មានលម្អិតកាតមិនអាចអានបាន និងការពារការស្កេនទិន្នន័យដោយជោគជ័យ។",
      title: "សម្អាតកញ្ចក់កាមេរ៉ារបស់អ្នក។",
    },
    card_number: {
      details:
        "លេខកាតជាធម្មតាជាលេខ 16 ខ្ទង់ ទោះបីជាវាអាចមានចន្លោះពី 12 ទៅ 19 ខ្ទង់ក៏ដោយ។ វាគួរតែត្រូវបានបោះពុម្ព ឬក្រឡោតជាលេខដែលបានលើកឡើងនៅទូទាំងកាត។ វាអាចនៅខាងមុខ ឬខាងក្រោយកាតរបស់អ្នក។",
      title: "តើលេខកាតនៅឯណា?",
    },
    done_btn: "រួចរាល់",
    done_btn_aria: "បន្តស្កេន",
    lighting: {
      details:
        "ជៀសវាងពន្លឺខ្លាំងដោយផ្ទាល់ ព្រោះវាឆ្លុះបញ្ចាំងពីកាត ហើយអាចធ្វើឱ្យផ្នែកខ្លះនៃកាតមិនអាចអានបាន។ ប្រសិនបើអ្នកមិនអាចអានទិន្នន័យនៅលើកាតបានទេ វាក៏មិនអាចមើលឃើញដោយកាមេរ៉ាដែរ។",
      title: "ប្រយ័ត្នចំពោះពន្លឺខ្លាំង",
    },
    next_btn: "បន្ទាប់",
    occlusion: {
      details:
        "ត្រូវប្រាកដថាអ្នកមិនគ្របដណ្តប់ផ្នែកនៃកាតដោយប្រើម្រាមដៃ រួមទាំងបន្ទាត់ខាងក្រោម។ ដូចគ្នានេះផងដែរ, ប្រយ័ត្នសម្រាប់ការឆ្លុះបញ្ចាំង hologram ដែលឆ្លងកាត់វាលរបស់សន្លឹកបៀ។",
      title: "រក្សាវាលទាំងអស់ដែលអាចមើលឃើញ",
    },
  },
  onboarding_modal: {
    aria: "ការណែនាំអំពីការស្កេន",
    btn: "ចាប់ផ្តើមស្កេន",
    details:
      "លេខកាតជាធម្មតាជាលេខ 16 ខ្ទង់។ វាគួរតែត្រូវបានបោះពុម្ព ឬក្រឡោតជាលេខដែលបានលើកឡើងនៅទូទាំងកាត។ ត្រូវប្រាកដថាកាតមានពន្លឺល្អ ហើយព័ត៌មានលម្អិតទាំងអស់អាចមើលឃើញ។",
    details_desktop:
      "លេខកាតជាធម្មតាជាលេខ 16 ខ្ទង់។ វាគួរតែត្រូវបានបោះពុម្ព ឬក្រឡោតជាលេខដែលបានលើកឡើងនៅទូទាំងកាត។ ត្រូវប្រាកដថាកញ្ចក់កាមេរ៉ារបស់អ្នកស្អាត កាតមានពន្លឺល្អ ហើយព័ត៌មានលម្អិតទាំងអស់អាចមើលឃើញ។",
    title: "ស្កេនលេខកាតជាមុនសិន",
  },
  sdk_aria: "អេក្រង់ស្កេនកាត",
  timeout_modal: {
    cancel_btn: "បោះបង់",
    details: "មិនអាចអានកាតបានទេ។ សូមព្យាយាមម្តងទៀត។",
    retry_btn: "ព្យាយាមម្តងទៀត",
    title: "ស្កេនមិនជោគជ័យ",
  },
} as const;
