/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ne.
 */
export default {
  feedback_messages: {
    blur_detected: "कार्ड र फोन नहल्लाइ राख्नुहोस्",
    blur_detected_desktop: "कार्ड र डिभाइस नहल्लाइ राख्नुहोस्",
    camera_angle_too_steep:
      "कार्डलाई फोनको सिधा अगाडि बराबर हुने गरी राख्नुहोस्",
    camera_angle_too_steep_desktop:
      "कार्डलाई स्क्रिनसँग सिधा मिलाएर राख्नुहोस्",
    card_number_scanned: "सफल भयो! कार्डको नम्बर भएको भाग स्क्यान भयो",
    card_scanned: "सफल भयो! कार्ड स्क्यान भयो",
    document_too_close_to_edge: "पर जानुहोस्",
    flip_card: "कार्ड पल्टाउनुहोस्",
    flip_to_back_side: "कार्ड पल्टाउनुहोस्",
    move_closer: "नजिक जानुहोस्",
    move_farther: "पर जानुहोस्",
    occluded: "कार्ड देखिनेगरी राख्नुहोस्",
    scan_the_back_side: "कार्डको अर्को भाग स्क्यान गर्नुहोस्",
    scan_the_front_side: "कार्ड नम्बर स्क्यान गर्नुहोस्",
  },
  help_button: { aria_label: "मद्दत", tooltip: "सहयोग चाहिन्छ?" },
  help_modal: {
    aria: "स्क्यानिङ सहायता",
    back_btn: "पछाडि",
    blur: {
      details:
        "कृपया स्क्यान गर्दा फोन र कार्ड दुवैलाई नहल्लाई एकै ठाउँमा राख्नुहोस्। यी दुईमध्ये कुनै पनि हल्लिदा फोटो धमिलो हुन सक्छ र कार्डको जानकारी पढ्न गाह्रो हुन्छ।",
      details_desktop:
        "कृपया स्क्यान गर्दा डिभाइस र कार्ड दुवैलाई नहल्लाई एकै ठाउँमा राख्नुहोस्। यी दुईमध्ये कुनै पनि हल्लिदा फोटो धमिलो हुन सक्छ र कार्डको जानकारी पढ्न गाह्रो हुन्छ।",
      title: "स्क्यान गर्दा नहल्लिनुहोस्",
    },
    camera_lens: {
      details:
        "आफ्नो क्यामेराको लेन्समा दाग वा धूलो छ कि जाँच गर्नुहोस्। लेन्स फोहोर भएमा फोटो धमिलो आउँछ जसले गर्दा कार्डका विवरणहरू पढ्न सकिँदैन र डाटा स्क्यान गर्ने प्रक्रिया सफल हुँदैन।",
      title: "आफ्नो क्यामेराको लेन्स सफा गर्नुहोस्",
    },
    card_number: {
      details:
        "कार्ड नम्बर सामान्यतया 16 अंकको भए पनि, यो 12 देखि 19 अंकको बीचमा पनि हुन सक्छ। यो नम्बर कार्डमा माथि उठेका अक्षरमा इम्बोस्ड गरिएको वा छापिएको हुन्छ र कार्डको अगाडि वा पछाडि जुनसुकै भागमा हुन सक्छ।",
      title: "कार्ड नम्बर कहाँ छ?",
    },
    done_btn: "भयो",
    done_btn_aria: "स्क्यानिङ पुन: सुरु गर्नुहोस्",
    lighting: {
      details:
        "कार्डमा सीधै प्रकाश नपार्नुहोस्। चम्किलो प्रकाशले कार्डको विवरण पढ्न गाह्रो हुन्छ। तपाईंले पढ्न नसकेको कुनै पनि जानकारी क्यामेराले पनि चिन्न सक्दैन।",
      title: "तेजिलो प्रकाशबाट जोगिनुहोस्।",
    },
    next_btn: "अर्को",
    occlusion: {
      details:
        "औँलाले कार्डको तल्लो लाइनहरू सहितको कुनै पनि भाग नछोप्नुहोस्। साथै, कार्डका विवरणहरूमा पर्न सक्ने होलोग्रामको चमकबाट पनि जोगिनुहोस्।",
      title: "फिल्डहरू देखिनेगरी राख्नुहोस्",
    },
  },
  onboarding_modal: {
    aria: "स्क्यानिङ निर्देशनहरू",
    btn: "स्क्यान सुरु गर्नुहोस्",
    details:
      "कार्ड नम्बर सामान्यतया 16 अंकको हुन्छ। यो नम्बर कार्डमा माथि उठेका अक्षरमा इम्बोस्ड गरिएको वा छापिएको हुन्छ। कार्डलाई राम्ररी उज्यालोमा राख्नुहोस् र सबै विवरणहरू प्रष्ट देखाउनुहोस्।",
    details_desktop:
      "कार्ड नम्बर सामान्यतया 16 अंकको हुन्छ। यो नम्बर कार्डमा माथि उठेका अक्षरमा इम्बोस्ड गरिएको वा छापिएको हुन्छ। क्यामेराको लेन्स पुछ्नुहोस्, कार्डलाई उज्यालोमा राख्नुहोस् र सबै विवरणहरू प्रष्ट देखाउनुहोस्।",
    title: "सर्वप्रथम कार्ड नम्बर स्क्यान गर्नुहोस्",
  },
  sdk_aria: "कार्ड स्क्यान गर्ने स्क्रिन",
  timeout_modal: {
    cancel_btn: "रद्द गर्नुहोस्",
    details: "कार्ड पढ्न सकिएन। कृपया पुनः प्रयास गर्नुहोस्।",
    retry_btn: "पुन: प्रयास गर्नुहोस्",
    title: "स्क्यान हुन सकेन",
  },
} as const;
