/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ps_AF.
 */
export default {
  feedback_messages: {
    blur_detected: "کارت او موبایل ثابت وساتئ",
    blur_detected_desktop: "کارت او وسیله ثابت وساتئ.",
    camera_angle_too_steep: "کارت د تلیفون سره موازي وساتئ",
    camera_angle_too_steep_desktop: "کارت د سکن کولو لپاره موازي ونیسئ",
    card_number_scanned: "د کارت د شمېرې اړخ په بریالیتوب سکین شو",
    card_scanned: "سند په بریالیتوب سکين شو!",
    document_too_close_to_edge: "نور لاړ شه",
    flip_card: "کارت په بل مخ واړوئ",
    flip_to_back_side: "کارت په بل مخ واړوئ",
    move_closer: "نږدې شه",
    move_farther: "نور لاړ شه",
    occluded: "کارت په بشپړه توګه ښکاره وساتئ",
    scan_the_back_side: "د کارت بل مخ سکن کړئ",
    scan_the_front_side: "د کارت شمېره سکن کړئ",
  },
  help_button: { aria_label: "مرسته", tooltip: "تاسو مرستې ته اړتیا لرئ؟" },
  help_modal: {
    aria: "د سکین کولو په چارو کې مرسته",
    back_btn: "شاته",
    blur: {
      details:
        "هڅه وکړئ د سکن کولو پر مهال تلیفون او کارت ثابت ونیسئ. که یو یې و خوځول شي، انځور تیاره کېږي او پر کارت موجود معلومات نه لوستل کېږي.",
      details_desktop:
        "هڅه وکړئ چې د سکین کولو پر مهال وسیله او کارت دواړه ثابت وساتئ. که له دې څخه یو هم وخوځول شي، انځور به خړپړ شي او د کارت معلومات به د لوستلو وړ نه وي.",
      title: "د سکین کولو پرمهال ارام پاتې شئ",
    },
    camera_lens: {
      details:
        "خپله د کمرې لینز د داغونو یا دوړو لپاره وګورئ. چټل لینز د وروستي انځور د خړپړ کېدو لامل ګرځي، چې له امله یې د کارت جزئیات د لوستلو وړ نه وي او د معلوماتو بریالی سکین کېدل ناشوني کوي.",
      title: "خپل د کمرې لینز پاک کړئ",
    },
    card_number: {
      details:
        "د کارت شمېره معموله 16 عدده وي، مګر کېدای شي ځینې یې له 12 تر 19 پورې ارقام ولري. دا شمېره باید په چاپي یا برجسته ډول پر کارت لیکل شوې وي. دا کېدای شي ستاسو د کارت په مخه یا شا کې وي.",
      title: "د کارت شمېره چېرته ده؟",
    },
    done_btn: "وشو",
    done_btn_aria: "د سي وي سکین کول",
    lighting: {
      details:
        "مستقیم یې د څراغ وړانګو ته مه نیسئ ځکه چې وړانګې له کارت څخه منعکسې کېږي او د کارت ځینې برخې نه لوستل کېږي. که تاسو پر کارت موجود معلومات نشئ لوستلای، دا به د کامرې لپاره هم د لیدلو وړ نه وي.",
      title: "د سختې رڼا لپاره پام وکړئ",
    },
    next_btn: "بل",
    occlusion: {
      details:
        "ډاډ حاصل کړئ چې د کارت برخې په ګوتو پټې نکړئ، د ښکته برخې د کرښو په ګډون. همدارنګه هولوګرام ته پام کوئ چې کېدای شي د کارت پر ځینو برخو راشي.",
      title: "ټول ساحې ښکاره وساتئ",
    },
  },
  onboarding_modal: {
    aria: "د سکین کولو اړوند لارښوونې",
    btn: "سکن کول پیل کړئ",
    details:
      "د کارت شمېره معموله 16 عدده وي. دا باید په چاپي یا برجسته توګه پر کارت لیکل شوې وي. ډاډمن کړئ چې کارت ښه روښانه دی او ټول جزئیات یې د لیدلو وړ دي.",
    details_desktop:
      "د کارت شمېره عموماً 16 عدده وي. دا شمېره یا په کارت چاپ شوې وي او یا هم په برجسته (راوتلو) شمېرونو د کارت پر مخ لیکل شوې وي. ډاډ ترلاسه کړئ چې د کمرې لینز مو پاک دی، کارت ښه روښانه دی، او ټول جزئیات په واضحه توګه ښکاري.\\n",
    title: "لومړی د کارت شمېره سکن کړئ",
  },
  sdk_aria: "د کارت د سکین کولو سکرین",
  timeout_modal: {
    cancel_btn: "لغوه کول",
    details: "کارت و نه لوستل شو. مهرباني وکړئ بیا هڅه وکړئ.",
    retry_btn: "بیا هڅه وکړئ",
    title: "سکین ناکام شو",
  },
} as const;
