/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for si.
 */
export default {
  feedback_messages: {
    blur_detected: "කාඩ්පත සහ දුරකථනය නොසෙල්වන සේ තබා ගන්න",
    blur_detected_desktop: "කාඩ්පත සහ උපාංගය නොසෙල්වන සේ තබා ගන්න",
    camera_angle_too_steep: "කාඩ්පත දුරකථනයට සමාන්තරව තබා ගන්න",
    camera_angle_too_steep_desktop: "කාඩ්පත දුරකථනයට සමාන්තරව තබා ගන්න",
    card_number_scanned: "සාර්ථකයි! කාඩ්පතේ අංකය ඇති පැත්ත ස්කෑන් කර ඇත",
    card_scanned: "සාර්ථකයි! කාඩ්පත ස්කෑන් කර ඇත",
    document_too_close_to_edge: "මදක් ඈත් කරන්න",
    flip_card: "කාඩ්පත අනෙක් පිට හරවන්න",
    flip_to_back_side: "කාඩ්පත අනෙක් පිට හරවන්න",
    move_closer: "මදක් ළං කරන්න",
    move_farther: "මදක් ඈත් කරන්න",
    occluded: "කාඩ්පත සම්පූර්ණයෙන් පෙනෙන පරිදි තබා ගන්න",
    scan_the_back_side: "කාඩ්පතේ ඉදිරි පැත්ත ස්කෑන් කරන්න",
    scan_the_front_side: "කාඩ්පතේ අංකය ස්කෑන් කරන්න",
  },
  help_button: { aria_label: "උදව්", tooltip: "උදව් අවශ්‍ය ද?" },
  help_modal: {
    aria: "ස්කෑන් කිරීමට උදව්",
    back_btn: "ආපසු",
    blur: {
      details:
        "ස්කෑන් කරන අතරතුර දුරකථනය සහ කාඩ්පත නොසෙල්වෙන සේ තබා ගන්න. මින් එකක් හෝ සෙලවීම රූපය අපැහැදිලි වී කාඩ්පතේ දත්ත කියවීමට නොහැකි වීමට හේතු විය හැක.",
      details_desktop:
        "ස්කෑන් කරන අතරතුර උපාංගය සහ කාඩ්පත නොසෙල්වෙන සේ තබා ගැනීමට උත්සාහ කරන්න. මින් එකක් හෝ සෙලවීම රූපය අපැහැදිලි වී කාඩ්පතේ දත්ත කියවීමට නොහැකි වීමට හේතු විය හැක.",
      title: "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටින්න",
    },
    camera_lens: {
      details:
        "ඔබේ කැමරා කාචයේ පැල්ලම් හෝ දූවිලි ඇත්දැයි පරීක්ෂා කරන්න. කැමරා කාචය අපිරිසිදු වීම ඉන් ලබා ගන්නා අවසාන රූපය බොඳ වීමට හේතුව වන අතර, ඉන් කාඩ්පතේ විස්තර කියවිය නොහැකි වී, දත්ත සාර්ථකව ස්කෑන් කිරීමට බාධා ඇති වේ.",
      title: "ඔබේ කැමරා කාචය පිරිසිදු කරන්න",
    },
    card_number: {
      details:
        "කාඩ්පත් අංකය සාමාන්‍යයෙන් ඉලක්කම් 16කින් යුත් අංකයක් වන නමුත් එහි ඉලක්කම් 12ත් 19ත් අතර ප්‍රමාණයක් තිබිය හැක. එය කාඩ්පත මත මුද්‍රණය කර ඇති හෝ පිටතට නෙරා ගිය ලෙස කැටයම් කළ අංකයකි. එය ඔබේ කාඩ්පතේ ඉදිරිපස හෝ පිටුපස තිබිය හැකි ය.",
      title: "කාඩ්පත් අංකය ඇත්තේ කොතැන ද?",
    },
    done_btn: "කළා",
    done_btn_aria: "ස්කෑන් කිරීම නැවත අරඹන්න",
    lighting: {
      details:
        "ඍජු රළු ආලෝකය කාඩ්පතේ වැදී පරාවර්තනය වී කාඩ්පතේ ඇති කොටස් කියවීමට නොහැකි විය හැකි බැවින් එය වළක්වා ගන්න. ඔබට කාඩ්පතේ දත්ත කියවිය නොහැකි නම්, එය කැමරාවට ද දෘශ්‍යමාන නොවේ.",
      title: "රළු ආලෝකය ගැන සැලකිලිමත් වන්න",
    },
    next_btn: "ඊලඟ",
    occlusion: {
      details:
        "ඔබේ ඇඟිල්ලකින් කාඩ්පතේ පහළ ඇති රේඛා ඇතුළු කොටස් ආවරණය නොවන බවට වග බලා ගන්න. එසේම කාඩ්පතේ කොටස් මත ඇතිවන හොලෝග්‍රෑම් පරාවර්තන පිළිබඳව ද අවධානයෙන් සිටින්න.",
      title: "සියලු කොටස් හොඳින් පෙනෙන පරිදි තබා ගන්න",
    },
  },
  onboarding_modal: {
    aria: "ස්කෑන් කිරීමට උපදෙස්",
    btn: "ස්කෑන් කිරීම ආරම්භ කරන්න",
    details:
      "කාඩ්පත් අංකය සාමාන්‍යයෙන් ඉලක්කම් 16කින් යුත් අංකයකි. එය කාඩ්පත මත මුද්‍රණය කර ඇති හෝ පිටතට නෙරා ගිය ලෙස කැටයම් කළ අංකයකි. කාඩ්පතට හොඳින් ආලෝකය වැටී එහි සියලු විස්තර හොඳින් පෙනෙන බවට සහතික කර ගන්න.",
    details_desktop:
      "කාඩ්පත් අංකය සාමාන්‍යයෙන් ඉලක්කම් 16කින් යුත් අංකයකි. එය කාඩ්පත මත මුද්‍රණය කර ඇති හෝ පිටතට නෙරා ගිය ලෙස කැටයම් කළ අංකයකි. ඔබේ කැමරා කාචය පිරිසිදුව තිබෙන බවත්, කාඩ්පතට හොඳින් ආලෝකය වැටී එහි සියලු විස්තර හොඳින් පෙනෙන බවත් සහතික කර ගන්න.",
    title: "පළමුව කාඩ්පතේ අංකය ස්කෑන් කරන්න",
  },
  sdk_aria: "කාඩ්පත් ස්කෑන් කිරීමේ තිරය",
  timeout_modal: {
    cancel_btn: "අවලංගු කරන්න",
    details: "කාඩ්පත කියවිය නොහැක. කරුණාකර නැවත උත්සාහ කරන්න.",
    retry_btn: "නැවත උත්සාහ කරන්න",
    title: "ස්කෑන් කිරීම අසාර්ථකයි",
  },
} as const;
