/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for th.
 */
export default {
  feedback_messages: {
    blur_detected: "ประคองบัตรและโทรศัพท์ให้นิ่งๆ",
    blur_detected_desktop: "ประคองบัตรและอุปกรณ์ให้นิ่งๆ",
    camera_angle_too_steep: "วางบัตรให้ขนานกับโทรศัพท์",
    camera_angle_too_steep_desktop: "วางบัตรให้ขนานกับจอ",
    card_number_scanned: "สแกนบัตรด้านที่มีหมายเลขสำเร็จ!",
    card_scanned: "สแกนบัตรสำเร็จ!",
    document_too_close_to_edge: "เลื่อนออกห่าง",
    flip_card: "พลิกบัตร",
    flip_to_back_side: "พลิกบัตร",
    move_closer: "เลื่อนเข้าใกล้",
    move_farther: "เลื่อนออกห่าง",
    occluded: "เก็บบัตรให้มองเห็นได้เต็มที่",
    scan_the_back_side: "สแกนอีกด้านหนึ่งของบัตร",
    scan_the_front_side: "สแกนหมายเลขบัตร",
  },
  help_button: { aria_label: "ช่วยเหลือ", tooltip: "ต้องการความช่วยเหลือ?" },
  help_modal: {
    aria: "ความช่วยเหลือในการสแกน",
    back_btn: "ย้อนกลับ",
    blur: {
      details:
        "พยายามถือโทรศัพท์และวางบัตรไว้นิ่งๆ ขณะสแกน การเคลื่อนไหวอาจทำให้ภาพพร่ามัวและทำให้ข้อมูลบนบัตรอ่านไม่ออก",
      details_desktop:
        "พยายามถืออุปกรณ์และวางบัตรไว้นิ่งๆ ขณะสแกน การเคลื่อนไหวอาจทำให้ภาพพร่ามัวและทำให้ข้อมูลบนบัตรอ่านไม่ออก",
      title: "ถือนิ่งๆ ขณะสแกน",
    },
    camera_lens: {
      details:
        "ตรวจสอบว่าเลนส์กล้องมีรอยเปื้อนหรือฝุ่นหรือไม่ เลนส์ที่ไม่สะอาดจะส่งผลให้รูปภาพเบลอ ทำให้รายละเอียดบัตรอ่านไม่ออก และไม่สามารถสแกนบัตรได้โดยสำเร็จ",
      title: "ทำความสะอาดเลนส์กล้องของคุณ",
    },
    card_number: {
      details:
        "หมายเลขบัตรมักจะเป็นตัวเลข 16 หลัก แต่อาจยาวระหว่าง 12 ถึง 19 หลักได้ และเป็นตัวเลขพิมพ์หรือปั๊มนูนพาดอยู่บนบัตร โดยอาจอยู่หน้าหรือหลังบัตรก็ได้",
      title: "หมายเลขบัตรอยู่ที่ไหน?",
    },
    done_btn: "เสร็จสิ้น",
    done_btn_aria: "สแกนต่อ",
    lighting: {
      details:
        "หลีกเลี่ยงแสงจ้าที่ส่องตรงๆ เพราะแสงสะท้อนจากบัตรและบัตรอ่านไม่ออกบางส่วนได้ หากคุณอ่านข้อมูลบนบัตรไม่ได้ กล้องก็จะมองไม่เห็นเช่นกัน",
      title: "ระวังแสงจ้า",
    },
    next_btn: "ถัดไป",
    occlusion: {
      details:
        "ตรวจสอบให้แน่ใจว่านิ้วของคุณไม่ได้บังส่วนใดของบัตร รวมถึงบรรทัดล่างสุด นอกจากนี้ ระวังแสงสะท้อนของโฮโลแกรมที่จะทับส่วนต่างๆ ของบัตรด้วย",
      title: "สังเกตว่าทุกส่วนมองเห็นได้ชัด",
    },
  },
  onboarding_modal: {
    aria: "คำแนะนำในการสแกน",
    btn: "เริ่มการสแกน",
    details:
      "หมายเลขบัตรมักจะเป็นตัวเลข 16 หลัก อาจเป็นตัวเลขพิมพ์หรือปั๊มนูนพาดอยู่บนบัตร ตรวจสอบให้แน่ใจว่ามีแสงสว่างที่บัตรเพียงพอและเห็นรายละเอียดทั้งหมด",
    details_desktop:
      "หมายเลขบัตรมักจะเป็นตัวเลข 16 หลัก อาจเป็นตัวเลขพิมพ์หรือปั๊มนูนพาดอยู่บนบัตร ตรวจสอบให้แน่ใจว่าเลนส์ของกล้องสะอาด มีแสงสว่างที่บัตรเพียงพอและเห็นรายละเอียดทั้งหมด",
    title: "สแกนหมายเลขบัตรก่อน",
  },
  sdk_aria: "หน้าจอสแกนบัตร",
  timeout_modal: {
    cancel_btn: "ยกเลิก",
    details: "ไม่สามารถอ่านบัตร โปรดลองอีกครั้ง",
    retry_btn: "ลองอีกครั้ง",
    title: "สแกนไม่สำเร็จ",
  },
} as const;
