/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for uk.
 */
export default {
  feedback_messages: {
    blur_detected: "Тримайте картку і телефон нерухомо",
    blur_detected_desktop: "Тримайте картку і пристрій нерухомо",
    camera_angle_too_steep: "Тримайте картку паралельно до телефону",
    camera_angle_too_steep_desktop: "Утримуйте картку паралельно до екрана",
    card_number_scanned: "Успіх! Номер картки відскановано",
    card_scanned: "Успіх! Картку відскановано",
    document_too_close_to_edge: "Віддаляйтесь",
    flip_card: "Переверніть картку",
    flip_to_back_side: "Переверніть картку",
    move_closer: "Наблизьтесь",
    move_farther: "Віддаляйтесь",
    occluded: "Тримайте картку повністю видимою",
    scan_the_back_side: "Відскануйте іншу сторону картки",
    scan_the_front_side: "Відскануйте номер картки",
  },
  help_button: { aria_label: "Допомога", tooltip: "Потрібна допомога?" },
  help_modal: {
    aria: "Допомога зі скануванням",
    back_btn: "Назад",
    blur: {
      details:
        "Намагайтеся тримати телефон і картку нерухомо під час сканування. Рух одного з них може розмити зображення та зробити дані на картці нечитабельними.",
      details_desktop:
        "Тримайте пристрій і картку нерухомо під час сканування. Будь-який рух може призвести до розмиття зображення і зробити дані на картці нечитабельними.",
      title: "Не рухайтеся під час сканування",
    },
    camera_lens: {
      details:
        "Перевірте об'єктив камери на наявність плям або пилу. Брудний об'єктив призводить до розмиття кінцевого зображення, що робить деталі картки нечитабельними та заважає успішному скануванню даних.",
      title: "Очистіть об'єктив камери",
    },
    card_number: {
      details:
        "Номер картки зазвичай складається з 16 цифр, хоча може мати від 12 до 19 цифр. Він має бути надрукований або вибитий у вигляді рельєфних цифр по всій картці. Він може бути на лицьовій або зворотній стороні картки.",
      title: "Де номер картки?",
    },
    done_btn: "Готово",
    done_btn_aria: "Відновити сканування",
    lighting: {
      details:
        "Уникайте прямого яскравого світла, адже воно відбивається від картки й може зробити частини картки нечитабельними. Якщо ви не можете прочитати дані на картці, камера їх також не зчитає.",
      title: "Обережно з яскравим світлом",
    },
    next_btn: "Далі",
    occlusion: {
      details:
        "Переконайтеся, що ви не закриваєте частини картки пальцем, зокрема нижні рядки. Також стежте за відблисками від голограм, які перекривають поля картки.",
      title: "Тримайте всі поля видимими",
    },
  },
  onboarding_modal: {
    aria: "Інструкції щодо сканування",
    btn: "Почати сканування",
    details:
      "Номер картки — це зазвичай 16-значне число. Він має бути надрукований або вибитий у вигляді рельєфних цифр по всій картці. Переконайтеся, що картка добре освітлена і на ній видно всі деталі.",
    details_desktop:
      "Номер картки зазвичай складається з 16 цифр. Він може бути надрукований або вибитий рельєфними цифрами на картці. Переконайтеся, що об'єктив камери чистий, картка добре освітлена, а всі деталі видно.",
    title: "Спочатку відскануйте номер картки",
  },
  sdk_aria: "Екран сканування карток",
  timeout_modal: {
    cancel_btn: "Скасувати",
    details: "Не вдається зчитати картку. Будь ласка, спробуйте ще раз.",
    retry_btn: "Повторити спробу",
    title: "Сканування не вдалося",
  },
} as const;
