/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ur.
 */
export default {
  feedback_messages: {
    blur_detected: "کارڈ اور فون کو ساکن رکھیں",
    blur_detected_desktop: "کارڈ اور ڈیوائس کو ساکن رکھیں",
    camera_angle_too_steep: "کارڈ کو فون کے متوازی رکھیں",
    camera_angle_too_steep_desktop: "کارڈ کو سکرین کے متوازی رکھیں",
    card_number_scanned: "کامیابی! کارڈ نمبر والی سائیڈ اسکین ہو گئی ہے",
    card_scanned: "کامیابی! کارڈ اسکین ہو گیا ہے",
    document_too_close_to_edge: "اور دور جائیں",
    flip_card: "کارڈ کو پلٹیں",
    flip_to_back_side: "کارڈ کو پلٹیں",
    move_closer: "اور قریب جائیں",
    move_farther: "اور دور جائیں",
    occluded: "کارڈ کو مکمل طور پر نمایاں رکھیں",
    scan_the_back_side: "کارڈ کے دوسرے حصے کو اسکین کریں",
    scan_the_front_side: "کارڈ نمبر کو اسکین کریں",
  },
  help_button: { aria_label: "مدد", tooltip: "مدد چاہیے؟" },
  help_modal: {
    aria: "اسکیننگ میں مدد",
    back_btn: "پیچھے",
    blur: {
      details:
        "اسکین کرتے وقت فون اور کارڈ کو ایک جگہ رکھنے کی کوشش کریں۔ کسی کو بھی ہلانے سے تصویر دھندلی ہو سکتی ہے اور کارڈ پر موجود ڈیٹا پڑھنے کے قابل نہیں رہتا۔",
      details_desktop:
        "اسکین کرتے وقت ڈیوائس اور کارڈ کو ایک جگہ رکھنے کی کوشش کریں۔ کسی کو بھی ہلانے سے تصویر دھندلی ہو سکتی ہے اور کارڈ پر موجود ڈیٹا پڑھنے کے قابل نہیں رہتا۔",
      title: "اسکین کرتے وقت ساکن رہیں",
    },
    camera_lens: {
      details:
        "اپنے کیمرے کے لینز پر دھبوں یا گردوغبار کی جانچ کریں۔ گندا لینز حتمی تصویر کو دھندلا کر دیتا ہے، جس سے کارڈ کی تفصیلات پڑھنے کے قابل نہیں رہتیں اور ڈیٹا کامیابی سے اسکین نہیں ہو پاتا۔",
      title: "اپنے کیمرہ کے لینز کو صاف کریں",
    },
    card_number: {
      details:
        "کارڈ نمبر عموماً 16 ہندسوں پر مشتمل ہوتا ہے، لیکن یہ 12 سے 19 ہندسوں کے درمیان بھی ہو سکتا ہے۔ یہ نمبر یا تو پرنٹ کیا ہوا ہوتا ہے یا ابھری ہوئی شکل میں کارڈ پر موجود ہوتا ہے۔ یہ آپ کے کارڈ کے سامنے یا پچھلے حصے پر ہو سکتا ہے۔",
      title: "کارڈ نمبر کہاں ہے؟",
    },
    done_btn: "ہو گیا",
    done_btn_aria: "اسکیننگ دوبارہ شروع کریں",
    lighting: {
      details:
        "براہِ راست تیز روشنی سے پرہیز کریں کیونکہ یہ کارڈ پر عکس ڈالتی ہے اور اس کے کچھ حصے پڑھنے کے قابل نہیں رہتے۔ اگر آپ خود کارڈ پر موجود ڈیٹا نہیں پڑھ سکتے تو یہ کیمرے پر بھی نظر نہیں آئے گا۔",
      title: "تیز روشنی سے بچیں",
    },
    next_btn: "اگلا",
    occlusion: {
      details:
        "یقینی بنائیں کہ آپ اپنی انگلی سے کارڈ کے کسی حصے کو، خاص طور پر نچلی سطروں کو ڈھانپ نہیں رہے۔ اس کے علاوہ ہولوگرام کے عکس سے بھی بچیں جو کارڈ کے خانوں پر پڑ سکتا ہے۔",
      title: "تمام خانے نمایاں رکھیں",
    },
  },
  onboarding_modal: {
    aria: "اسکیننگ کی ہدایات",
    btn: "اسکیننگ شروع کریں",
    details:
      "کارڈ نمبر عموماً 16 ہندسوں پر مشتمل ہوتا ہے۔ یہ یا تو پرنٹ کیا ہوا ہوتا ہے یا ابھری ہوئی شکل میں کارڈ پر درج ہوتا ہے۔ یہ یقینی بنائیں کہ کارڈ پر مناسب روشنی ہے اور تمام تفصیلات صاف نظر آ رہی ہیں۔",
    details_desktop:
      "کارڈ نمبر عام طور پر 16 ہندسوں پر مشتمل ہوتا ہے۔ یہ یا تو کارڈ پر پرنٹ ہوتا ہے یا ابھرے ہوئے نمبروں کی صورت میں نمایاں ہوتا ہے۔ یقینی بنائیں کہ آپ کے کیمرے کا لینز صاف ہو، کارڈ مناسب روشنی میں ہو، اور تمام تفصیلات واضح طور پر نظر آ رہی ہوں۔",
    title: "سب سے پہلے کارڈ نمبر اسکین کریں",
  },
  sdk_aria: "کارڈ اسکین کرنے کی اسکرین",
  timeout_modal: {
    cancel_btn: "منسوخ کریں",
    details: "کارڈ پڑھنے میں ناکامی۔ براہ کرم دوبارہ کوشش کریں۔",
    retry_btn: "دوبارہ کوشش کریں",
    title: "اسکین ناکام رہا",
  },
} as const;
