/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ar.
 */
export default {
  document_filtered_modal: {
    details: "حاول مسح مستند آخر.",
    title: "المستند غير مقبول",
  },
  document_not_recognized_modal: {
    details: "امسح وجه مستند مدعوم.",
    title: "لم يتم التعرف على المستند",
  },
  feedback_messages: {
    blur_detected: "لا تحرّك المستند ولا الهاتف",
    camera_angle_too_steep: "ضع المستند موازياً للهاتف",
    document_scanned_aria: "نجحت العملية! تم مسح المستند ضوئياً",
    document_too_close_to_edge: "انقل إلى موضع أبعد",
    face_photo_not_fully_visible: "حافظ على صورة الوجه مرئية بالكامل",
    flip_document: "اقلب المستند",
    flip_to_back_side: "اقلب المستند",
    front_side_scanned_aria: "نجحت العملية! تم مسح الجانب الأمامي ضوئياً",
    glare_detected: "أمِل المستند أو حرّكه لتتخلص من الانعكاس",
    keep_document_parallel: "الرجاء الحفاظ على المستند موازياً للشاشة",
    keep_document_still: "الرجاء الحفاظ على ثبات المستند والجهاز",
    move_closer: "انقل إلى موضع أقرب",
    move_farther: "انقل إلى موضع أبعد",
    move_left: "انتقل إلى الصفحة على اليسار",
    move_right: "انتقل إلى الصفحة على اليمين",
    move_top: "انتقل إلى الصفحة في الأعلى",
    occluded: "إبقاء المستند مرئياً بالكامل",
    scan_data_page: "قم بالمسح الضوئي لصفحة البيانات الخاصة بالمستند",
    scan_last_page_barcode: "قم بمسح الرمز الشريطي ضوئياً من الصفحة الأخيرة",
    scan_left_page: "مسح الصفحة جهة اليسار ضوئياً",
    scan_right_page: "مسح الصفحة جهة اليمين ضوئياً",
    scan_the_back_side: "المسح الضوئي للوجه الخلفي من المستند",
    scan_the_barcode: "امسح الرمز الشريطي",
    scan_the_front_side: "مسح وجه\\nمستند",
    scan_top_page: "مسح الصفحة العليا ضوئياً",
    too_bright: "انتقل إلى مكان ذي إضاءة أقل",
    too_dark: "انتقل إلى مكان ذي إضاءة أعلى",
    wrong_left: "انتقل إلى الصفحة اليسرى",
    wrong_right: "انتقل إلى الصفحة اليمنى",
    wrong_top: "انتقل إلى الصفحة العليا",
  },
  help_button: { aria_label: "المساعدة", tooltip: "هل تحتاج مساعدة؟" },
  help_modal: {
    aria: "مساعدة في المسح الضوئي",
    back_btn: "عودة",
    blur: {
      details:
        "حاول الحفاظ على ثبات الهاتف والمستند أثناء المسح. يمكن أن يؤدي تحريك أي منهما إلى تعتيم الصورة وجعل البيانات الموجودة في المستند غير مقروءة.",
      details_desktop:
        "حاول الحفاظ على ثبات الجهاز والمستند في المسح. يمكن أن يؤدي تحريك أي منهما إلى تشويش الصورة وجعل البيانات الموجودة في المستند غير مقروءة.",
      title: "حافظ على الثبات أثناء إجراء المسح",
    },
    camera_lens: {
      details:
        "يجب الحرص على خلو عدسة الكاميرا من البقع أو الغبار. العدسة المتسخة تتسبب في تشويش الصورة النهائية، وهذا يجعل تفاصيل المستند غير قابلة للقراءة ويمنع مسح البيانات بنجاح.",
      title: "يرجى تنظيف عدسة الكاميرا",
    },
    done_btn: "انتهى",
    done_btn_aria: "استئناف المسح الضوئي",
    lighting: {
      details:
        "تجنب التعرض المباشر للإضاءة الساطعة لأنها تنعكس على المستند ويمكن أن تجعل أجزاء من المستند غير مقروءة. في حالة لم تتمكن من قراءة البيانات الموجودة في المستند، فلن تكون واضحة للكاميرا أيضًا.",
      title: "احترس من الإضاءة الساطعة",
    },
    next_btn: "التالي",
    visibility: {
      details:
        "تأكد من أنك لا تغطي أجزاء من المستند بإصبعك، بما في ذلك الأسطر السفلية. تجنب أيضًا انعكاسات الصورة ثلاثية الأبعاد التي تمر فوق خانات المستند.",
      title: "تأكد من وضوح جميع الخانات",
    },
  },
  onboarding_modal: {
    aria: "تعليمات المسح الضوئي",
    btn: "بدء المسح",
    details:
      "تأكد من إبقاء المستند مضاءً بشكل جيد. كما يجب أن تكون جميع خانات المستندات واضحة على شاشة الكاميرا.",
    details_desktop:
      "يجب الحرص على إبقاء عدسة الكاميرا نظيفة وجودة إضاءة المستند. كما يجب أن تكون جميع خانات المستند مرئية على شاشة الكاميرا.",
    title: "تأكد من وضوح جميع البيانات",
    title_desktop: "استعد للمسح الضوئي",
  },
  sdk_aria: "شاشة مسح المستندات",
  timeout_modal: {
    cancel_btn: "إلغاء",
    details: "غير قادر على قراءة المستند. يُرجى المحاولة مرة أخرى.",
    retry_btn: "إعادة المحاولة",
    title: "تمت عملية المسح بنجاح",
  },
} as const;
