/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for el.
 */
export default {
  document_filtered_modal: {
    details: "Δοκιμάστε να σαρώσετε ένα διαφορετικό έγγραφο.",
    title: "Το έγγραφο δεν έγινε δεκτό",
  },
  document_not_recognized_modal: {
    details: "Σαρώστε την μπροστινή όψη ενός υποστηριζόμενου εγγράφου.",
    title: "Το έγγραφο δεν αναγνωρίστηκε",
  },
  feedback_messages: {
    blur_detected: "Κρατήστε το έγγραφο και το τηλέφωνο ακίνητα",
    camera_angle_too_steep: "Κρατήστε το έγγραφο παράλληλα με το τηλέφωνο",
    document_scanned_aria: "Επιτυχία! Το έγγραφο σαρώθηκε",
    document_too_close_to_edge: "Απομακρυνθείτε",
    face_photo_not_fully_visible:
      "Φροντίστε τη φωτογραφία προσώπου να είναι πλήρως ορατή",
    flip_document: "Αναποδογυρίστε το έγγραφο",
    flip_to_back_side: "Γυρίστε στην πίσω όψη",
    front_side_scanned_aria: "Επιτυχία! Σαρώθηκε η μπροστινή πλευρά",
    glare_detected:
      "Γείρετε ή μετακινήστε το έγγραφο για να αφαιρέσετε την αντανάκλαση",
    keep_document_parallel: "Κρατήστε το έγγραφο παράλληλα με την οθόνη",
    keep_document_still: "Κρατήστε το έγγραφο και τη συσκευή ακίνητα",
    move_closer: "Πλησιάστε",
    move_farther: "Απομακρυνθείτε",
    move_left: "Προχωρήστε στη σελίδα στα αριστερά",
    move_right: "Προχω΄ρηστε στη σελίδα στα δεξιά",
    move_top: "Προχωρήστε στην πρώτη σελίδα",
    occluded: "Φροντίστε το έγγραφο να είναι πλήρως ορατό",
    scan_data_page: "Σαρώστε τη σελίδα δεδομένων του εγγράφου",
    scan_last_page_barcode: "Σάρωση γραμμωτού κώδικα από την τελευταία σελίδα",
    scan_left_page: "Σαρώστε την αριστερή σελίδα",
    scan_right_page: "Σαρώστε τη δεξιά σελίδα",
    scan_the_back_side: "Σαρώστε την πίσω όψη του εγγράφου",
    scan_the_barcode: "Σαρώστε τον γραμμωτό κώδικα",
    scan_the_front_side: "Σαρώστε την μπροστινή όψη του εγγράφου",
    scan_top_page: "Σαρώστε την πρώτη σελίδα",
    too_bright: "Μετακινηθείτε σε σημείο με λιγότερο φωτισμό",
    too_dark: "Μετακινηθείτε σε πιο φωτεινό σημείο",
    wrong_left: "Προχωρήστε στην αριστερή σελίδα",
    wrong_right: "Προχωρήστε στη δεξιά σελίδα",
    wrong_top: "Προχωρήστε στην πρώτη σελίδα",
  },
  help_button: { aria_label: "Βοήθεια", tooltip: "Χρειάζεστε βοήθεια;" },
  help_modal: {
    aria: "Βοήθεια για τη σάρωση",
    back_btn: "Πίσω",
    blur: {
      details:
        "Προσπαθήστε να κρατήσετε το τηλέφωνο και το έγγραφο ακίνητα κατά τη σάρωση. Η μετακίνηση οποιουδήποτε από τα δύο μπορεί να θολώσει την εικόνα και να καταστήσει τα δεδομένα στο έγγραφο δυσανάγνωστα.",
      details_desktop:
        "Προσπαθήστε να κρατήσετε τη συσκευή και το έγγραφο ακίνητα κατά τη σάρωση. Η μετακίνηση οποιουδήποτε από τα δύο μπορεί να θολώσει την εικόνα και να καταστήσει τα δεδομένα στο έγγραφο δυσανάγνωστα.",
      title: "Μείνετε ακίνητοι κατά τη σάρωση",
    },
    camera_lens: {
      details:
        "Ελέγξτε τον φακό της κάμεράς σας για λεκέδες ή σκόνη. Ένας βρώμικος φακός προκαλεί θάμπωμα της τελικής εικόνας, καθιστώντας τα στοιχεία του εγγράφου δυσανάγνωστα και εμποδίζοντας την επιτυχή σάρωση των δεδομένων.",
      title: "Καθαρίστε τον φακό της κάμεράς σας",
    },
    done_btn: "Τέλος",
    done_btn_aria: "Συνέχιση σάρωσης",
    lighting: {
      details:
        "Αποφύγετε το άμεσο, έντονο φως, επειδή αντανακλάται από το έγγραφο και μπορεί να κάνει ορισμένα μέρη του εγγράφου δυσανάγνωστα. Εάν δεν μπορείτε να διαβάσετε δεδομένα στο έγγραφο, δεν θα είναι ορατά ούτε στην κάμερα.",
      title: "Προσέξτε το έντονο φως",
    },
    next_btn: "Επόμενο",
    visibility: {
      details:
        "Βεβαιωθείτε ότι δεν καλύπτετε μέρη του εγγράφου με το δάχτυλό σας, συμπεριλαμβανομένων των κάτω γραμμών. Επίσης, προσέξτε τις αντανακλάσεις ολογράμματος που καλύπτουν τα πεδία του εγγράφου.",
      title: "Φροντίστε όλα τα πεδία να είναι ορατά",
    },
  },
  onboarding_modal: {
    aria: "Οδηγίες σάρωσης",
    btn: "Έναρξη σάρωσης",
    details:
      "Φροντίστε το έγγραφο να είναι καλά φωτισμένο. Όλα τα πεδία του εγγράφου θα πρέπει να είναι ορατά στην οθόνη της κάμερας.",
    details_desktop:
      "Φροντίστε ο φακός της κάμεράς σας να είναι καθαρός και το έγγραφο να είναι καλά φωτισμένο. Όλα τα πεδία του εγγράφου θα πρέπει να είναι ορατά στην οθόνη της κάμερας.",
    title: "Φροντίστε όλες οι λεπτομέρειες να είναι ορατές",
    title_desktop: "Ετοιμαστείτε για τη σάρωση",
  },
  sdk_aria: "Οθόνη σάρωσης εγγράφου",
  timeout_modal: {
    cancel_btn: "Ακύρωση",
    details: "Δεν είναι δυνατή η ανάγνωση του εγγράφου. Δοκιμάστε ξανά.",
    retry_btn: "Επανάληψη",
    title: "Η σάρωση ήταν ανεπιτυχής.",
  },
} as const;
