/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for fa-latn.
 */
export default {
  document_filtered_modal: {
    details: "سعی کنید سند دیگری را اسکن کنید.",
    title: "سند پذیرفته نشد",
  },
  document_not_recognized_modal: {
    details: "قسمت جلوی یک سند پشتیبانی شده را اسکن کنید.",
    title: "سند شناسایی نشده است",
  },
  feedback_messages: {
    blur_detected: "سند و تلفن را ثابت نگه دارید",
    camera_angle_too_steep: "سند را به صورت موازی با تلفن نگه دارید",
    document_scanned_aria: "با موفقیت اسکن شد! سند اسکن شد",
    document_too_close_to_edge: "دورتر حرکت کن",
    face_photo_not_fully_visible: "عکس چهره را کاملاً قابل مشاهده نگه دارید",
    flip_document: "سند را ورق بزنید",
    flip_to_back_side: "به سمت عقب برگردانید",
    front_side_scanned_aria: "با موفقیت اسکن از جلو انجام شد!",
    glare_detected: "برای حذف انعکاس، سند را کج یا جابجا کنید",
    keep_document_parallel: "سند را موازی با صفحه نمایش نگه دارید",
    keep_document_still: "سند و دستگاه را ثابت نگه دارید",
    move_closer: "نزدیکتر حرکت کن",
    move_farther: "دورتر حرکت کن",
    move_left: "به صفحه سمت چپ منتقل شوید",
    move_right: "به صفحه سمت راست منتقل شوید",
    move_top: "انتقال به صفحه بالا",
    occluded: "سند را کاملاً قابل مشاهده نگه دارید",
    scan_data_page: "صفحه داده سند را اسکن کنید",
    scan_last_page_barcode: "اسکن بارکد از آخرین صفحه",
    scan_left_page: "صفحه سمت چپ را اسکن کنید",
    scan_right_page: "صفحه سمت راست را اسکن کنید",
    scan_the_back_side: "پشت سند را اسکن کنید",
    scan_the_barcode: "بارکد را اسکن کنید",
    scan_the_front_side: "از قسمت جلوی سند اسکن بگیرید",
    scan_top_page: "اسکن صفحه بالا",
    too_bright: "به نقطه‌ای با نور کمتر بروید",
    too_dark: "به نقطه روشن‌تر نقل مکان کنید",
    wrong_left: "انتقال به صفحه سمت چپ",
    wrong_right: "انتقال به صفحه سمت راست",
    wrong_top: "انتقال به صفحه بالا",
  },
  help_button: { aria_label: "کمک", tooltip: "به کمک نیاز دارید؟" },
  help_modal: {
    aria: "کمک در اسکن",
    back_btn: "برگشت",
    blur: {
      details:
        "سعی کنید هنگام اسکن، گوشی و سند را ثابت نگه دارید. حرکت دادن هر یک از آنها می‌تواند تصویر را تار کند و داده‌های روی سند را غیرقابل خواندن کند.",
      details_desktop:
        "سعی کنید هنگام اسکن، دستگاه و سند را ثابت نگه دارید. حرکت دادن هر یک از آنها می‌تواند تصویر را تار کند و داده‌های روی سند را غیرقابل خواندن کند.",
      title: "هنگام اسکن کردن بی‌حرکت بمانید",
    },
    camera_lens: {
      details:
        "لنز دوربین خود را از نظر لکه یا گرد و غبار بررسی کنید. لنز کثیف باعث تار شدن تصویر نهایی می‌شود و جزئیات سند را غیرقابل خواندن می‌کند و مانع از اسکن موفقیت‌آمیز داده‌ها می‌شود.",
      title: "لنز دوربین خود را تمیز کنید",
    },
    done_btn: "انجام شد",
    done_btn_aria: "اسکن را از سر بگیرید",
    lighting: {
      details:
        "از نور مستقیم و شدید پرهیز کنید زیرا از سند منعکس می‌شود و می‌تواند بخش‌هایی از سند را غیرقابل خواندن کند. اگر نتوانید داده‌های روی سند را بخوانید، برای دوربین نیز قابل مشاهده نخواهد بود.",
      title: "مراقب نور شدید باشید",
    },
    next_btn: "بعدی",
    visibility: {
      details:
        "مطمئن شوید که بخش‌هایی از سند، از جمله خطوط پایین، را با انگشت خود نمی‌پوشانید. همچنین، مراقب بازتاب‌های هولوگرام باشید که از روی قسمت‌های سند عبور می‌کنند.",
      title: "همه فیلدها را قابل مشاهده نگه دارید",
    },
  },
  onboarding_modal: {
    aria: "دستورالعمل‌های اسکن",
    btn: "شروع اسکن",
    details:
      "مطمئن شوید که سند را به خوبی روشن نگه داشته‌اید. تمام فیلدهای سند باید روی صفحه دوربین قابل مشاهده باشند.",
    details_desktop:
      "مطمئن شوید که لنز دوربین خود را تمیز نگه داشته‌اید و سند به خوبی روشن است. تمام فیلدهای سند باید روی صفحه دوربین قابل مشاهده باشند.",
    title: "تمام جزئیات را قابل مشاهده نگه دارید",
    title_desktop: "آماده اسکن شوید",
  },
  sdk_aria: "صفحه اسکن اسناد",
  timeout_modal: {
    cancel_btn: "لغو",
    details: "قادر به خواندن سند نیست. لطفاً دوباره امتحان کنید.",
    retry_btn: "دوباره امتحان کنید",
    title: "اسکن ناموفق بود",
  },
} as const;
