/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for hi.
 */
export default {
  document_filtered_modal: {
    details: "किसी भिन्न दस्तावेज़ को स्कैन करने का प्रयास करें.",
    title: "दस्तावेज़ स्वीकार नहीं किया गया",
  },
  document_not_recognized_modal: {
    details: "समर्थित दस्तावेज़ के सामने वाले भाग को स्कैन करें.",
    title: "डॉक्यूमेंट पहचाना नहीं गया",
  },
  feedback_messages: {
    blur_detected: "दस्तावेज़ और फ़ोन स्थिर रखें",
    camera_angle_too_steep: "दस्तावेज़ को फ़ोन के समानांतर रखें",
    document_scanned_aria: "सफ़लता! डॉक्यूमेंट स्कैन किया गया",
    document_too_close_to_edge: "दूर जाएँ",
    face_photo_not_fully_visible:
      "चेहरे की तस्वीर इस तरह रखें की पूरी तरह से दिखाई दे",
    flip_document: "दस्तावेज़ को पलटें",
    flip_to_back_side: "पीछे की ओर पलटें",
    front_side_scanned_aria: "सफ़लता! सामने का हिस्सा स्कैन किया गया",
    glare_detected:
      "प्रतिबिंब हटाने के लिए दस्तावेज़ को झुकाएँ या ट्रान्सफर करें",
    keep_document_parallel: "डॉक्यूमेंट को स्क्रीन के पैरेलल रखें",
    keep_document_still: "डॉक्यूमेंट और डिवाइस को स्थिर रखें",
    move_closer: "पास आएँ",
    move_farther: "दूर जाएँ",
    move_left: "बाईं ओर के पेज पर जाएँ",
    move_right: "दाईं ओर के पेज पर जाएँ",
    move_top: "टॉप पेज पर जाएँ",
    occluded: "दस्तावेज़ को इस प्रकार रखें की यह पूरी तरह दिखाई दे",
    scan_data_page: "दस्तावेज़ के डेटा पेज को स्कैन करें",
    scan_last_page_barcode: "आख़िरी पेज से बारकोड स्कैन करें",
    scan_left_page: "बाएँ पेज को स्कैन करें",
    scan_right_page: "दाएँ पेज को स्कैन करें",
    scan_the_back_side: "दस्तावेज़ के पीछे की ओर स्कैन करें",
    scan_the_barcode: "बारकोड को स्कैन करें",
    scan_the_front_side: "दस्तावेज़ के सामने वाले भाग को स्कैन करें",
    scan_top_page: "टॉप पेज को स्कैन करें",
    too_bright: "कम रोशनी वाले स्थान पर जाएँ",
    too_dark: "अधिक रोशनी वाले स्थान पर जाएँ",
    wrong_left: "बाएं पेज पर जाएँ",
    wrong_right: "सही पेज पर जाएँ",
    wrong_top: "टॉप पेज पर जाएँ",
  },
  help_button: { aria_label: "सहायता", tooltip: "मदद चाहिए?" },
  help_modal: {
    aria: "स्कैनिंग सहायता",
    back_btn: "पिछला",
    blur: {
      details:
        "स्कैन करते समय फ़ोन और दस्तावेज़ को स्थिर रखने का प्रयास करें. किसी भी चीज़ को हिलाने से तस्वीर धुंधली हो सकती है और दस्तावेज़ पर मौजूद डेटा पढ़ने योग्य नहीं रहेगा.",
      details_desktop:
        "स्कैन करते समय डिवाइस और डॉक्यूमेंट को एक जगह रखने की कोशिश करें। किसी भी चीज़ को हिलाने से इमेज धुंधली हो सकती है और डॉक्यूमेंट पर मौजूद डेटा पढ़ने लायक नहीं रहेगा।",
      title: "स्कैन करते समय स्थिर रहें",
    },
    camera_lens: {
      details:
        "अपने कैमरे के लेंस पर धब्बे या धूल तो नहीं है, यह चेक करें। गंदे लेंस से फ़ाइनल इमेज धुंधली हो जाती है, जिससे डॉक्यूमेंट की डिटेल्स पढ़ने लायक नहीं रहतीं और डेटा का सफल स्कैन नहीं हो पाता।",
      title: "अपने कैमरे के लेंस को साफ करें",
    },
    done_btn: "हो गया",
    done_btn_aria: "स्कैनिंग फिर से शुरू करें",
    lighting: {
      details:
        "सीधी और तेज़ रोशनी से बचें क्योंकि यह दस्तावेज़ से रिफ्लेक्ट होकर दस्तावेज़ के कुछ हिस्सों को पढ़ने में दिक्कत ला सकती है. अगर आप दस्तावेज़ पर मौजूद डेटा नहीं पढ़ पा रहे हैं, तो वह कैमरे को भी दिखाई नहीं देगा.",
      title: "कठोर प्रकाश से सावधान रहें",
    },
    next_btn: "अगला",
    visibility: {
      details:
        "सुनिश्चित करें कि आप दस्तावेज़ के किसी भी हिस्से को, जिसमें नीचे की रेखाएँ भी शामिल हैं, उंगली से न ढकें. साथ ही, दस्तावेज़ के फील्ड पर पड़ने वाले होलोग्राम प्रतिबिंबों पर भी ध्यान दें.",
      title: "इस प्रकार रखें की सभी फील्ड पूरी तरह दिखाई दे",
    },
  },
  onboarding_modal: {
    aria: "स्कैनिंग निर्देश",
    btn: "स्कैन करना शुरू करें",
    details:
      "सुनिश्चित करें कि दस्तावेज़ पर अच्छी रोशनी हो. सभी दस्तावेज़ फ़ील्ड कैमरा स्क्रीन पर दिखाई देने चाहिए.",
    details_desktop:
      "पक्का करें कि आप अपने कैमरे का लेंस साफ़ रखें और डॉक्यूमेंट में अच्छी रोशनी हो। सभी डॉक्यूमेंट फ़ील्ड कैमरा स्क्रीन पर दिखने चाहिए।",
    title: "इस प्रकार रखें की सभी जानकारी पूरी तरह दिखाई दे",
    title_desktop: "स्कैन करने के लिए तैयार हो जाइए",
  },
  sdk_aria: "दस्तावेज़ स्कैनिंग स्क्रीन",
  timeout_modal: {
    cancel_btn: "रद्द करें",
    details: "दस्तावेज़ पढ़ा नहीं जा सका. कृपया दोबारा प्रयास करें.",
    retry_btn: "दोबारा प्रयास करें",
    title: "स्कैन असफल हुआ",
  },
} as const;
