/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ka_GE.
 */
export default {
  document_filtered_modal: {
    details: "სცადეთ სხვა დოკუმენტის დასკანერება.",
    title: "დოკუმენტი უარყოფილია",
  },
  document_not_recognized_modal: {
    details: "დაასკანერეთ მხარდაჭერილი დოკუმენტის წინა მხარე.",
    title: "დოკუმენტის ამოცნობა ვერ მოხერხდა",
  },
  feedback_messages: {
    blur_detected: "არ გაამოძრაოთ დოკუმენტი და ტელეფონი",
    camera_angle_too_steep: "დოკუმენტი ტელეფონის პარალელურად დაიჭირეთ",
    document_scanned_aria: "წარმატებული! დოკუმენტი დასკანერებულია",
    document_too_close_to_edge: "გადადით მოშორებით",
    face_photo_not_fully_visible: "სახის ფოტო სრულად უნდა ჩანდეს",
    flip_document: "ამოატრიალეთ დოკუმენტი",
    flip_to_back_side: "შემოატრიალეთ უკანა მხარეს",
    front_side_scanned_aria: "წარმატებული! წინა მხარე დასკანერებულია",
    glare_detected: "გადახარეთ ან გაამოძრავეთ დოკუმენტი ანარეკლის მოსაშორებლად",
    keep_document_parallel: "დოკუმენტი ეკრანის პარალელურად დაიჭირეთ",
    keep_document_still: "არ გაამოძრაოთ მოწყობილობა და ტელეფონი",
    move_closer: "მიუახლოვდით",
    move_farther: "გადადით მოშორებით",
    move_left: "გადადით მარცხენა გვერდზე",
    move_right: "გადადით მარჯვენა გვერდზე",
    move_top: "გადადით ზედა გვერდზე",
    occluded: "დოკუმენტი სრულად უნდა ჩანდეს",
    scan_data_page: "დაასკანერეთ დოკუმენტის მონაცემების გვერდი",
    scan_last_page_barcode: "დაასკანერეთ შტრიხკოდი ბოლო გვერდიდან",
    scan_left_page: "დაასკანერეთ მარცხენა გვერდი",
    scan_right_page: "დაასკანერეთ მარჯვენა გვერდი",
    scan_the_back_side: "დაასკანერეთ დოკუმენტის უკანა მხარე",
    scan_the_barcode: "დაასკანერეთ ბარკოდი",
    scan_the_front_side: "დაასკანერეთ დოკუმენტის წინა მხარე",
    scan_top_page: "დაასკანერეთ ზედა გვერდი",
    too_bright: "გადადით ნაკლებად განათებულ ადგილას",
    too_dark: "გადადით უფრო განათებულ ადგილას",
    wrong_left: "გადადით მარცხენა გვერდზე",
    wrong_right: "გადადით მარჯვენა გვერდზე",
    wrong_top: "გადადით ზედა გვერდზე",
  },
  help_button: { aria_label: "დახმარება", tooltip: "დახმარება გჭირდებათ?" },
  help_modal: {
    aria: "დასკანერებაში დახმარება",
    back_btn: "უკან",
    blur: {
      details:
        "დასკანერებისას ეცადეთ არ გაამოძრაოთ ტელეფონი და დოკუმენტი. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და დოკუმენტში ასახული მონაცემები გარჩევადი არ იყოს.",
      details_desktop:
        "დასკანერებისას ეცადეთ არ გაამოძრაოთ მოწყობილობა  და დოკუმენტი. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და დოკუმენტში ასახული მონაცემები გარჩევადი არ იყოს.",
      title: "არ იმოძრაოთ დასკანერებისას",
    },
    camera_lens: {
      details:
        "დაათვალიერეთ კამერის ლინზა ლაქების ან მტვრის აღმოსაჩენად. ჭუჭყიანი ლინზა გამოიწვევს საბოლოო ფოტოს დაბურვას, დოკუმენტის დეტალები გარჩევადი არ იქნება და მონაცემების წარმატებით დასკანერება ვერ მოხერხდება.",
      title: "გაწმინდეთ თქვენი კამერის ლინზა",
    },
    done_btn: "დასრულდა",
    done_btn_aria: "დასკანერების გაგრძელება",
    lighting: {
      details:
        "მოერიდეთ პირდაპირ მკვეთრ განათებას, რადგან ის დოკუმენტზე ანარეკლს აჩენს და დოკუმენტის ნაწილები შესაძლოა გარჩევადი აღარ იყოს. თუ დოკუმენტში მოცემულ მონაცემებს ვერ კითხულობთ, მას ვერც კამერა დააფიქსირებს.",
      title: "მოერიდეთ მკვეთრ განათებას",
    },
    next_btn: "შემდეგი",
    visibility: {
      details:
        "დარწმუნდით, რომ თითით დოკუმენტის ნაწილებს არ ფარავთ, მათ შორის ქვედა ხაზებსაც. ასევე, ფრთხილად იყავით ჰოლოგრამულ ანარეკლებთანაც, რომლებიც დოკუმენტის ველებზე გადადის.",
      title: "ყველა ველი უნდა ჩანდეს",
    },
  },
  onboarding_modal: {
    aria: "დასკანერების ინსტრუქციები",
    btn: "დასკანერების დაწყება",
    details:
      "დარწმუნდით, რომ დოკუმენტი კარგად არის განათებული. კამერის ეკრანზე დოკუმენტის ყველა ველი უნდა ჩანდეს.",
    details_desktop:
      "დარწმუნდით, რომ კამერის ლინზა სუფთაა და დოკუმენტი კარგად არის განათებული. კამერის ეკრანზე დოკუმენტის ყველა ველი უნდა ჩანდეს.",
    title: "ყველა დეტალი უნდა ჩანდეს",
    title_desktop: "მოემზადეთ დასკანერებისთვის",
  },
  sdk_aria: "დოკუმენტის დასკანერების ეტაპი",
  timeout_modal: {
    cancel_btn: "გაუქმება",
    details: "დოკუმენტის წაკითხვა ვერ ხერხდება. ხელახლა სცადეთ.",
    retry_btn: "ხელახლა ცდა",
    title: "სკანირება წარუმატებელია",
  },
} as const;
