/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for kk.
 */
export default {
  document_filtered_modal: {
    details: "Басқа құжатты сканерлеп көріңіз.",
    title: "Құжат қабылданбады",
  },
  document_not_recognized_modal: {
    details: "Қолдау көрсетілетін құжаттың алдыңғы жағын сканерлеңіз.",
    title: "Құжатын танылмады",
  },
  feedback_messages: {
    blur_detected: "Құжат пен телефонды қозғалтпай ұстаңыз",
    camera_angle_too_steep: "Құжатты телефонға параллель етіп ұстаңыз",
    document_scanned_aria: "Сәтті! Құжат сканерленді",
    document_too_close_to_edge: "Алыстаңыз",
    face_photo_not_fully_visible: "Бет суреті толықтай көрінетін болуы тиіс",
    flip_document: "Құжатты айналдырыңыз",
    flip_to_back_side: "Артқы жаққа айналдырыңыз",
    front_side_scanned_aria: "Сәтті! Алдыңғы жағы сканерленді",
    glare_detected: "Шағылысуды жою үшін құжатты еңкейтіңіз немесе жылжытыңыз",
    keep_document_parallel: "Құжатты экранмен параллель етіп ұстаңыз",
    keep_document_still: "Құжат пен құрылғыны қозғалтпай ұстаңыз",
    move_closer: "Жақындатыңыз",
    move_farther: "Алыстаңыз",
    move_left: "Сол жақтағы бетке ауысыңыз",
    move_right: "Оң жақтағы бетке ауысыңыз",
    move_top: "Жоғарғы жақтағы бетке ауысыңыз",
    occluded: "Құжаттың толықтай көрініп тұрғанына көз жеткізіңіз",
    scan_data_page: "Құжаттың деректер бетін сканерлеңіз",
    scan_last_page_barcode: "Соңғы беттегі штрихкодты сканерлеңіз",
    scan_left_page: "Сол бетті сканерлеңіз",
    scan_right_page: "Оң бетті сканерлеңіз",
    scan_the_back_side: "Құжаттың артқы жағын сканерлеңіз",
    scan_the_barcode: "Штрих-кодты сканерлеңіз",
    scan_the_front_side: "Құжаттың алдыңғы жағын сканерлеңіз",
    scan_top_page: "Жоғарғы бетті сканерлеңіз",
    too_bright: "Жарығы азырақ жерге өтіңіз",
    too_dark: "Жарығырақ жерге өтіңіз",
    wrong_left: "Сол бетке өтіңіз",
    wrong_right: "Оң бетке өтіңіз",
    wrong_top: "Жоғарғы бетке ауысыңыз",
  },
  help_button: { aria_label: "Анықтама", tooltip: "Көмек керек пе?" },
  help_modal: {
    aria: "Сканерлеу анықтамасы",
    back_btn: "Артқа қайту",
    blur: {
      details:
        "Сканерлеу кезінде телефон мен құжатты мүмкіндігінше қозғалтпай ұстаңыз. Екеуінің де қозғалысы суретті бұлыңғыр етіп, құжаттағы деректерді оқылмайтындай етіп жіберуі мүмкін.",
      details_desktop:
        "Сканерлеу кезінде құрылғы мен құжатты мүмкіндігінше қозғалтпай ұстаңыз. Екеуінің де қозғалысы суретті бұлыңғыр етіп, құжаттағы деректерді оқылмайтындай етіп жіберуі мүмкін.",
      title: "Сканерлеу кезінде қозғалмаңыз",
    },
    camera_lens: {
      details:
        "Камера объективінде дақ немесе шаң бар-жоғын тексеріңіз. Лас объектив қорытынды кескіннің бұлыңғырлануына әкеледі, ал бұл өз кезегінде құжат деректерінің оқылмауына алып келеді және сканерлеуге кедергі келтіреді.",
      title: "Камера объективін тазалаңыз",
    },
    done_btn: "Дайын",
    done_btn_aria: "Сканерлеуді жалғастыру",
    lighting: {
      details:
        "Тікелей және қатты жарықтан арырақ тұрыңыз, себебі ол құжаттан шағылысып, кейбір бөліктерін оқуға мүмкіндік бермейді. Егер құжаттағы деректер сізге көрінбесе, олар камераға да көрінбейді.",
      title: "Тым жарық жерден әрі тұрыңыз",
    },
    next_btn: "Келесі",
    visibility: {
      details:
        "Саусағыңызбен құжаттың кейбір бөліктерін, әсіресе төменгі жолдарын жауып қалмаңыз. Сондай-ақ, құжат өрістерінің үстінен өтетін голограммалық шағылыстарға да назар аударыңыз.",
      title: "Барлық өрістердің көрініп тұрғанына көз жеткізіңіз",
    },
  },
  onboarding_modal: {
    aria: "Сканерлеу нұсқаулығы",
    btn: "Сканерлеуді бастау",
    details:
      "Құжат жақсы жарықта екеніне көз жеткізіңіз. Құжаттағы барлық өрістер камера экранында көрініп тұруы керек.",
    details_desktop:
      "Камера линзасы таза және құжат жақсы жарықта екеніне көз жеткізіңіз. Құжаттағы барлық өрістер камера экранында көрініп тұруы керек.",
    title: "Мәліметтердің барлығының көрініп тұрғанына көз жеткізіңіз",
    title_desktop: "Сканерлеуге дайындалыңыз",
  },
  sdk_aria: "Құжатты сканерлеу экраны",
  timeout_modal: {
    cancel_btn: "Бас тарту",
    details: "Құжатты оқу мүмкін болмады. Әрекетті қайталаңыз.",
    retry_btn: "Қайталау",
    title: "Сканерлене алмады",
  },
} as const;
