/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for km_KH.
 */
export default {
  document_filtered_modal: {
    details: "សាកល្បងស្កេនឯកសារផ្សេង។",
    title: "ឯកសារមិនត្រូវបានទទួលយកទេ",
  },
  document_not_recognized_modal: {
    details: "ស្កេនផ្នែកខាងមុខនៃឯកសារដែលគាំទ្រ។",
    title: "ឯកសារមិនត្រូវបានទទួលស្គាល់ទេ។",
  },
  feedback_messages: {
    blur_detected: "រក្សាឯកសារ និងទូរស័ព្ទឱ្យនៅស្ងៀម",
    camera_angle_too_steep: "រក្សាឯកសារស្របទៅនឹងទូរស័ព្ទ",
    document_scanned_aria: "ជោគជ័យ! ឯកសារត្រូវបានស្កេន",
    document_too_close_to_edge: "ផ្លាស់ទីទៅឆ្ងាយ",
    face_photo_not_fully_visible: "រក្សារូបថតមុខដែលអាចមើលឃើញយ៉ាងពេញលេញ",
    flip_document: "ត្រឡប់ឯកសារ",
    flip_to_back_side: "បង្វិលទៅផ្នែកខាងក្រោយ",
    front_side_scanned_aria: "ជោគជ័យ! ផ្នែកខាងមុខត្រូវបានស្កេន",
    glare_detected: "ផ្អៀង ឬផ្លាស់ទីឯកសារ ដើម្បីលុបការឆ្លុះបញ្ចាំង",
    keep_document_parallel: "រក្សាឯកសារឲ្យស្របគ្នានឹងអេក្រង់",
    keep_document_still: "រក្សាឯកសារ និងឧបករណ៍ឲ្យនៅនឹង",
    move_closer: "ផ្លាស់ទីទៅជិត",
    move_farther: "ផ្លាស់ទីទៅឆ្ងាយ",
    move_left: "ផ្លាស់ទីទៅទំព័រនៅខាងឆ្វេង",
    move_right: "ផ្លាស់ទីទៅទំព័រនៅខាងស្តាំ",
    move_top: "ផ្លាស់ទីទៅទំព័រខាងលើ",
    occluded: "រក្សាឯកសារដែលអាចមើលឃើញយ៉ាងពេញលេញ",
    scan_data_page: "ស្កេនទំព័រទិន្នន័យនៃឯកសារ",
    scan_last_page_barcode: "ស្កេនបាកូដពីទំព័រចុងក្រោយ",
    scan_left_page: "ស្កេនទំព័រខាងឆ្វេង",
    scan_right_page: "ស្កេនទំព័រត្រឹមត្រូវ",
    scan_the_back_side: "ស្កេនផ្នែកខាងក្រោយនៃឯកសារ",
    scan_the_barcode: "ស្កេនបាកូដ",
    scan_the_front_side: "ស្កេនផ្នែកខាងមុខនៃឯកសារ",
    scan_top_page: "ស្កេនទំព័រកំពូល",
    too_bright: "ផ្លាស់ទីទៅកន្លែងដែលមានពន្លឺតិច",
    too_dark: "ផ្លាស់ទីទៅកន្លែងភ្លឺជាង",
    wrong_left: "ផ្លាស់ទីទៅទំព័រខាងឆ្វេង",
    wrong_right: "ផ្លាស់ទីទៅទំព័រខាងស្តាំ",
    wrong_top: "ផ្លាស់ទីទៅទំព័រកំពូល",
  },
  help_button: { aria_label: "ជំនួយ", tooltip: "ត្រូវការជំនួយ?" },
  help_modal: {
    aria: "ជំនួយក្នុងការស្កេន",
    back_btn: "ត្រឡប់មកវិញ",
    blur: {
      details:
        "ព្យាយាមរក្សាទូរសព្ទ និងឯកសារឱ្យនៅដដែល ពេលកំពុងស្កេន។ ការផ្លាស់ទីទាំងពីរអាចធ្វើឱ្យរូបភាពព្រិល និងធ្វើឱ្យទិន្នន័យនៅលើឯកសារមិនអាចអានបាន។",
      details_desktop:
        "ព្យាយាមរក្សាឧបករណ៍ និងឯកសារឲ្យនៅនឹងពេលកំពុងស្កេន។ ការចល័តអាចធ្វើឲ្យរូបភាពព្រាល និងធ្វើឲ្យទិន្នន័យនៅលើឯកសារមិនអាចអានបាន។",
      title: "រក្សាភាពស្ងៀមស្ងាត់ខណៈពេលកំពុងស្កេន",
    },
    camera_lens: {
      details:
        "ពិនិត្យកញ្ចក់កាមេរ៉ារកមើលស្នាមប្រឡាក់ ឬធូលី។ កញ្ចក់ប្រឡាក់អាចបណ្ដាលឲ្យរូបភាពចុងក្រោយព្រាល ដែលធ្វើឲ្យមិនអាចអានព័ត៌មានលម្អិតនៅលើឯកសារ និងរារាំងមិនឲ្យស្កេនទិន្នន័យបានជោគជ័យ។",
      title: "សម្អាតកញ្ចក់កាមេរ៉ារបស់អ្នក។",
    },
    done_btn: "រួចរាល់",
    done_btn_aria: "បន្តស្កេន",
    lighting: {
      details:
        "ជៀសវាងពន្លឺខ្លាំងដោយផ្ទាល់ព្រោះវាឆ្លុះបញ្ចាំងពីឯកសារ ហើយអាចធ្វើឱ្យផ្នែកខ្លះនៃឯកសារមិនអាចអានបាន។ ប្រសិនបើអ្នកមិនអាចអានទិន្នន័យនៅលើឯកសារបានទេ វាក៏មិនអាចមើលឃើញដោយកាមេរ៉ាដែរ។",
      title: "ប្រយ័ត្នចំពោះពន្លឺខ្លាំង",
    },
    next_btn: "បន្ទាប់",
    visibility: {
      details:
        "ត្រូវប្រាកដថាអ្នកមិនគ្របដណ្តប់ផ្នែកនៃឯកសារដោយប្រើម្រាមដៃ រួមទាំងបន្ទាត់ខាងក្រោម។ ដូចគ្នានេះផងដែរ ប្រយ័ត្នចំពោះការឆ្លុះបញ្ចាំង hologram ដែលឆ្លងកាត់វាលឯកសារ។",
      title: "រក្សាវាលទាំងអស់ដែលអាចមើលឃើញ",
    },
  },
  onboarding_modal: {
    aria: "ការណែនាំអំពីការស្កេន",
    btn: "ចាប់ផ្តើមស្កេន",
    details:
      "ត្រូវប្រាកដថាអ្នករក្សាឯកសារឱ្យបានល្អ វាលឯកសារទាំងអស់គួរតែអាចមើលឃើញនៅលើអេក្រង់កាមេរ៉ា។",
    details_desktop:
      "ត្រូវប្រាកដថា អ្នករក្សាកញ្ចក់កាមេរ៉ារបស់អ្នកឲ្យនៅស្អាត ហើយឯកសារមានពន្លឺល្អ។ កន្លែងឯកសារទាំងអស់គួរតែអាចមើលឃើញច្បាស់នៅលើអេក្រង់កាមេរ៉ា។",
    title: "រក្សាព័ត៌មានលម្អិតទាំងអស់ដែលអាចមើលឃើញ",
    title_desktop: "ត្រៀមរួចរាល់ដើម្បីស្កេនហើយ",
  },
  sdk_aria: "អេក្រង់ស្កេនឯកសារ",
  timeout_modal: {
    cancel_btn: "បោះបង់",
    details: "មិនអាចអានឯកសារបានទេ។ សូមព្យាយាមម្តងទៀត។",
    retry_btn: "ព្យាយាមម្តងទៀត",
    title: "ស្កេនមិនជោគជ័យ",
  },
} as const;
