/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ne.
 */
export default {
  document_filtered_modal: {
    details: "फरक कागजात स्क्यान गरेर हेर्नुहोस्",
    title: "कागजात स्वीकार्य भएन",
  },
  document_not_recognized_modal: {
    details: "सपोर्ट हुने कागजातको अगाडि पट्टिको भाग स्क्यान गर्नुहोस्।",
    title: "कागजात पहिचान हुन सकेन",
  },
  feedback_messages: {
    blur_detected: "कागजात र फोन नहल्लाइ राख्नुहोस्",
    camera_angle_too_steep: "कागजातलाई फोनको समानान्तर राख्नुहोस्",
    document_scanned_aria: "पूरा भयो! कागजात स्क्यान भयो",
    document_too_close_to_edge: "पर जानुहोस्",
    face_photo_not_fully_visible: "फेस फोटो पूर्ण रूपमा देखिने गरी राख्नुहोस्",
    flip_document: "कागजात फ्लिप गर्नुहोस्",
    flip_to_back_side: "पछाडि पट्टि फ्लिप गर्नुहोस्",
    front_side_scanned_aria: "पूरा भयो! अगाडिपट्टिको भाग स्क्यान भयो",
    glare_detected: "रिफ्लेक्सन हटाउन कागजात ढल्क्याउनुहोस् वा हटाउनुहोस्",
    keep_document_parallel: "स्क्रिनलाई कागजातको ठीक माथि सीधा राख्नुहोस्",
    keep_document_still: "कागजात र डिभाइस नहल्लाई राख्नुहोस्",
    move_closer: "नजिक जानुहोस्",
    move_farther: "पर जानुहोस्",
    move_left: "पृष्ठको बायाँपट्टि जानुहोस्",
    move_right: "पृष्ठको दायाँपट्टि जानुहोस्",
    move_top: "पृष्ठको माथिल्लो भागमा जानुहोस्",
    occluded: "कागजातलाई पूर्ण रूपमा देखिने गरी राख्नुहोस्",
    scan_data_page: "कागजको डाटा पृष्ठ स्क्यान गर्नुहोस्",
    scan_last_page_barcode: "अन्तिम पृष्ठमा भएको बारकोड स्क्यान गर्नुहोस्।",
    scan_left_page: "बायाँ पृष्ठ स्क्यान गर्नुहोस्",
    scan_right_page: "दायाँ पृष्ठ स्क्यान गर्नुहोस्",
    scan_the_back_side: "कागजातको फपछाडिपट्टिको भाग स्क्यान गर्नुहोस्",
    scan_the_barcode: "बारकोड स्क्यान गर्नुहोस्",
    scan_the_front_side: "कागजातको अगाडिपट्टिको भाग स्क्यान गर्नुहोस्",
    scan_top_page: "माथिल्लो पृष्ठ स्क्यान गर्नुहोस्",
    too_bright: "कम उज्यालो स्पटमा जानुहोस्",
    too_dark: "सबैभन्दा चम्किलो स्पटमा जानुहोस्",
    wrong_left: "बायाँ पृष्ठमा जानुहोस्",
    wrong_right: "दायाँ पृष्ठमा जानुहोस्",
    wrong_top: "माथिल्लो पृष्ठमा जानुहोस्",
  },
  help_button: { aria_label: "मद्दत", tooltip: "सहयोग चाहिन्छ?" },
  help_modal: {
    aria: "स्क्यानिङ सहायता",
    back_btn: "पछाडि",
    blur: {
      details:
        "स्क्यान गर्दा फोन वा कागजात स्थिर राख्न प्रयास गर्नुहोस्। दुबैमध्ये एउटा मात्रा चल्दा पनि तस्वीर धमिलो हुन सक्छ र कागजातमा भएको डाटा पढ्न नसकिने हुन सक्छ।",
      details_desktop:
        "स्क्यान गर्दा डिभाइस र कागजात दुवैलाई नहल्लाई राख्ने प्रयास गर्नुहोस्। अलिकति मात्र हलियो भने फोटो धमिलो हुन सक्छ र कागजातमा भएका विवरणहरू पढ्न नसकिने हुन सक्छ।",
      title: "स्क्यान गर्दा नहल्लिनुहोस्",
    },
    camera_lens: {
      details:
        "आफ्नो क्यामेराको लेन्समा औँठाको छाप वा धुलो छ कि भनेर जाँच गर्नुहोस्। फोहोर लेन्सले गर्दा अन्तिम फोटो धमिलो आउँछ र कागजातको विवरण पढ्न सकिँदैन र डेटा स्क्यान हुन पाउँदैन।",
      title: "आफ्नो क्यामेराको लेन्स सफा गर्नुहोस्",
    },
    done_btn: "भयो",
    done_btn_aria: "स्क्यानिङ पुन: सुरु गर्नुहोस्",
    lighting: {
      details:
        "कागजातमा रिफ्लेक्सन आउने र केही भाग पढ्न नसकिने हुँदा सिधा र कडा प्रकाशबाट बच्नुहोस्। तपाईंले कागजातमा रहेका डाटा पढ्न सक्नु भएन भने क्यामेरामा पनि देख्न सक्दैन।",
      title: "तेजिलो प्रकाशबाट जोगिनुहोस्।",
    },
    next_btn: "अर्को",
    visibility: {
      details:
        "कागजातको तल्लो रेखा लगायत तपाईंले औंलाले कागजातको केही भागहरू ढाक्नुभएको छैन भनी सुनिश्चित गर्नुहोस्। यस बाहेक, कागजातका भागहरू माथि जाने होलोग्राम रिफ्लेक्सन हुने कुरा पनि ध्यान दिनुहोस्।",
      title: "फिल्डहरू देखिनेगरी राख्नुहोस्",
    },
  },
  onboarding_modal: {
    aria: "स्क्यानिङ निर्देशनहरू",
    btn: "स्क्यान सुरु गर्नुहोस्",
    details:
      "कागजात उज्यालो राख्नुहोस्। सबै कागजात फिल्ड क्यामेरा स्क्रिनमा देखिने हुनुपर्छ।",
    details_desktop:
      "आफ्नो क्यामेराको लेन्स पुछ्नुहोस् र कागजलाई उज्यालो ठाउँमा राख्नुहोस्। कागजको कुनै पनि भाग वा कुना नछुट्ने गरी क्यामेराको स्क्रिनमा मिलाउनुहोस्।",
    title: "विवरणहरू देखिनेगरी राख्नुहोस्",
    title_desktop: "स्क्यान गर्न तयार हुनुहोस्",
  },
  sdk_aria: "कागजात स्क्यान गर्ने स्क्रिन",
  timeout_modal: {
    cancel_btn: "रद्द गर्नुहोस्",
    details: "कागजात पढ्न सकेन। कृपया पुन: प्रेस गर्नुहोस्।",
    retry_btn: "पुन: प्रयास गर्नुहोस्",
    title: "स्क्यान हुन सकेन",
  },
} as const;
