/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ps_AF.
 */
export default {
  document_filtered_modal: {
    details: "د بل سند سکین کولو هڅه وکړئ.",
    title: "سند نه دی منل شوی",
  },
  document_not_recognized_modal: {
    details: "د ملاتړ شوي سند مخکینۍ برخه سکین کړئ.",
    title: "سند و نه پېژندل شو",
  },
  feedback_messages: {
    blur_detected: "اسناد او تلیفون ارام وساتئ",
    camera_angle_too_steep: "سند د تلیفون سره موازي وساتئ",
    document_scanned_aria: "سند په بریالیتوب سکن شو!",
    document_too_close_to_edge: "نور لاړ شه",
    face_photo_not_fully_visible: "د مخ عکس په بشپړه توګه ښکاره وساتئ",
    flip_document: "سند واړوئ",
    flip_to_back_side: "شاته اړخ ته واړوئ",
    front_side_scanned_aria: "د مخې سکن په بریالیتوب ترسره شو!",
    glare_detected: "د انعکاس لرې کولو لپاره سند ټیټ کړئ یا حرکت ورکړئ",
    keep_document_parallel: "سند له سکرین سره موازي وساتئ",
    keep_document_still: "سند او وسیله بې‌حرکته وساتئ",
    move_closer: "نږدې شه",
    move_farther: "نور لاړ شه",
    move_left: "په چپ اړخ کې پاڼې ته لاړ شئ",
    move_right: "ښي خوا ته پاڼې ته لاړ شئ",
    move_top: "پورته پاڼې ته لاړ شئ",
    occluded: "سند په بشپړ ډول ښکاره وساتئ",
    scan_data_page: "د سند د معلوماتو پاڼه سکین کړئ",
    scan_last_page_barcode: "د آخري پاڼې څخه بارکوډ سکین کړئ",
    scan_left_page: "کیڼ پاڼه سکین کړئ",
    scan_right_page: "سمه پاڼه سکین کړئ",
    scan_the_back_side: "د سند شاته برخه سکین کړئ",
    scan_the_barcode: "بارکوډ سکین کړئ",
    scan_the_front_side: "د سند مخکینۍ برخه سکین کړئ",
    scan_top_page: "پورته پاڼه سکین کړئ",
    too_bright: "هغه ځای ته لاړ شئ چې لږ رڼا ولري",
    too_dark: "روښانه ځای ته لاړ شئ",
    wrong_left: "کیڼ مخ ته لاړ شئ",
    wrong_right: "ښي پاڼې ته لاړ شئ",
    wrong_top: "پورته پاڼې ته لاړ شئ",
  },
  help_button: { aria_label: "مرسته", tooltip: "تاسو مرستې ته اړتیا لرئ؟" },
  help_modal: {
    aria: "د سکین کولو په چارو کې مرسته",
    back_btn: "شاته",
    blur: {
      details:
        "هڅه وکړئ چې د سکین کولو پرمهال تلیفون او سند ارام وساتئ. د دواړو خواوو ته حرکت ورکول کولی شي عکس تیاره کړي او په سند کې معلومات د لوستلو وړ نه کړي.",
      details_desktop:
        "هڅه وکړئ چې د سکین کولو پر مهال وسیله او سند بې‌حرکته وساتئ. د دواړو له خوځېدو سره انځور تتېږي او د سند معلومات نه لوستل کېږي.",
      title: "د سکین کولو پرمهال ارام پاتې شئ",
    },
    camera_lens: {
      details:
        "خپله د کمرې لینز د داغونو یا دوړو لپاره وګورئ. چټل لینز د وروستي انځور د خړپړ کېدو لامل ګرځي، چې له امله یې د کارت جزئیات د لوستلو وړ نه وي او د معلوماتو بریالی سکین مخه نیسي.",
      title: "خپل د کمرې لینز پاک کړئ",
    },
    done_btn: "وشو",
    done_btn_aria: "د سي وي سکین کول",
    lighting: {
      details:
        "د مستقیم سخت رڼا څخه ډډه وکړئ ځکه چې دا د سند څخه منعکس کیږي او کولی شي د سند برخې د لوستلو وړ نه کړي. که تاسو په سند کې معلومات نشئ لوستلی، نو دا به کیمرې ته هم ونه لیدل شي.",
      title: "د سختې رڼا لپاره پام وکړئ",
    },
    next_btn: "بل",
    visibility: {
      details:
        "ډاډ ترلاسه کړئ چې تاسو د سند ځینې برخې په ګوتو سره نه پوښئ، په شمول د لاندې کرښو. همدارنګه، د هولوگرام انعکاسونو ته پام وکړئ چې د سند په ساحو کې ځي.",
      title: "ټول ساحې ښکاره وساتئ",
    },
  },
  onboarding_modal: {
    aria: "د سکین کولو اړوند لارښوونې",
    btn: "سکن کول پیل کړئ",
    details:
      "ډاډ ترلاسه کړئ چې تاسو سند ښه روښانه ساتئ. د اسنادو ټولې ساحې باید د کیمرې په سکرین کې ښکاره شي.",
    details_desktop:
      "ډاډ ترلاسه کړئ چې د کمرې لینز مو پاک وي او سند ښه روښانه وي. د سند ټولې برخې باید د کمرې په سکرین کې ښکاره وي.",
    title: "ټول جزئیات ښکاره وساتئ",
    title_desktop: "د سکین لپاره چمتو شئ",
  },
  sdk_aria: "د سند د سکین کولو سکرین",
  timeout_modal: {
    cancel_btn: "لغوه کول",
    details: "د سند لوستلو توان نه لرم. مهرباني وکړئ بیا هڅه وکړئ.",
    retry_btn: "بیا هڅه وکړئ",
    title: "سکین ناکام شو",
  },
} as const;
