/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for si.
 */
export default {
  document_filtered_modal: {
    details: "වෙනත් ලේඛනයක් ස්කෑන් කිරීමට උත්සාහ කර බලන්න.",
    title: "ලේඛනය පිළිගත නොහැක",
  },
  document_not_recognized_modal: {
    details: "සහාය දක්වන ලේඛනයක ඉදිරි පැත්ත ස්කෑන් කරන්න.",
    title: "ලේඛනය හඳුනාගත නොහැක",
  },
  feedback_messages: {
    blur_detected: "ලේඛනය සහ දුරකථනය නොසෙල්වන සේ තබා ගන්න",
    camera_angle_too_steep: "ලේඛනය දුරකථනයට සමාන්තරව තබා ගන්න",
    document_scanned_aria: "සාර්ථකයි! ලේඛනය ස්කෑන් කර ඇත",
    document_too_close_to_edge: "මදක් ඈත් කරන්න",
    face_photo_not_fully_visible:
      "මුහුණේ ඡායාරූපය සම්පූර්ණයෙන් පෙනෙන පරිදි තබා ගන්න",
    flip_document: "ලේඛනය අනෙක් පිට හරවන්න",
    flip_to_back_side: "පිට පැත්ත හරවන්න",
    front_side_scanned_aria: "සාර්ථකයි! ඉදිරි පැත්ත ස්කෑන් කර ඇත",
    glare_detected: "පරාවර්තනය ඉවත් කිරීමට ලේඛනය ඇල කරන්න හෝ  එහා මෙහා කරන්න",
    keep_document_parallel: "ලේඛනය තිරයට සමාන්තරව තබා ගන්න",
    keep_document_still: "ලේඛනය සහ උපාංගය නොසෙල්වෙන සේ තබා ගන්න",
    move_closer: "මදක් ළං කරන්න",
    move_farther: "මදක් ඈත් කරන්න",
    move_left: "වම්පස ඇති පිටුවට යන්න",
    move_right: "දකුණුපස ඇති පිටුවට යන්න",
    move_top: "මුදුනේ ඇති පිටුවට යන්න",
    occluded: "ලේඛනය සම්පූර්ණයෙන් පෙනෙන පරිදි තබා ගන්න",
    scan_data_page: "ලේඛනයේ දත්ත සහිත පිටුව ස්කෑන් කරන්න",
    scan_last_page_barcode: "අවසාන පිටුවෙන් බාර්කෝඩ් එක ස්කෑන් කරන්න",
    scan_left_page: "වම් පිටුව ස්කෑන් කරන්න",
    scan_right_page: "දකුණු පිටුව ස්කෑන් කරන්න",
    scan_the_back_side: "ලේඛනයේ පිට පැත්ත ස්කෑන් කරන්න",
    scan_the_barcode: "බාර්කෝඩ් එක ස්කෑන් කරන්න",
    scan_the_front_side: "ලේඛනයේ ඉදිරි පැත්ත ස්කෑන් කරන්න",
    scan_top_page: "මුදුන් පිටුව ස්කෑන් කරන්න",
    too_bright: "ආලෝකය මදක් අඩු තැනකට යන්න",
    too_dark: "ආලෝකය මදක් වැඩි තැනකට යන්න",
    wrong_left: "වම් පිටුවට යන්න",
    wrong_right: "දකුණු පිටුවට යන්න",
    wrong_top: "මුදුන් පිටුවට යන්න",
  },
  help_button: { aria_label: "උදව්", tooltip: "උදව් අවශ්‍ය ද?" },
  help_modal: {
    aria: "ස්කෑන් කිරීමට උදව්",
    back_btn: "ආපසු",
    blur: {
      details:
        "ස්කෑන් කරන අතරතුර දුරකථනය සහ ලේඛනය නොසෙල්වෙන සේ තබා ගන්න. මින් එකක් හෝ සෙලවීම රූපය අපැහැදිලි වී ලේඛනයේ දත්ත කියවීමට නොහැකි වීමට හේතු විය හැක.",
      details_desktop:
        "ස්කෑන් කරන අතරතුර උපාංගය සහ ලේඛනය නොසෙල්වෙන සේ තබා ගන්න. මින් එකක් හෝ සෙලවීම රූපය අපැහැදිලි වී ලේඛනයේ දත්ත කියවීමට නොහැකි වීමට හේතු විය හැක.",
      title: "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටින්න",
    },
    camera_lens: {
      details:
        "ඔබේ කැමරා කාචයේ පැල්ලම් හෝ දූවිලි ඇත්දැයි පරීක්ෂා කරන්න. කැමරා කාචය අපිරිසිදු වීම ඉන් ලබා ගන්නා අවසාන රූපය බොඳ වීමට හේතුව වන අතර, ඉන් ලේඛනයේ විස්තර කියවිය නොහැකි වී, දත්ත සාර්ථකව ස්කෑන් කිරීමට බාධා ඇති වේ.",
      title: "ඔබේ කැමරා කාචය පිරිසිදු කරන්න",
    },
    done_btn: "කළා",
    done_btn_aria: "ස්කෑන් කිරීම නැවත අරඹන්න",
    lighting: {
      details:
        "ඍජු රළු ආලෝකය ලේඛනයේ වැදී පරාවර්තනය වී ලේඛනයේ ඇති කොටස් කියවීමට නොහැකි විය හැකි බැවින් එය වළක්වා ගන්න. ඔබට ලේඛනයේ දත්ත කියවිය නොහැකි නම්, එය කැමරාවට ද දෘශ්‍යමාන නොවේ.",
      title: "රළු ආලෝකය ගැන සැලකිලිමත් වන්න",
    },
    next_btn: "ඊලඟ",
    visibility: {
      details:
        "ඔබේ ඇඟිල්ලකින් ලේඛනයේ පහළ ඇති රේඛා ඇතුළු කොටස් ආවරණය නොවන බවට වග බලා ගන්න. එසේම ලේඛනයේ කොටස් මත ඇතිවන හොලෝග්‍රෑම් පරාවර්තන පිළිබඳව ද අවධානයෙන් සිටින්න.",
      title: "සියලු කොටස් හොඳින් පෙනෙන පරිදි තබා ගන්න",
    },
  },
  onboarding_modal: {
    aria: "ස්කෑන් කිරීමට උපදෙස්",
    btn: "ස්කෑන් කිරීම ආරම්භ කරන්න",
    details:
      "ලේඛනයට හොඳින් ආලෝකය වැටෙන පරිදි තබා ගැනීමට වග බලා ගන්න. ලේඛනයේ සියලුම කොටස් කැමරා තිරය මත දෘශ්‍යමාන විය යුතු ය.",
    details_desktop:
      "ඔබේ කැමරා කාචය පිරිසිදුවත්, ලේඛනයට හොඳින් ආලෝකය වැටෙන පරිදි තබා ගැනීමටත් වග බලා ගන්න. ලේඛනයේ සියලුම කොටස් කැමරා තිරය මත දෘශ්‍යමාන විය යුතු ය.",
    title: "සියලු විස්තර පෙනෙන පරිදි තබා ගන්න",
    title_desktop: "ස්කෑන් කිරීමට සූදානම් වන්න",
  },
  sdk_aria: "ලේඛන ස්කෑන් කිරීමේ තිරය",
  timeout_modal: {
    cancel_btn: "අවලංගු කරන්න",
    details: "ලේඛනය කියවිය නොහැක. කරුණාකර නැවත උත්සාහ කරන්න.",
    retry_btn: "නැවත උත්සාහ කරන්න",
    title: "ස්කෑන් කිරීම අසාර්ථකයි",
  },
} as const;
