/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for uk.
 */
export default {
  document_filtered_modal: {
    details: "Спробуйте відсканувати інший документ.",
    title: "Документ не прийнято",
  },
  document_not_recognized_modal: {
    details: "Відскануйте лицьову сторону підтримуваного документа.",
    title: "Документ не розпізнано",
  },
  feedback_messages: {
    blur_detected: "Тримайте документ і телефон нерухомо",
    camera_angle_too_steep: "Тримайте документ паралельно телефону",
    document_scanned_aria: "Готово! Документ відскановано.",
    document_too_close_to_edge: "Віддаляйтесь",
    face_photo_not_fully_visible: "Тримайте фото обличчя повністю видимим",
    flip_document: "Переверніть документ",
    flip_to_back_side: "Переверніть на зворотній бік",
    front_side_scanned_aria: "Готово! Передній бік відскановано.",
    glare_detected: "Нахиліть або перемістіть документ, щоб прибрати відблиск",
    keep_document_parallel: "Тримайте документ паралельно екрану",
    keep_document_still: "Тримайте документ і пристрій нерухомо",
    move_closer: "Наблизьтесь",
    move_farther: "Віддаляйтесь",
    move_left: "Перейдіть на сторінку ліворуч",
    move_right: "Перейдіть на сторінку праворуч",
    move_top: "Перейдіть на верхню сторінку",
    occluded: "Тримайте документ повністю у полі зору",
    scan_data_page: "Відскануйте сторінку з даними документа",
    scan_last_page_barcode: "Відскануйте штрихкод з останньої сторінки",
    scan_left_page: "Відскануйте ліву сторінку",
    scan_right_page: "Відскануйте праву сторінку",
    scan_the_back_side: "Скануйте зворотній бік документа",
    scan_the_barcode: "Відскануйте штрих-код",
    scan_the_front_side: "Відскануйте лицьову сторону документа",
    scan_top_page: "Відскануйте верхню сторінку",
    too_bright: "Перейдіть у місце з менш яскравим освітленням",
    too_dark: "Перейдіть у більш освітлене місце",
    wrong_left: "Перейдіть на ліву сторінку",
    wrong_right: "Перейдіть на праву сторінку",
    wrong_top: "Перейдіть на верхню сторінку",
  },
  help_button: { aria_label: "Допомога", tooltip: "Потрібна допомога?" },
  help_modal: {
    aria: "Допомога зі скануванням",
    back_btn: "Назад",
    blur: {
      details:
        "Намагайтеся тримати телефон і документ нерухомо під час сканування. Рух одного з них може розмити зображення та зробити дані на документі нечитабельними.",
      details_desktop:
        "Намагайтеся тримати пристрій і документ нерухомо під час сканування. Рух одного з них може розмити зображення та зробити дані на документі нечитабельними.",
      title: "Не рухайтеся під час сканування",
    },
    camera_lens: {
      details:
        "Перевірте об'єктив камери на наявність плям або пилу. Брудний об'єктив призводить до розмиття кінцевого зображення, що робить деталі документу нечитабельними та заважає успішному скануванню даних.",
      title: "Очистіть об'єктив камери",
    },
    done_btn: "Готово",
    done_btn_aria: "Відновити сканування",
    lighting: {
      details:
        "Уникайте прямого яскравого світла, адже воно відбивається від документа і може зробити частини документа нечитабельними. Якщо ви не можете прочитати дані на документі, камера їх також не зчитає.",
      title: "Обережно з яскравим світлом",
    },
    next_btn: "Далі",
    visibility: {
      details:
        "Переконайтеся, що ви не закриваєте частини документа пальцем, зокрема нижні рядки. Також стежте за відблисками від голограм, які перекривають поля документа.",
      title: "Тримайте всі поля видимими",
    },
  },
  onboarding_modal: {
    aria: "Інструкції щодо сканування",
    btn: "Почати сканування",
    details:
      "Переконайтеся, що документ добре освітлений. Усі поля документа мають бути видимими на екрані камери.",
    details_desktop:
      "Переконайтеся, що об'єктив камери чистий, а документ добре освітлений. Усі поля документа мають бути видимими на екрані камери.",
    title: "Тримайте всі деталі видимими",
    title_desktop: "Підготуйтеся до сканування",
  },
  sdk_aria: "Екран сканування документів",
  timeout_modal: {
    cancel_btn: "Скасувати",
    details: "Не вдалося зчитати документ. Будь ласка, спробуйте ще раз.",
    retry_btn: "Повторити спробу",
    title: "Сканування не вдалося",
  },
} as const;
