/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ur.
 */
export default {
  document_filtered_modal: {
    details: "کسی اور دستاویز کو اسکین کرنے کی کوشش کریں۔",
    title: "دستاویز قبول نہیں کی گئی",
  },
  document_not_recognized_modal: {
    details: "معاونت یافتہ دستاویز کے سامنے والے حصے کو اسکین کریں۔",
    title: "دستاویز شناخت نہیں ہوئی",
  },
  feedback_messages: {
    blur_detected: "دستاویز اور فون کو ساکن رکھیں",
    camera_angle_too_steep: "دستاویز کو فون کے متوازی رکھیں",
    document_scanned_aria: "کامیابی! دستاویز اسکین ہو گئی ہے",
    document_too_close_to_edge: "اور دور جائیں",
    face_photo_not_fully_visible: "چہرے کی تصویر کو مکمل طور پر نمایاں رکھیں",
    flip_document: "دستاویز کو پلٹیں",
    flip_to_back_side: "پچھلے حصے کی طرف پلٹیں",
    front_side_scanned_aria: "کامیابی! سامنے کا رخ اسکین ہو گیا ہے",
    glare_detected: "عکس ختم کرنے کے لئے دستاویز کو جھکائیں یا حرکت دیں",
    keep_document_parallel: "دستاویز کو سکرین کے متوازی رکھیں",
    keep_document_still: "دستاویز اور ڈیوائس کو ساکن رکھیں",
    move_closer: "اور قریب جائیں",
    move_farther: "اور دور جائیں",
    move_left: "بائیں جانب والے صفحے پر جائیں",
    move_right: "دائیں جانب والے صفحے پر جائیں",
    move_top: "اوپر والے صفحے پر جائیں",
    occluded: "دستاویز کو مکمل طور پر نمایاں رکھیں",
    scan_data_page: "دستاویز کے ڈیٹا صفحہ کو اسکین کریں",
    scan_last_page_barcode: "آخری صفحے سے بارکوڈ کو اسکین کریں",
    scan_left_page: "بائیں صفحے کو اسکین کریں",
    scan_right_page: "دائیں صفحے کو اسکین کریں",
    scan_the_back_side: "دستاویز کے پچھلے حصے کو اسکین کریں",
    scan_the_barcode: "بار کوڈ اسکین کریں",
    scan_the_front_side: "دستاویز کے سامنے والے حصے کو اسکین کریں",
    scan_top_page: "اوپری صفحے کو اسکین کریں",
    too_bright: "کم روشنی والی جگہ پر جائیں",
    too_dark: "زیادہ روشن جگہ پر جائیں",
    wrong_left: "بائیں صفحے پر جائیں",
    wrong_right: "دائیں صفحے پر جائیں",
    wrong_top: "اوپری صفحے پر جائیں",
  },
  help_button: { aria_label: "مدد", tooltip: "مدد چاہیے؟" },
  help_modal: {
    aria: "اسکیننگ میں مدد",
    back_btn: "پیچھے",
    blur: {
      details:
        "اسکین کرتے وقت فون اور دستاویز کو ساکن رکھنے کی کوشش کریں۔ ان میں سے کسی کو بھی حرکت دینے سے تصویر دھندلا سکتی ہے اور دستاویز پر موجود ڈیٹا پڑھنے کے قابل نہیں رہتا۔",
      details_desktop:
        "اسکین کرتے وقت ڈیوائس اور دستاویز کو ساکن رکھنے کی کوشش کریں۔ ان میں سے کسی کو بھی حرکت دینے سے تصویر دھندلا سکتی ہے اور دستاویز پر موجود ڈیٹا پڑھنے کے قابل نہیں رہتا۔",
      title: "اسکین کرتے وقت ساکن رہیں",
    },
    camera_lens: {
      details:
        "اپنے کیمرے کے لینز پر دھبوں یا گردوغبار کی جانچ کریں۔ گندا لینز حتمی تصویر کو دھندلا کر دیتا ہے، جس سے دستاویز کی تفصیلات پڑھنے کے قابل نہیں رہتیں اور ڈیٹا کامیابی سے اسکین نہیں ہو پاتا۔",
      title: "اپنے کیمرہ کے لینز کو صاف کریں",
    },
    done_btn: "ہو گیا",
    done_btn_aria: "اسکیننگ دوبارہ شروع کریں",
    lighting: {
      details:
        "براہِ راست تیز روشنی سے پرہیز کریں کیونکہ یہ دستاویز پر عکس ڈالتی ہے اور اس کے کچھ حصے پڑھنے کے قابل نہیں رہتے۔ اگر آپ خود دستاویز پر موجود ڈیٹا نہیں پڑھ سکتے تو یہ کیمرے پر بھی نظر نہیں آئے گا۔",
      title: "تیز روشنی سے بچیں",
    },
    next_btn: "اگلا",
    visibility: {
      details:
        "یقینی بنائیں کہ آپ اپنی انگلی سے دستاویز کے کسی حصے کو، خاص طور پر نچلی سطروں کو ڈھانپ نہیں رہے۔ اس کے علاوہ ہولوگرام کے عکس سے بھی بچیں جو دستاویز کے خانوں پر پڑ سکتا ہے۔",
      title: "تمام خانے نمایاں رکھیں",
    },
  },
  onboarding_modal: {
    aria: "اسکیننگ کی ہدایات",
    btn: "اسکیننگ شروع کریں",
    details:
      "یقینی بنائیں کہ دستاویز اچھی طرح روشن ہو۔ دستاویز کے تمام خانے کیمرہ اسکرین پر واضح نظر آنے چاہئیں۔",
    details_desktop:
      "یقینی بنائیں کہ آپ کا کیمرہ لینز صاف ہو اور دستاویز اچھی طرح روشن ہو۔ دستاویز کے تمام خانے کیمرہ اسکرین پر واضح نظر آنے چاہئیں۔",
    title: "تمام تفصیلات نمایاں رکھیں",
    title_desktop: "اسکین کرنے کے لیے تیار ہو جائیں",
  },
  sdk_aria: "دستاویز اسکین کرنے کی اسکرین",
  timeout_modal: {
    cancel_btn: "منسوخ کریں",
    details: "دستاویز پڑھنے میں ناکامی۔ براہ کرم دوبارہ کوشش کریں۔",
    retry_btn: "دوبارہ کوشش کریں",
    title: "اسکین ناکام رہا",
  },
} as const;
