/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for am.
 */
export default {
  document_filtered_modal: {
    details: "ሌላ ሰነድ ለመቃኘት ይሞክሩ።",
    title: "ሰነድ ተቀባይነት የለውም",
  },
  document_not_recognized_modal: {
    details: "ተቀባይነት ያለው ሰነድ የፊት ገፅን ይቃኙ።",
    title: "ሰነድ አልታወቀም",
  },
  error_modal: { cancel_btn: "ተወው", retry_btn: "እንደገና ይሞክሩ" },
  feedback_messages: {
    blur_detected: "ሰነድ እና ስልክ ጸንተው ይያዙ",
    camera_angle_too_steep: "ሰነዱን ከስልክ ጋር ትይዩ ይያዙት",
    document_scanned_aria: "ተሳክቷል! ሰነድ ተቃኝቷል",
    document_too_close_to_edge: "ራቅ ብለው ይሂዱ",
    face_photo_not_fully_visible: "የፊት ፎቶውን ሙሉ በሙሉ እንዲታይ ያድርጉ",
    flip_document: "ሰነዱን ይገልብጡት",
    flip_to_back_side: "ወደኋላ ገጽ ይገልብጡት",
    front_side_scanned_aria: "ተሳክቷል! የፊት ጎኑ ተቃኝቷል",
    glare_detected: "ነጸብራቅን ለማስወገድ ሰነድ ያዘንብሉት ወይም ያስወግዱት",
    keep_document_parallel: "ሰነዱን ከመሳሪያው ጋር ትይዩ ይያዙት",
    keep_still: "ቀጥ አድርገው ይያዙ",
    move_closer: "ይቅረቡ",
    move_farther: "ራቅ ብለው ይሂዱ",
    move_left: "በግራ በኩል ወዳለው ገጽ ይሂዱ",
    move_right: "በቀኝ በኩል ወዳለው ገጽ ይሂዱ",
    move_top: "ላይ ወዳለው ገጽ ይሂዱ",
    occluded: "ሰነዱን ሙሉ በሙሉ እንዲታይ ያድርጉ",
    scan_data_page: "የሰነዱ የመረጃ ገፅን ይቃኙ",
    scan_last_page_barcode: "ከመጨረሻው ገጽ የባር ኮዱን ይቃኙ",
    scan_left_page: "የግራውን ገጽ ይቃኙ",
    scan_right_page: "የቀኙን ገጽ ይቃኙ",
    scan_the_back_side: "የሰነዱ የኋላ ገፅን ይቃኙ",
    scan_the_barcode: "ባርኮዱን ይቃኙ",
    scan_the_barcode_side: "የሰነዱ የባር ኮድ ገፅን ይቃኙ",
    scan_the_front_side: "የሰነዱ የፊት ገፅን ይቃኙ",
    scan_the_mrz_side: "የሰነዱ የMRZ ገፅን ይቃኙ",
    scan_top_page: "የላይኛውን ገጽ ይቃኙ",
    too_bright: "አነስ ያለ ብርሃን ወዳለው ቦታ ይንቀሳቀሱ",
    too_dark: "ብሩህ ወደሆነ ቦታ ይንቀሳቀሱ",
    wrong_left: "ወደ ግራ ገጽ ይሂዱ",
    wrong_right: "ወደ ቀኝ ገጽ ይሂዱ",
    wrong_top: "ወደ ላይኛው ገጽ ተንቀሳቅስ",
  },
  help_button: { aria_label: "እገዛ", tooltip: "እርዳታ ይፈልጋሉ?" },
  help_modal: {
    aria: "የመቃኘት እገዛ",
    back_btn: "ተመለስ",
    barcode_only: {
      blur: {
        details:
          "በሚቃኙበት ጊዜ ስልኩን እና ካርዱን ጸንተው ይዘው ለማቆየት ይሞክሩ። አንዱን ማንቀሳቀስ ምስሉን ሊያደበዝዝ እና ባርኮዱን የማይነበብ እንዲሆን ያደርገዋል።",
        details_desktop:
          "እባክዎ ስካን በሚያደርጉበት ጊዜ እንቅስቃሴ አያድርጉ። መንቀሳቀስ ምስሉን ሊያደበዝዝ እና ባርኮዱን ለማንበብ አስቸጋሪ እንዲሆን ሊያደርገው ይችላል።",
        title: "በሚቃኙበት ጊዜ ሳይንቀሳቀሱ ይቆዩ",
        title_desktop: "በሚቃኙበት ጊዜ ሳይንቀሳቀሱ ይቆዩ",
      },
      camera_lens: {
        details_desktop:
          "የካሜራዎ ሌንሶች ቆሻሻ ወይም አቧራ እንዳይኖረው ይፈትሹ። የቆሸሹ ሌንሶች የመጨረሻው ምስል እንዲደበዝዝ ያደርጋሉ፣ ይህም ባርኮዱ እንዳይነበብ በማድረግ የተሳካ የውሂቡን ቅኝት ይከላከላል።",
        title_desktop: "የካሜራዎን ሌንሶች ያጽዱ",
      },
      lighting: {
        details:
          "ቀጥተኛና ኃይለኛ ብርሃን በባርኮዱ ላይ ነጸብራቅ ሊፈጥርና ለመቃኘት አስቸጋሪ ስለሚሆን፣ እባክዎ እንዲህ ዓይነቱን ብርሃን ያስወግዱ። ባርኮዱ ለእርስዎ በግልጽ የማይታይ ከሆነ፣ ካሜራውም ሊያነበው አይችልም።",
        details_desktop:
          "ቀጥተኛና ኃይለኛ ብርሃን በባርኮዱ ላይ ነጸብራቅ ሊፈጥርና ለመቃኘት አስቸጋሪ ስለሚሆን፣ እባክዎ እንዲህ ዓይነቱን ብርሃን ያስወግዱ። ባርኮዱ ለእርስዎ በግልጽ የማይታይ ከሆነ፣ ካሜራውም ሊያነበው አይችልም።",
        title: "ከአደገኛ ብርሃን ይጠንቀቁ",
        title_desktop: "ከአደገኛ ብርሃን ይጠንቀቁ",
      },
      visibility: {
        details:
          "ባርኮዱን በጣትዎ አለመሸፈንዎን ያረጋግጡ። እንዲሁም በባርኮዱ ላይ የሚያርፉና ለማንበብ አስቸጋሪ ሊያደርጉ የሚችሉ የብርሃን ነጸብራቆችን ያስወግዱ።",
        details_desktop:
          "ባርኮዱን በጣትዎ አለመሸፈንዎን ያረጋግጡ። እንዲሁም በባርኮዱ ላይ የሚያርፉና ለማንበብ አስቸጋሪ ሊያደርጉ የሚችሉ የብርሃን ነጸብራቆችን ያስወግዱ።",
        title: "ባር ኮዱ ሙሉ በሙሉ እንዲታይ ያድርጉ",
        title_desktop: "ባር ኮዱ ሙሉ በሙሉ እንዲታይ ያድርጉ",
      },
    },
    document_with_barcode: {
      blur: {
        details:
          "በሚቃኙበት ጊዜ ስልኩን እና ሰነዱን ጸንተው ይዘው ለማቆየት ይሞክሩ። አንዱን ማንቀሳቀስ ምስሉን ሊያደበዝዝ እና በሰነዱ ላይ ያለውን ውሂብ የማይነበብ እንዲሆን ያደርገዋል።",
        details_desktop:
          "በሚቃኙበት ጊዜ ጸንተው ይዘው ለማቆየት ይሞክሩ። አንዱን ማንቀሳቀስ ምስሉን ሊያደበዝዝ እና በሰነዱ ላይ ያለውን ውሂብ የማይነበብ እንዲሆን ያደርገዋል።",
        title: "በሚቃኙበት ጊዜ ሳይንቀሳቀሱ ይቆዩ",
        title_desktop: "በሚቃኙበት ጊዜ ሳይንቀሳቀሱ ይቆዩ",
      },
      camera_lens: {
        details_desktop:
          "የካሜራዎ ሌንሶች ቆሻሻ ወይም አቧራ መኖሩን ይፈትሹ። የቆሸሹ ሌንሶች የመጨረሻው ምስል እንዲደበዝዝ ያደርጋሉ፣ ይህም የሰነዱ ዝርዝሮች እንዳይነበቡ በማድረግ የተሳካ የውሂቡን ቅኝት ይከላከላል።",
        title_desktop: "የካሜራዎን ሌንሶች ያጽዱ",
      },
      lighting: {
        details:
          "ሰነዱ ላይ ስለሚያንፀባርቅ እና የሰነዱን ክፍሎች እንዳይነበብ ስለሚያደርግ ቀጥተኛ ኃይለኛ ብርሃንን ያስወግዱ፣ በሰነዱ ላይ ያለውን ውሂብ ማንበብ ካልቻሉ ለካሜራም የሚታይ አይሆንም።",
        details_desktop:
          "ሰነዱ ላይ ስለሚያንፀባርቅ እና የሰነዱን ክፍሎች እንዳይነበብ ስለሚያደርግ ቀጥተኛ ኃይለኛ ብርሃንን ያስወግዱ፣ በሰነዱ ላይ ያለውን ውሂብ ማንበብ ካልቻሉ ለካሜራም የሚታይ አይሆንም።",
        title: "ከአደገኛ ብርሃን ይጠንቀቁ",
        title_desktop: "ከአደገኛ ብርሃን ይጠንቀቁ",
      },
      visibility: {
        details:
          "ባርኮዱን በጣትዎ አለመሸፈንዎን ያረጋግጡ። እንዲሁም በባርኮዱ ላይ የሚያርፉና ለማንበብ አስቸጋሪ ሊያደርጉ የሚችሉ የብርሃን ነጸብራቆችን ያስወግዱ።",
        details_desktop:
          "ባርኮዱን በጣትዎ አለመሸፈንዎን ያረጋግጡ። እንዲሁም በባርኮዱ ላይ የሚያርፉና ለማንበብ አስቸጋሪ ሊያደርጉ የሚችሉ የብርሃን ነጸብራቆችን ያስወግዱ።",
        title: "ባር ኮዱ ሙሉ በሙሉ እንዲታይ ያድርጉ",
        title_desktop: "ባር ኮዱ ሙሉ በሙሉ እንዲታይ ያድርጉ",
      },
    },
    document_with_mrz: {
      blur: {
        details:
          "በሚቃኙበት ጊዜ ስልኩን እና ሰነዱን ጸንተው ይዘው ለማቆየት ይሞክሩ። አንዱን ማንቀሳቀስ ምስሉን ሊያደበዝዝ እና በሰነዱ ላይ ያለውን ውሂብ የማይነበብ እንዲሆን ያደርገዋል።",
        details_desktop:
          "በሚቃኙበት ጊዜ ጸንተው ይዘው ለማቆየት ይሞክሩ። አንዱን ማንቀሳቀስ ምስሉን ሊያደበዝዝ እና በሰነዱ ላይ ያለውን ውሂብ የማይነበብ እንዲሆን ያደርገዋል።",
        title: "በሚቃኙበት ጊዜ ሳይንቀሳቀሱ ይቆዩ",
        title_desktop: "በሚቃኙበት ጊዜ ሳይንቀሳቀሱ ይቆዩ",
      },
      camera_lens: {
        details_desktop:
          "የካሜራዎ ሌንሶች ቆሻሻ ወይም አቧራ መኖሩን ይፈትሹ። የቆሸሹ ሌንሶች የመጨረሻው ምስል እንዲደበዝዝ ያደርጋሉ፣ ይህም የሰነዱ ዝርዝሮች እንዳይነበቡ በማድረግ የተሳካ የውሂቡን ቅኝት ይከላከላል።",
        title_desktop: "የካሜራዎን ሌንሶች ያጽዱ",
      },
      lighting: {
        details:
          "ሰነዱ ላይ ስለሚያንፀባርቅ እና የሰነዱን ክፍሎች እንዳይነበብ ስለሚያደርግ ቀጥተኛ ኃይለኛ ብርሃንን ያስወግዱ፣ በሰነዱ ላይ ያለውን ውሂብ ማንበብ ካልቻሉ ለካሜራም የሚታይ አይሆንም።",
        details_desktop:
          "ሰነዱ ላይ ስለሚያንፀባርቅ እና የሰነዱን ክፍሎች እንዳይነበብ ስለሚያደርግ ቀጥተኛ ኃይለኛ ብርሃንን ያስወግዱ፣ በሰነዱ ላይ ያለውን ውሂብ ማንበብ ካልቻሉ ለካሜራም የሚታይ አይሆንም።",
        title: "ከአደገኛ ብርሃን ይጠንቀቁ",
        title_desktop: "ከአደገኛ ብርሃን ይጠንቀቁ",
      },
      visibility: {
        details:
          "MRZን በጣትዎ አለመሸፈንዎን ያረጋግጡ። እንዲሁም በMRZ ላይ የሚያርፉና ለማንበብ አስቸጋሪ ሊያደርጉ የሚችሉ የብርሃን ነጸብራቆችን ያስወግዱ።",
        details_desktop:
          "MRZን በጣትዎ አለመሸፈንዎን ያረጋግጡ። እንዲሁም በMRZ ላይ የሚያርፉና ለማንበብ አስቸጋሪ ሊያደርጉ የሚችሉ የብርሃን ነጸብራቆችን ያስወግዱ።",
        title: "MRZ ሙሉ በሙሉ እንዲታይ ያድርጉ",
        title_desktop: "MRZ ሙሉ በሙሉ እንዲታይ ያድርጉ",
      },
    },
    done_btn: "ተከናውኗል",
    done_btn_aria: "መቃኘት ቀጥል",
    full_document: {
      blur: {
        details:
          "በሚቃኙበት ጊዜ ስልኩን እና ሰነዱን ጸንተው ይዘው ለማቆየት ይሞክሩ። አንዱን ማንቀሳቀስ ምስሉን ሊያደበዝዝ እና በሰነዱ ላይ ያለውን ውሂብ የማይነበብ እንዲሆን ያደርገዋል።",
        details_desktop:
          "በሚቃኙበት ጊዜ ጸንተው ይዘው ለማቆየት ይሞክሩ። አንዱን ማንቀሳቀስ ምስሉን ሊያደበዝዝ እና በሰነዱ ላይ ያለውን ውሂብ የማይነበብ እንዲሆን ያደርገዋል።",
        title: "በሚቃኙበት ጊዜ ሳይንቀሳቀሱ ይቆዩ",
        title_desktop: "በሚቃኙበት ጊዜ ሳይንቀሳቀሱ ይቆዩ",
      },
      camera_lens: {
        details_desktop:
          "የካሜራዎ ሌንሶች ቆሻሻ ወይም አቧራ መኖሩን ይፈትሹ። የቆሸሹ ሌንሶች የመጨረሻው ምስል እንዲደበዝዝ ያደርጋሉ፣ ይህም የሰነዱ ዝርዝሮች እንዳይነበቡ በማድረግ የተሳካ የውሂቡን ቅኝት ይከላከላል።",
        title_desktop: "የካሜራዎን ሌንሶች ያጽዱ",
      },
      lighting: {
        details:
          "ሰነዱ ላይ ስለሚያንፀባርቅ እና የሰነዱን ክፍሎች እንዳይነበብ ስለሚያደርግ ቀጥተኛ ኃይለኛ ብርሃንን ያስወግዱ፣ በሰነዱ ላይ ያለውን ውሂብ ማንበብ ካልቻሉ ለካሜራም የሚታይ አይሆንም።",
        details_desktop:
          "ሰነዱ ላይ ስለሚያንፀባርቅ እና የሰነዱን ክፍሎች እንዳይነበብ ስለሚያደርግ ቀጥተኛ ኃይለኛ ብርሃንን ያስወግዱ፣ በሰነዱ ላይ ያለውን ውሂብ ማንበብ ካልቻሉ ለካሜራም የሚታይ አይሆንም።",
        title: "ከአደገኛ ብርሃን ይጠንቀቁ",
        title_desktop: "ከአደገኛ ብርሃን ይጠንቀቁ",
      },
      visibility: {
        details:
          "የታችኛውን መስመሮች ጨምሮ የሰነዱን ክፍሎች በጣት አለመሸፈንዎን ያረጋግጡ። እንዲሁም በሰነድ መስኮች ላይ የሚሄዱ የሆሎግራም ነጸብራቆችን ይመልከቱ።",
        details_desktop:
          "የታችኛውን መስመሮች ጨምሮ የሰነዱን ክፍሎች በጣት አለመሸፈንዎን ያረጋግጡ። እንዲሁም በሰነድ መስኮች ላይ የሚሄዱ የሆሎግራም ነጸብራቆችን ይመልከቱ።",
        title: "ሁሉንም መስኮች እንዲታዩ ያድርጉ",
        title_desktop: "ሁሉንም መስኮች እንዲታዩ ያድርጉ",
      },
    },
    next_btn: "ቀጣይ",
  },
  onboarding_modal: {
    aria: "የመጋኘት መመርያዎች",
    barcode_only: {
      details:
        "ባርኮድ (ተከታታይ ጥቁር መስመሮች ወይም አራት ማዕዘን ኮድ) ይፈልጉ። ካሜራዎን ወደ እሱ ያነጣጥሩ እና ሳያንቀሳቅሱ ይያዙ — የመቃኘት ሂደት በራሱ ይከናወናል።",
      details_desktop:
        "ባርኮድ ይፈልጉ (ተከታታይ ጥቁር መስመሮች ወይም አራት ማዕዘን ኮድ)። የካሜራ ሌንስዎ ንጹህ መሆኑን እና ባርኮዱ በደንብ ብርሃን እንደሚያገኝ ያረጋግጡ።",
      title: "ባርኮዱን ይፈልጉ እና ይቃኙ",
      title_desktop: "ሌንሱን ያጽዱ እና ባርኮዱን ይፈልጉ",
    },
    btn: "መቃኘት ጀምር",
    document_with_barcode: {
      details:
        "የተለያዩ የሰነድ አይነቶች የተለያየ የባርኮድ ቅርጽና መገኛ ቦታ ሊኖራቸው ይችላል። ባርኮድ መኖሩን ለማረጋገጥ የሰነዱን የፊትና የጀርባ ገጽ ይመልከቱ።",
      details_desktop:
        "ባርኮድን በሰነዱ ፊት እና ጀርባ ይፈልጉ። የካሜራ ሌንስዎ ንጹህ መሆኑን እና ሰነዱ በደንብ ብርሃን እንደሚያገኝ ያረጋግጡ።",
      title: "የሰነዱ የባርኮድ ገፅን ያግኙ",
      title_desktop: "ሌንሱን ያጽዱ እና ባርኮዱን ይፈልጉ",
    },
    document_with_mrz: {
      details:
        "በሰነዱ ፊት ወይም ጀርባ የታችኛው ክፍል ላይ፣ በ2 ወይም 3 መስመሮች የተከፈለና በቀስቶች (<< ወይም >>) የተለያየ ረጅም የቁምፊዎች ተርታ ያገኛሉ።",
      details_desktop:
        "MRZን በሰነዱ ፊት እና ጀርባ ይፈልጉ። በሰነዱ ታችኛው ክፍል 2–3 የቁምፊ መስመሮች እና የቀስት ምልክቶች (<<) ይፈልጉ። የካሜራ ሌንስዎ ንጹህ እና ሰነዱ በደንብ ብርሃን እንደሚያገኝ ያረጋግጡ።",
      title: "የሰነዱ የMRZ ገፅን ያግኙ",
      title_desktop: "ሌንሱን ያጽዱ እና MRZን ይፈልጉ",
    },
    full_document: {
      details:
        "ሰነዱ በቂ ብርሃን ማግኘቱን ያረጋግጡ። ሁሉም የሰነድ መስኮች በካሜራ ማያ ገጽ ላይ መታየት አለባቸው።",
      details_desktop:
        "የካሜራ ሌንስዎ ንጹህ መሆኑን እና ሰነዱ በቂ ብርሃን ማግኘቱን ያረጋግጡ። ሁሉም የሰነድ መስኮች በካሜራ ማያ ገጽ ላይ መታየት አለባቸው።",
      title: "ሁሉንም ዝርዝሮች እንዲታዩ ያድርጉ",
      title_desktop: "ለመቃኘት ዝግጁ ይሁኑ",
    },
  },
  sdk_aria: "የሰነድ ቅኝት ማያ ገጽ",
  timeout_modal: {
    details: "የሰነዱ ቦታ በቂ ብርሃን እንደሚያገኝ፣ በደንብ እንደሚታይና ነጸብራቅ እንደሌለበት ያረጋግጡ።",
    details_desktop:
      "የካሜራ ሌንስዎ ንጹህ መሆኑን፣ ሰነዱ ሙሉ በሙሉ የሚታይ፣ ትኩረት ያለው እና በደንብ ብርሃን እንደሚያገኝ ያረጋግጡ።",
    title: "ሰነዱን ማንበብ አልተቻለም",
  },
} as const;
