/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for bn.
 */
export default {
  document_filtered_modal: {
    details: "ভিন্ন ডকুমেন্ট স্ক্যান করার চেষ্টা করুন।",
    title: "ডকুমেন্ট গ্রহণযোগ্য নয়",
  },
  document_not_recognized_modal: {
    details: "সমর্থিত ডকুমেন্টের সামনের দিক স্ক্যান করুন",
    title: "ডকুমেন্ট সনাক্ত করা যায়নি",
  },
  error_modal: { cancel_btn: "বাতিল করুন", retry_btn: "পুনরায় চেষ্টা করুন" },
  feedback_messages: {
    blur_detected: "ডকুমেন্ট এবং ফোন স্থির রাখুন",
    camera_angle_too_steep: "ডকুমেন্টটি ফোনের সাথে সমান্তরাল রাখুন",
    document_scanned_aria: "সফল! ডকুমেন্ট স্ক্যান সম্পন্ন",
    document_too_close_to_edge: "আরও দূরে যান",
    face_photo_not_fully_visible: "ফেস ফটো সম্পূর্ণ দৃশ্যমান রাখুন",
    flip_document: "ডকুমেন্ট উল্টান",
    flip_to_back_side: "পিছনের দিকে উল্টান",
    front_side_scanned_aria: "সফল! সামনের দিকটি স্ক্যান হয়েছে",
    glare_detected: "প্রতিফলন দূর করতে ডকুমেন্টটি বাঁকান বা সরান",
    keep_document_parallel: "ডকুমেন্টটি স্ক্রীনের সাথে সমান্তরাল রাখুন",
    keep_document_still: "ডকুমেন্ট এবং ডিভাইস স্থির রাখুন",
    keep_still: "স্থির হয়ে থাকুন",
    move_closer: "আরও কাছে যান",
    move_farther: "আরও দূরে যান",
    move_left: "বাম পৃষ্ঠায় যান",
    move_right: "ডান পৃষ্ঠায় যান",
    move_top: "উপরের পৃষ্ঠায় যান",
    occluded: "ডকুমেন্টটি পুরোপুরি দৃশ্যমান রাখুন",
    scan_data_page: "ডকুমেন্টের ডেটা পৃষ্ঠা স্ক্যান করুন",
    scan_last_page_barcode: "শেষ পাতার বারকোডটি স্ক্যান করুন",
    scan_left_page: "বাম পৃষ্ঠা স্ক্যান করুন",
    scan_right_page: "ডান পৃষ্ঠা স্ক্যান করুন",
    scan_the_back_side: "ডকুমেন্টের পিছনের দিক স্ক্যান করুন",
    scan_the_barcode: "বারকোড স্ক্যান করুন",
    scan_the_barcode_side: "একটি নথির বারকোড থাকা দিকটি স্ক্যান করুন",
    scan_the_front_side: "ডকুমেন্টের সামনের দিক স্ক্যান করুন",
    scan_top_page: "উপরের পৃষ্ঠা স্ক্যান করুন",
    too_bright: "কম আলোযুক্ত স্থানে যান",
    too_dark: "উজ্জ্বল স্থানে যান",
    wrong_left: "বাম পৃষ্ঠায় যান",
    wrong_right: "ডান পৃষ্ঠায় যান",
    wrong_top: "উপরের পৃষ্ঠায় যান",
  },
  help_button: { aria_label: "সহায়তা", tooltip: "সাহায্য দরকার?" },
  help_modal: {
    aria: "স্ক্যান করতে সাহায্য",
    back_btn: "পেছনে",
    barcode_only: {
      blur: {
        details:
          "স্ক্যান করার সময় ফোন এবং বারকোড উভয়ই স্থির রাখার চেষ্টা করুন। এর যেকোনো একটি নড়াচড়া করলে ছবিটি ঝাপসা হয়ে যেতে পারে এবং বারকোডটি পড়া কঠিন হয়ে পড়তে পারে।",
        details_desktop:
          "স্ক্যান করার সময় স্থির থাকার চেষ্টা করুন। নড়াচড়া করলে ছবিটি ঝাপসা হয়ে যেতে পারে এবং বারকোডটি পড়া কঠিন হয়ে পড়তে পারে।",
        title: "স্ক্যান করার সময় স্থির থাকুন",
        title_desktop: "স্ক্যান করার সময় স্থির থাকুন",
      },
      camera_lens: {
        details_desktop:
          "আপনার ক্যামেরার লেন্সে কোনো দাগ বা ধুলো জমে আছে কি না, তা পরীক্ষা করুন। লেন্স অপরিষ্কার থাকলে চূড়ান্ত ছবিটি ঝাপসা হয়ে যায়, যার ফলে বারকোডটি অপঠনযোগ্য হয়ে পড়ে এবং ডেটা সফলভাবে স্ক্যান করা সম্ভব হয় না।",
        title_desktop: "আপনার ক্যামেরার লেন্স পরিষ্কার করুন",
      },
      lighting: {
        details:
          "সরাসরি ও তীব্র আলো এড়িয়ে চলুন, কারণ এটি বারকোডের ওপর তীব্র গ্লেয়ার তৈরি করতে পারে এবং স্ক্যান করা কঠিন করে তুলতে পারে। বারকোডটি যদি আপনার কাছে স্পষ্টভাবে দৃশ্যমান না হয়, তবে ক্যামেরাও সম্ভবত সেটি পড়তে পারবে না।",
        details_desktop:
          "সরাসরি ও তীব্র আলো এড়িয়ে চলুন, কারণ এটি বারকোডের ওপর তীব্র গ্লেয়ার তৈরি করতে পারে এবং স্ক্যান করা কঠিন করে তুলতে পারে। বারকোডটি যদি আপনার কাছে স্পষ্টভাবে দৃশ্যমান না হয়, তবে ক্যামেরাও সম্ভবত সেটি পড়তে পারবে না।",
        title: "তীব্র আলো এড়িয়ে চলুন",
        title_desktop: "তীব্র আলো এড়িয়ে চলুন",
      },
      visibility: {
        details:
          "নিশ্চিত করুন যেন আপনার আঙুল দিয়ে বারকোডের কোনো অংশ ঢেকে না যায়। এছাড়া, বারকোডের ওপর পড়া কোনো প্রতিবিম্ব বা আলোর ঝলকানির দিকেও খেয়াল রাখবেন কারণ এর ফলে বারকোডটি পাঠযোগ্যতা হারাতে পারে।",
        details_desktop:
          "নিশ্চিত করুন যেন আপনার আঙুল দিয়ে বারকোডের কোনো অংশ ঢেকে না যায়। এছাড়া, বারকোডের ওপর পড়া কোনো প্রতিবিম্ব বা আলোর ঝলকানির দিকেও খেয়াল রাখবেন কারণ এর ফলে বারকোডটি পাঠযোগ্যতা হারাতে পারে।",
        title: "বারকোডটি দৃশ্যমান রাখুন",
        title_desktop: "বারকোডটি দৃশ্যমান রাখুন",
      },
    },
    document_with_barcode: {
      blur: {
        details:
          "স্ক্যান করার সময় ফোন এবং ডকুমেন্ট উভয়ই স্থির রাখার চেষ্টা করুন। যেকোনো একটি নাড়াচাড়া করলে ছবি ঝাপসা হয়ে যাবে এবং ডকুমেন্টের তথ্য অপঠনীয় হয়ে যাবে।",
        details_desktop:
          "স্ক্যান করার সময় স্থির থাকার চেষ্টা করুন। নড়াচড়া করলে ছবিটি ঝাপসা হয়ে যেতে পারে এবং নথিতে থাকা তথ্য অপঠনযোগ্য হয়ে পড়তে পারে।",
        title: "স্ক্যান করার সময় স্থির থাকুন",
        title_desktop: "স্ক্যান করার সময় স্থির থাকুন",
      },
      camera_lens: {
        details_desktop:
          "আপনার ক্যামেরার লেন্সে ময়লা বা দাগ আছে কিনা পরীক্ষা করুন। লেন্স নোংরা হলে ছবিটি ঝাপসা হয়ে যায়, ফলে ডকুমেন্টের তথ্য পড়া যায় না এবং ডেটা সফলভাবে স্ক্যান করা সম্ভব হয় না।",
        title_desktop: "আপনার ক্যামেরার লেন্স পরিষ্কার করুন",
      },
      lighting: {
        details:
          "সরাসরি তীব্র আলো এড়িয়ে চলুন, কারণ এটি ডকুমেন্ট থেকে প্রতিফলিত হয়ে ডকুমেন্টের কিছু অংশ অপঠনীয় করে তুলতে পারে। যদি আপনি ডকুমেন্টের তথ্যগুলো পড়তে না পারেন, তাহলে ক্যামেরাও সেগুলো ধরতে পারবে না।",
        details_desktop:
          "সরাসরি তীব্র আলো এড়িয়ে চলুন, কারণ এটি ডকুমেন্ট থেকে প্রতিফলিত হয়ে ডকুমেন্টের কিছু অংশ অপঠনীয় করে তুলতে পারে। যদি আপনি ডকুমেন্টের তথ্যগুলো পড়তে না পারেন, তাহলে ক্যামেরাও সেগুলো ধরতে পারবে না।",
        title: "তীব্র আলো এড়িয়ে চলুন",
        title_desktop: "তীব্র আলো এড়িয়ে চলুন",
      },
      visibility: {
        details:
          "নিশ্চিত করুন যেন আপনার আঙুল দিয়ে বারকোডের কোনো অংশ ঢেকে না যায়। এছাড়া, বারকোডের ওপর পড়া কোনো প্রতিবিম্ব বা আলোর ঝলকানির দিকেও খেয়াল রাখবেন কারণ এর ফলে বারকোডটি পাঠযোগ্যতা হারাতে পারে।",
        details_desktop:
          "নিশ্চিত করুন যেন আপনার আঙুল দিয়ে বারকোডের কোনো অংশ ঢেকে না যায়। এছাড়া, বারকোডের ওপর পড়া কোনো প্রতিবিম্ব বা আলোর ঝলকানির দিকেও খেয়াল রাখবেন কারণ এর ফলে বারকোডটি পাঠযোগ্যতা হারাতে পারে।",
        title: "বারকোডটি দৃশ্যমান রাখুন",
        title_desktop: "বারকোডটি দৃশ্যমান রাখুন",
      },
    },
    done_btn: "সম্পন্ন",
    done_btn_aria: "স্ক্যানিং পুনরায় শুরু করুন",
    full_document: {
      blur: {
        details:
          "স্ক্যান করার সময় ফোন এবং ডকুমেন্ট উভয়ই স্থির রাখার চেষ্টা করুন। যেকোনো একটি নাড়াচাড়া করলে ছবি ঝাপসা হয়ে যাবে এবং ডকুমেন্টের তথ্য অপঠনীয় হয়ে যাবে।",
        details_desktop:
          "স্ক্যান করার সময় স্থির থাকার চেষ্টা করুন। নড়াচড়া করলে ছবিটি ঝাপসা হয়ে যেতে পারে এবং নথিতে থাকা তথ্য অপঠনযোগ্য হয়ে পড়তে পারে।",
        title: "স্ক্যান করার সময় স্থির থাকুন",
        title_desktop: "স্ক্যান করার সময় স্থির থাকুন",
      },
      camera_lens: {
        details_desktop:
          "আপনার ক্যামেরার লেন্সে ময়লা বা দাগ আছে কিনা পরীক্ষা করুন। লেন্স নোংরা হলে ছবিটি ঝাপসা হয়ে যায়, ফলে ডকুমেন্টের তথ্য পড়া যায় না এবং ডেটা সফলভাবে স্ক্যান করা সম্ভব হয় না।",
        title_desktop: "আপনার ক্যামেরার লেন্স পরিষ্কার করুন",
      },
      lighting: {
        details:
          "সরাসরি তীব্র আলো এড়িয়ে চলুন, কারণ এটি ডকুমেন্ট থেকে প্রতিফলিত হয়ে ডকুমেন্টের কিছু অংশ অপঠনীয় করে তুলতে পারে। যদি আপনি ডকুমেন্টের তথ্যগুলো পড়তে না পারেন, তাহলে ক্যামেরাও সেগুলো ধরতে পারবে না।",
        details_desktop:
          "সরাসরি তীব্র আলো এড়িয়ে চলুন, কারণ এটি ডকুমেন্ট থেকে প্রতিফলিত হয়ে ডকুমেন্টের কিছু অংশ অপঠনীয় করে তুলতে পারে। যদি আপনি ডকুমেন্টের তথ্যগুলো পড়তে না পারেন, তাহলে ক্যামেরাও সেগুলো ধরতে পারবে না।",
        title: "তীব্র আলো এড়িয়ে চলুন",
        title_desktop: "তীব্র আলো এড়িয়ে চলুন",
      },
      visibility: {
        details:
          "নিশ্চিত করুন যে আপনি আঙুল দিয়ে ডকুমেন্টের কোনো অংশ ঢাকছেন না, বিশেষ করে নিচের লাইনগুলো। এছাড়াও, ডকুমেন্ট ফিল্ডের উপর থাকা হোলোগ্রাম প্রতিফলনের দিকে খেয়াল রাখুন।",
        details_desktop:
          "নিশ্চিত করুন যে আপনি আঙুল দিয়ে ডকুমেন্টের কোনো অংশ ঢাকছেন না, বিশেষ করে নিচের লাইনগুলো। এছাড়াও, ডকুমেন্ট ফিল্ডের উপর থাকা হোলোগ্রাম প্রতিফলনের দিকে খেয়াল রাখুন।",
        title: "সমস্ত ফিল্ড দৃশ্যমান রাখুন",
        title_desktop: "সমস্ত ফিল্ড দৃশ্যমান রাখুন",
      },
    },
    next_btn: "পরবর্তী",
  },
  onboarding_modal: {
    aria: "স্ক্যান করার নির্দেশাবলী",
    barcode_only: {
      details:
        "একটি বারকোড (কালো রেখার সারি বা একটি বর্গাকার কোড) খুঁজুন। সেটির দিকে আপনার ক্যামেরা তাক করুন এবং স্থির হয়ে থাকুন—স্ক্যানিং স্বয়ংক্রিয়ভাবে সম্পন্ন হবে।",
      details_desktop:
        "একটি বারকোড খুঁজুন (কালো রেখার সারি বা একটি বর্গাকার কোড)। নিশ্চিত করুন যেন আপনার ক্যামেরার লেন্সটি পরিষ্কার থাকে এবং বারকোডটিতে পর্যাপ্ত আলো পড়ে।",
      title: "বারকোডটি খুঁজে বের করুন এবং স্ক্যান করুন",
      title_desktop: "আপনার লেন্সটি পরিষ্কার করুন এবং বারকোডটি খুঁজে বের করুন",
    },
    btn: "স্ক্যান শুরু করুন",
    document_with_barcode: {
      details:
        "বিভিন্ন ধরণের আইডিতে ভিন্ন বারকোডের ফরম্যাট ও অবস্থান থাকতে পারে। বারকোডটি খুঁজে পেতে আইডির সামনের ও পেছনের দিকটি দেখুন।",
      details_desktop:
        "আইডির সামনের ও পেছনের অংশে বারকোড আছে কি না, তা পরীক্ষা করুন। নিশ্চিত করুন যেন আপনার ক্যামেরার লেন্সটি পরিষ্কার থাকে এবং নথিপত্রটি পর্যাপ্ত আলোতে থাকে।",
      title: "আইডিতে বারকোডটি খুঁজুন",
      title_desktop: "আপনার লেন্সটি পরিষ্কার করুন এবং বারকোডটি খুঁজে বের করুন",
    },
    full_document: {
      details:
        "নিশ্চিত করুন যে আপনার ডকুমেন্টটি ভালোভাবে আলোকিত আছে। ক্যামেরার স্ক্রিনে ডকুমেন্টের সমস্ত তথ্য স্পষ্টভাবে দৃশ্যমান হবে।",
      details_desktop:
        "ক্যামেরার লেন্স পরিষ্কার রাখুন এবং নিশ্চিত করুন যে আপনার ডকুমেন্টটি ভালোভাবে আলোকিত আছে। ক্যামেরার স্ক্রিনে ডকুমেন্টের সমস্ত তথ্য স্পষ্টভাবে দৃশ্যমান হবে।",
      title: "সমস্ত বিবরণ দৃশ্যমান রাখুন",
      title_desktop: "স্ক্যান করার জন্য প্রস্তুত হন",
    },
  },
  sdk_aria: "ডকুমেন্ট স্ক্যান করার স্ক্রীন",
  timeout_modal: {
    details: "ডকুমেন্টটি পড়া যাচ্ছে না। অনুগ্রহ করে পুনরায় চেষ্টা করুন।",
    title: "স্ক্যান ব্যর্থ হয়েছে",
  },
} as const;
