/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for el.
 */
export default {
  document_filtered_modal: {
    details: "Δοκιμάστε να σαρώσετε ένα διαφορετικό έγγραφο.",
    title: "Το έγγραφο δεν έγινε δεκτό",
  },
  document_not_recognized_modal: {
    details: "Σαρώστε την μπροστινή όψη ενός υποστηριζόμενου εγγράφου.",
    title: "Το έγγραφο δεν αναγνωρίστηκε",
  },
  error_modal: { cancel_btn: "Ακύρωση", retry_btn: "Επανάληψη" },
  feedback_messages: {
    blur_detected: "Κρατήστε το έγγραφο και το τηλέφωνο ακίνητα",
    camera_angle_too_steep: "Κρατήστε το έγγραφο παράλληλα με το τηλέφωνο",
    document_scanned_aria: "Επιτυχία! Το έγγραφο σαρώθηκε",
    document_too_close_to_edge: "Απομακρυνθείτε",
    face_photo_not_fully_visible:
      "Φροντίστε τη φωτογραφία προσώπου να είναι πλήρως ορατή",
    flip_document: "Αναποδογυρίστε το έγγραφο",
    flip_to_back_side: "Γυρίστε στην πίσω όψη",
    front_side_scanned_aria: "Επιτυχία! Σαρώθηκε η μπροστινή πλευρά",
    glare_detected:
      "Γείρετε ή μετακινήστε το έγγραφο για να αφαιρέσετε την αντανάκλαση",
    keep_document_parallel: "Κρατήστε το έγγραφο παράλληλα με την οθόνη",
    keep_document_still: "Κρατήστε το έγγραφο και τη συσκευή ακίνητα",
    keep_still: "Κρατήστε την κάμερα ακίνητη",
    move_closer: "Πλησιάστε",
    move_farther: "Απομακρυνθείτε",
    move_left: "Προχωρήστε στη σελίδα στα αριστερά",
    move_right: "Προχω΄ρηστε στη σελίδα στα δεξιά",
    move_top: "Προχωρήστε στην πρώτη σελίδα",
    occluded: "Φροντίστε το έγγραφο να είναι πλήρως ορατό",
    scan_data_page: "Σαρώστε τη σελίδα δεδομένων του εγγράφου",
    scan_last_page_barcode: "Σάρωση γραμμωτού κώδικα από την τελευταία σελίδα",
    scan_left_page: "Σαρώστε την αριστερή σελίδα",
    scan_right_page: "Σαρώστε τη δεξιά σελίδα",
    scan_the_back_side: "Σαρώστε την πίσω όψη του εγγράφου",
    scan_the_barcode: "Σαρώστε τον γραμμωτό κώδικα",
    scan_the_barcode_side:
      "Σαρώστε την όψη του εγγράφου που περιέχει τον γραμμωτό κώδικα",
    scan_the_front_side: "Σαρώστε την μπροστινή όψη του εγγράφου",
    scan_top_page: "Σαρώστε την πρώτη σελίδα",
    too_bright: "Μετακινηθείτε σε σημείο με λιγότερο φωτισμό",
    too_dark: "Μετακινηθείτε σε πιο φωτεινό σημείο",
    wrong_left: "Προχωρήστε στην αριστερή σελίδα",
    wrong_right: "Προχωρήστε στη δεξιά σελίδα",
    wrong_top: "Προχωρήστε στην πρώτη σελίδα",
  },
  help_button: { aria_label: "Βοήθεια", tooltip: "Χρειάζεστε βοήθεια;" },
  help_modal: {
    aria: "Βοήθεια για τη σάρωση",
    back_btn: "Πίσω",
    barcode_only: {
      blur: {
        details:
          "Προσπαθήστε να κρατήσετε το τηλέφωνο και τον γραμμωτό κώδικα ακίνητα κατά τη σάρωση. Η μετακίνηση οποιουδήποτε από τα δύο μπορεί να θολώσει την εικόνα και να καταστήσει τον γραμμωτό κώδικα δυσανάγνωστο.",
        details_desktop:
          "Προσπαθήστε να μείνετε ακίνητοι κατά τη σάρωση. Οποιαδήποτε κίνηση μπορεί να θολώσει την εικόνα και να καταστήσει τον γραμμωτό κώδικα δυσανάγνωστο.",
        title: "Μείνετε ακίνητοι κατά τη σάρωση",
        title_desktop: "Μείνετε ακίνητοι κατά τη σάρωση",
      },
      camera_lens: {
        details_desktop:
          "Ελέγξτε τον φακό της κάμεράς σας για λεκέδες ή σκόνη. Ένας βρώμικος φακός προκαλεί θάμπωμα της τελικής εικόνας, καθιστώντας τον γραμμωτό κώδικα δυσανάγνωστο και εμποδίζοντας την επιτυχή σάρωση των δεδομένων.",
        title_desktop: "Καθαρίστε τον φακό της κάμεράς σας",
      },
      lighting: {
        details:
          "Αποφύγετε το άμεσο, έντονο φως, επειδή μπορεί να δημιουργήσει αντανάκλαση στον γραμμωτό κώδικα και να καταστήσει δύσκολη τη σάρωσή του. Αν δεν μπορείτε να δείτε καθαρά των κώδικα, δεν θα είναι αναγνώσιμος και από την κάμερα.",
        details_desktop:
          "Αποφύγετε το άμεσο, έντονο φως, επειδή μπορεί να δημιουργήσει αντανάκλαση στον γραμμωτό κώδικα και να καταστήσει δύσκολη τη σάρωσή του. Αν δεν μπορείτε να δείτε καθαρά των κώδικα, δεν θα είναι αναγνώσιμος και από την κάμερα.",
        title: "Προσέξτε το έντονο φως",
        title_desktop: "Προσέξτε το έντονο φως",
      },
      visibility: {
        details:
          "Βεβαιωθείτε ότι δεν καλύπτετε μέρη της κάρτας με το δάχτυλό σας, Επίσης, προσέξτε τις αντανακλάσεις που καλύπτουν τον γραμμωτό κώδικα και μπορεί να τον καταστήσουν μη αναγνώσιμο.",
        details_desktop:
          "Βεβαιωθείτε ότι δεν καλύπτετε μέρη της κάρτας με το δάχτυλό σας, Επίσης, προσέξτε τις αντανακλάσεις που καλύπτουν τον γραμμωτό κώδικα και μπορεί να τον καταστήσουν μη αναγνώσιμο.",
        title: "Φροντίστε να είναι ορατός ο κώδικας",
        title_desktop: "Φροντίστε να είναι ορατός ο κώδικας",
      },
    },
    document_with_barcode: {
      blur: {
        details:
          "Προσπαθήστε να κρατήσετε το τηλέφωνο και το έγγραφο ακίνητα κατά τη σάρωση. Η μετακίνηση οποιουδήποτε από τα δύο μπορεί να θολώσει την εικόνα και να καταστήσει τα δεδομένα στο έγγραφο δυσανάγνωστα.",
        details_desktop:
          "Προσπαθήστε να μείνετε ακίνητοι κατά τη σάρωση. Οποιαδήποτε κίνηση μπορεί να θολώσει την εικόνα και να καταστήσει τα δεδομένα του εγγράφου δυσανάγνωστα.",
        title: "Μείνετε ακίνητοι κατά τη σάρωση",
        title_desktop: "Μείνετε ακίνητοι κατά τη σάρωση",
      },
      camera_lens: {
        details_desktop:
          "Ελέγξτε τον φακό της κάμεράς σας για λεκέδες ή σκόνη. Ένας βρώμικος φακός προκαλεί θάμπωμα της τελικής εικόνας, καθιστώντας τα στοιχεία του εγγράφου δυσανάγνωστα και εμποδίζοντας την επιτυχή σάρωση των δεδομένων.",
        title_desktop: "Καθαρίστε τον φακό της κάμεράς σας",
      },
      lighting: {
        details:
          "Αποφύγετε το άμεσο, έντονο φως, επειδή αντανακλάται από το έγγραφο και μπορεί να κάνει ορισμένα μέρη του εγγράφου δυσανάγνωστα. Εάν δεν μπορείτε να διαβάσετε δεδομένα στο έγγραφο, δεν θα είναι ορατά ούτε στην κάμερα.",
        details_desktop:
          "Αποφύγετε το άμεσο, έντονο φως, επειδή αντανακλάται από το έγγραφο και μπορεί να κάνει ορισμένα μέρη του εγγράφου δυσανάγνωστα. Εάν δεν μπορείτε να διαβάσετε δεδομένα στο έγγραφο, δεν θα είναι ορατά ούτε στην κάμερα.",
        title: "Προσέξτε το έντονο φως",
        title_desktop: "Προσέξτε το έντονο φως",
      },
      visibility: {
        details:
          "Βεβαιωθείτε ότι δεν καλύπτετε μέρη της κάρτας με το δάχτυλό σας, Επίσης, προσέξτε τις αντανακλάσεις που καλύπτουν τον γραμμωτό κώδικα και μπορεί να τον καταστήσουν μη αναγνώσιμο.",
        details_desktop:
          "Βεβαιωθείτε ότι δεν καλύπτετε μέρη της κάρτας με το δάχτυλό σας, Επίσης, προσέξτε τις αντανακλάσεις που καλύπτουν τον γραμμωτό κώδικα και μπορεί να τον καταστήσουν μη αναγνώσιμο.",
        title: "Φροντίστε να είναι ορατός ο κώδικας",
        title_desktop: "Φροντίστε να είναι ορατός ο κώδικας",
      },
    },
    done_btn: "Τέλος",
    done_btn_aria: "Συνέχιση σάρωσης",
    full_document: {
      blur: {
        details:
          "Προσπαθήστε να κρατήσετε το τηλέφωνο και το έγγραφο ακίνητα κατά τη σάρωση. Η μετακίνηση οποιουδήποτε από τα δύο μπορεί να θολώσει την εικόνα και να καταστήσει τα δεδομένα στο έγγραφο δυσανάγνωστα.",
        details_desktop:
          "Προσπαθήστε να μείνετε ακίνητοι κατά τη σάρωση. Οποιαδήποτε κίνηση μπορεί να θολώσει την εικόνα και να καταστήσει τα δεδομένα του εγγράφου δυσανάγνωστα.",
        title: "Μείνετε ακίνητοι κατά τη σάρωση",
        title_desktop: "Μείνετε ακίνητοι κατά τη σάρωση",
      },
      camera_lens: {
        details_desktop:
          "Ελέγξτε τον φακό της κάμεράς σας για λεκέδες ή σκόνη. Ένας βρώμικος φακός προκαλεί θάμπωμα της τελικής εικόνας, καθιστώντας τα στοιχεία του εγγράφου δυσανάγνωστα και εμποδίζοντας την επιτυχή σάρωση των δεδομένων.",
        title_desktop: "Καθαρίστε τον φακό της κάμεράς σας",
      },
      lighting: {
        details:
          "Αποφύγετε το άμεσο, έντονο φως, επειδή αντανακλάται από το έγγραφο και μπορεί να κάνει ορισμένα μέρη του εγγράφου δυσανάγνωστα. Εάν δεν μπορείτε να διαβάσετε δεδομένα στο έγγραφο, δεν θα είναι ορατά ούτε στην κάμερα.",
        details_desktop:
          "Αποφύγετε το άμεσο, έντονο φως, επειδή αντανακλάται από το έγγραφο και μπορεί να κάνει ορισμένα μέρη του εγγράφου δυσανάγνωστα. Εάν δεν μπορείτε να διαβάσετε δεδομένα στο έγγραφο, δεν θα είναι ορατά ούτε στην κάμερα.",
        title: "Προσέξτε το έντονο φως",
        title_desktop: "Προσέξτε το έντονο φως",
      },
      visibility: {
        details:
          "Βεβαιωθείτε ότι δεν καλύπτετε μέρη του εγγράφου με το δάχτυλό σας, συμπεριλαμβανομένων των κάτω γραμμών. Επίσης, προσέξτε τις αντανακλάσεις ολογράμματος που καλύπτουν τα πεδία του εγγράφου.",
        details_desktop:
          "Βεβαιωθείτε ότι δεν καλύπτετε μέρη του εγγράφου με το δάχτυλό σας, συμπεριλαμβανομένων των κάτω γραμμών. Επίσης, προσέξτε τις αντανακλάσεις ολογράμματος που καλύπτουν τα πεδία του εγγράφου.",
        title: "Φροντίστε όλα τα πεδία να είναι ορατά",
        title_desktop: "Φροντίστε όλα τα πεδία να είναι ορατά",
      },
    },
    next_btn: "Επόμενο",
  },
  onboarding_modal: {
    aria: "Οδηγίες σάρωσης",
    barcode_only: {
      details:
        "Εντοπίστε τον γραμμωτό κώδικα (μια σειρά μαύρων γραμμών ή έναν τετράγωνο κώδικα). Στρέψτε την κάμερα προς αυτόν και κρατήστε τη σταθερή. Η σάρωση θα γίνει αυτόματα.",
      details_desktop:
        "Εντοπίστε τον γραμμωτό κώδικα (μια σειρά μαύρων γραμμών ή έναν τετράγωνο κώδικα). Βεβαιωθείτε ότι ο φακός της κάμερας είναι καθαρός και ο γραμμωτός κώδικας καλά φωτισμένος.",
      title: "Εντοπίστε και σαρώστε τον γραμμωτό κώδικα",
      title_desktop: "Καθαρίστε τον φακό και εντοπίστε τον γραμμωτό κώδικα",
    },
    btn: "Έναρξη σάρωσης",
    document_with_barcode: {
      details:
        "Διαφορετικοί τύποι εγγράφων ταυτότητας ενδέχεται να περιέχουν διαφορετική μορφή και θέση γραμμωτών κωδικών. Κοιτάξτε στην μπροστινή και την πίσω όψη της ταυτότητας για τον γραμμωτό κώδικα.",
      details_desktop:
        "Ελέγξτε την μπροστινή και την πίσω πλευρά της ταυτότητας για γραμμωτό κώδικα. Βεβαιωθείτε ότι ο φακός της κάμερας είναι καθαρός και το έγγραφο καλά φωτισμένο.",
      title: "Εντοπίστε τον γραμμωτό κώδικα στην ταυτότητα",
      title_desktop: "Καθαρίστε τον φακό και εντοπίστε τον γραμμωτό κώδικα",
    },
    full_document: {
      details:
        "Φροντίστε το έγγραφο να είναι καλά φωτισμένο. Όλα τα πεδία του εγγράφου θα πρέπει να είναι ορατά στην οθόνη της κάμερας.",
      details_desktop:
        "Φροντίστε ο φακός της κάμεράς σας να είναι καθαρός και το έγγραφο να είναι καλά φωτισμένο. Όλα τα πεδία του εγγράφου θα πρέπει να είναι ορατά στην οθόνη της κάμερας.",
      title: "Φροντίστε όλες οι λεπτομέρειες να είναι ορατές",
      title_desktop: "Ετοιμαστείτε για τη σάρωση",
    },
  },
  sdk_aria: "Οθόνη σάρωσης εγγράφου",
  timeout_modal: {
    details: "Δεν είναι δυνατή η ανάγνωση του εγγράφου. Δοκιμάστε ξανά.",
    title: "Η σάρωση ήταν ανεπιτυχής.",
  },
} as const;
