/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for fa-latn.
 */
export default {
  document_filtered_modal: {
    details: "سعی کنید سند دیگری را اسکن کنید.",
    title: "سند پذیرفته نشد",
  },
  document_not_recognized_modal: {
    details: "قسمت جلوی یک سند پشتیبانی شده را اسکن کنید.",
    title: "سند شناسایی نشده است",
  },
  error_modal: { cancel_btn: "لغو", retry_btn: "دوباره امتحان کنید" },
  feedback_messages: {
    blur_detected: "سند و تلفن را ثابت نگه دارید",
    camera_angle_too_steep: "سند را به صورت موازی با تلفن نگه دارید",
    document_scanned_aria: "با موفقیت اسکن شد! سند اسکن شد",
    document_too_close_to_edge: "دورتر حرکت کن",
    face_photo_not_fully_visible: "عکس چهره را کاملاً قابل مشاهده نگه دارید",
    flip_document: "سند را ورق بزنید",
    flip_to_back_side: "به سمت عقب برگردانید",
    front_side_scanned_aria: "با موفقیت اسکن از جلو انجام شد!",
    glare_detected: "برای حذف انعکاس، سند را کج یا جابجا کنید",
    keep_document_parallel: "سند را موازی با صفحه نمایش نگه دارید",
    keep_document_still: "سند و دستگاه را ثابت نگه دارید",
    keep_still: "بی‌حرکت بمانید",
    move_closer: "نزدیکتر حرکت کن",
    move_farther: "دورتر حرکت کن",
    move_left: "به صفحه سمت چپ منتقل شوید",
    move_right: "به صفحه سمت راست منتقل شوید",
    move_top: "انتقال به صفحه بالا",
    occluded: "سند را کاملاً قابل مشاهده نگه دارید",
    scan_data_page: "صفحه داده سند را اسکن کنید",
    scan_last_page_barcode: "اسکن بارکد از آخرین صفحه",
    scan_left_page: "صفحه سمت چپ را اسکن کنید",
    scan_right_page: "صفحه سمت راست را اسکن کنید",
    scan_the_back_side: "پشت سند را اسکن کنید",
    scan_the_barcode: "بارکد را اسکن کنید",
    scan_the_barcode_side: "اسکن بارکد سمت یک سند",
    scan_the_front_side: "از قسمت جلوی سند اسکن بگیرید",
    scan_top_page: "اسکن صفحه بالا",
    too_bright: "به نقطه‌ای با نور کمتر بروید",
    too_dark: "به نقطه روشن‌تر نقل مکان کنید",
    wrong_left: "انتقال به صفحه سمت چپ",
    wrong_right: "انتقال به صفحه سمت راست",
    wrong_top: "انتقال به صفحه بالا",
  },
  help_button: { aria_label: "کمک", tooltip: "به کمک نیاز دارید؟" },
  help_modal: {
    aria: "کمک در اسکن",
    back_btn: "برگشت",
    barcode_only: {
      blur: {
        details:
          "سعی کنید هنگام اسکن، گوشی و بارکد را ثابت نگه دارید. حرکت دادن هر دو می‌تواند تصویر را تار کند و خواندن بارکد را دشوار کند.",
        details_desktop:
          "سعی کنید هنگام اسکن ثابت بمانید. حرکت می‌تواند تصویر را تار کند و خواندن بارکد را دشوار کند.",
        title: "هنگام اسکن کردن بی‌حرکت بمانید",
        title_desktop: "هنگام اسکن کردن بی‌حرکت بمانید",
      },
      camera_lens: {
        details_desktop:
          "لنز دوربین خود را از نظر لکه یا گرد و غبار بررسی کنید. لنز کثیف باعث تار شدن تصویر نهایی می‌شود و بارکد را غیرقابل خواندن می‌کند و مانع از اسکن موفقیت‌آمیز داده‌ها می‌شود.",
        title_desktop: "لنز دوربین خود را تمیز کنید",
      },
      lighting: {
        details:
          "از نور مستقیم و شدید اجتناب کنید زیرا می‌تواند باعث ایجاد تابش خیره‌کننده روی بارکد شود و اسکن آن را دشوار کند. اگر بارکد برای شما به وضوح قابل مشاهده نباشد، ممکن است دوربین نیز نتواند آن را بخواند.",
        details_desktop:
          "از نور مستقیم و شدید اجتناب کنید زیرا می‌تواند باعث ایجاد تابش خیره‌کننده روی بارکد شود و اسکن آن را دشوار کند. اگر بارکد برای شما به وضوح قابل مشاهده نباشد، ممکن است دوربین نیز نتواند آن را بخواند.",
        title: "مراقب نور شدید باشید",
        title_desktop: "مراقب نور شدید باشید",
      },
      visibility: {
        details:
          "مطمئن شوید که قسمت‌هایی از بارکد را با انگشت خود نمی‌پوشانید. همچنین، مراقب انعکاس‌هایی باشید که از بارکد عبور می‌کنند و می‌توانند آن را غیرقابل خواندن کنند.",
        details_desktop:
          "مطمئن شوید که قسمت‌هایی از بارکد را با انگشت خود نمی‌پوشانید. همچنین، مراقب انعکاس‌هایی باشید که از بارکد عبور می‌کنند و می‌توانند آن را غیرقابل خواندن کنند.",
        title: "بارکد را قابل مشاهده نگه دارید",
        title_desktop: "بارکد را قابل مشاهده نگه دارید",
      },
    },
    document_with_barcode: {
      blur: {
        details:
          "سعی کنید هنگام اسکن، گوشی و سند را ثابت نگه دارید. حرکت دادن هر یک از آنها می‌تواند تصویر را تار کند و داده‌های روی سند را غیرقابل خواندن کند.",
        details_desktop:
          "سعی کنید هنگام اسکن کردن بی‌حرکت بمانید. حرکت می‌تواند تصویر را تار کند و داده‌های روی سند را غیرقابل خواندن کند.",
        title: "هنگام اسکن کردن بی‌حرکت بمانید",
        title_desktop: "هنگام اسکن کردن بی‌حرکت بمانید",
      },
      camera_lens: {
        details_desktop:
          "لنز دوربین خود را از نظر لکه یا گرد و غبار بررسی کنید. لنز کثیف باعث تار شدن تصویر نهایی می‌شود و جزئیات سند را غیرقابل خواندن می‌کند و مانع از اسکن موفقیت‌آمیز داده‌ها می‌شود.",
        title_desktop: "لنز دوربین خود را تمیز کنید",
      },
      lighting: {
        details:
          "از نور مستقیم و شدید پرهیز کنید زیرا از سند منعکس می‌شود و می‌تواند بخش‌هایی از سند را غیرقابل خواندن کند. اگر نتوانید داده‌های روی سند را بخوانید، برای دوربین نیز قابل مشاهده نخواهد بود.",
        details_desktop:
          "از نور مستقیم و شدید پرهیز کنید زیرا از سند منعکس می‌شود و می‌تواند بخش‌هایی از سند را غیرقابل خواندن کند. اگر نتوانید داده‌های روی سند را بخوانید، برای دوربین نیز قابل مشاهده نخواهد بود.",
        title: "مراقب نور شدید باشید",
        title_desktop: "مراقب نور شدید باشید",
      },
      visibility: {
        details:
          "مطمئن شوید که قسمت‌هایی از بارکد را با انگشت خود نمی‌پوشانید. همچنین، مراقب انعکاس‌هایی باشید که از بارکد عبور می‌کنند و می‌توانند آن را غیرقابل خواندن کنند.",
        details_desktop:
          "مطمئن شوید که قسمت‌هایی از بارکد را با انگشت خود نمی‌پوشانید. همچنین، مراقب انعکاس‌هایی باشید که از بارکد عبور می‌کنند و می‌توانند آن را غیرقابل خواندن کنند.",
        title: "بارکد را قابل مشاهده نگه دارید",
        title_desktop: "بارکد را قابل مشاهده نگه دارید",
      },
    },
    done_btn: "انجام شد",
    done_btn_aria: "اسکن را از سر بگیرید",
    full_document: {
      blur: {
        details:
          "سعی کنید هنگام اسکن، گوشی و سند را ثابت نگه دارید. حرکت دادن هر یک از آنها می‌تواند تصویر را تار کند و داده‌های روی سند را غیرقابل خواندن کند.",
        details_desktop:
          "سعی کنید هنگام اسکن کردن بی‌حرکت بمانید. حرکت می‌تواند تصویر را تار کند و داده‌های روی سند را غیرقابل خواندن کند.",
        title: "هنگام اسکن کردن بی‌حرکت بمانید",
        title_desktop: "هنگام اسکن کردن بی‌حرکت بمانید",
      },
      camera_lens: {
        details_desktop:
          "لنز دوربین خود را از نظر لکه یا گرد و غبار بررسی کنید. لنز کثیف باعث تار شدن تصویر نهایی می‌شود و جزئیات سند را غیرقابل خواندن می‌کند و مانع از اسکن موفقیت‌آمیز داده‌ها می‌شود.",
        title_desktop: "لنز دوربین خود را تمیز کنید",
      },
      lighting: {
        details:
          "از نور مستقیم و شدید پرهیز کنید زیرا از سند منعکس می‌شود و می‌تواند بخش‌هایی از سند را غیرقابل خواندن کند. اگر نتوانید داده‌های روی سند را بخوانید، برای دوربین نیز قابل مشاهده نخواهد بود.",
        details_desktop:
          "از نور مستقیم و شدید پرهیز کنید زیرا از سند منعکس می‌شود و می‌تواند بخش‌هایی از سند را غیرقابل خواندن کند. اگر نتوانید داده‌های روی سند را بخوانید، برای دوربین نیز قابل مشاهده نخواهد بود.",
        title: "مراقب نور شدید باشید",
        title_desktop: "مراقب نور شدید باشید",
      },
      visibility: {
        details:
          "مطمئن شوید که بخش‌هایی از سند، از جمله خطوط پایین، را با انگشت خود نمی‌پوشانید. همچنین، مراقب بازتاب‌های هولوگرام باشید که از روی قسمت‌های سند عبور می‌کنند.",
        details_desktop:
          "مطمئن شوید که بخش‌هایی از سند، از جمله خطوط پایین، را با انگشت خود نمی‌پوشانید. همچنین، مراقب بازتاب‌های هولوگرام باشید که از روی قسمت‌های سند عبور می‌کنند.",
        title: "همه فیلدها را قابل مشاهده نگه دارید",
        title_desktop: "همه فیلدها را قابل مشاهده نگه دارید",
      },
    },
    next_btn: "بعدی",
  },
  onboarding_modal: {
    aria: "دستورالعمل‌های اسکن",
    barcode_only: {
      details:
        "به دنبال یک بارکد (یک سری خطوط سیاه یا یک کد مربعی) بگردید. دوربین خود را به سمت آن بگیرید و ثابت نگه دارید - اسکن به طور خودکار انجام می‌شود.",
      details_desktop:
        "به دنبال بارکد (یک سری خطوط سیاه یا یک کد مربعی) باشید. مطمئن شوید که لنز دوربین خود را تمیز نگه داشته‌اید و بارکد به خوبی روشن است.",
      title: "بارکد را پیدا کنید و اسکن کنید",
      title_desktop: "لنز خود را تمیز کنید و بارکد را پیدا کنید",
    },
    btn: "شروع اسکن",
    document_with_barcode: {
      details:
        "انواع مختلف کارت‌های شناسایی ممکن است قالب‌ها و مکان‌های بارکد متفاوتی داشته باشند. برای یافتن بارکد، به جلو و عقب کارت شناسایی نگاه کنید.",
      details_desktop:
        "جلو و عقب کارت شناسایی را برای بارکد بررسی کنید. مطمئن شوید که لنز دوربین خود را تمیز نگه داشته‌اید و سند به خوبی روشن است.",
      title: "بارکد را روی کارت شناسایی پیدا کنید",
      title_desktop: "لنز خود را تمیز کنید و بارکد را پیدا کنید",
    },
    full_document: {
      details:
        "مطمئن شوید که سند را به خوبی روشن نگه داشته‌اید. تمام فیلدهای سند باید روی صفحه دوربین قابل مشاهده باشند.",
      details_desktop:
        "مطمئن شوید که لنز دوربین خود را تمیز نگه داشته‌اید و سند به خوبی روشن است. تمام فیلدهای سند باید روی صفحه دوربین قابل مشاهده باشند.",
      title: "تمام جزئیات را قابل مشاهده نگه دارید",
      title_desktop: "آماده اسکن شوید",
    },
  },
  sdk_aria: "صفحه اسکن اسناد",
  timeout_modal: {
    details: "قادر به خواندن سند نیست. لطفاً دوباره امتحان کنید.",
    title: "اسکن ناموفق بود",
  },
} as const;
