/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for he.
 */
export default {
  document_filtered_modal: {
    details: "נסו לסרוק מסמך אחר.",
    title: "המסמך לא התקבל",
  },
  document_not_recognized_modal: {
    details: "לסרוק את הצד הקדמי של מסמך נתמך.",
    title: "המסמך לא זוהה",
  },
  error_modal: { cancel_btn: "ביטול", retry_btn: "לנסות שוב" },
  feedback_messages: {
    blur_detected: "השאירו את המסמך והטלפון ללא תזוזה",
    camera_angle_too_steep: "השאירו את המסמך מקביל לטלפון",
    document_scanned_aria: "הצלחה! המסמך נסרק",
    document_too_close_to_edge: "התרחק/י",
    face_photo_not_fully_visible: "לשמור על נראות מלאה של תמונת פנים",
    flip_document: "להפוך את המסמך",
    flip_to_back_side: "להפוך את המסמך",
    front_side_scanned_aria: "הצלחה! הצד הקדמי נסרק",
    glare_detected: "הטו או הזיזו את המסמך כדי להסיר את ההשתקפות",
    keep_document_parallel: "יש לשמור על המסמך מקביל למסך",
    keep_document_still: "נא לשמור שהמכשיר והמסמך לא זזים",
    keep_still: "לא לזוז",
    move_closer: "קרב/י",
    move_farther: "התרחק/י",
    move_left: "עבור אל העמוד בצד שמאל",
    move_right: "עבור אל העמוד בצד ימין",
    move_top: "עבור אל העמוד העליון",
    occluded: "השאירו את המסמך גלוי לחלוטין",
    scan_data_page: "סרקו את עמוד הנתונים במסמך",
    scan_last_page_barcode: "סרקו את הברקוד מהעמוד הקודם",
    scan_left_page: "סרוק את העמוד השמאלי",
    scan_right_page: "סרוק את העמוד הימני",
    scan_the_back_side: "סרקו את הצד האחורי של המסמך",
    scan_the_barcode: "לסרוק את הברקוד",
    scan_the_barcode_side: "סרקו את צד הברקוד של מסמך",
    scan_the_front_side: "לסרוק את הצד הקדמי של מסמך",
    scan_top_page: "סרוק את העמוד העליון",
    too_bright: "עברו למקום עם פחות תאורה",
    too_dark: "עברו למקום בהיר יותר",
    wrong_left: "עבור אל העמוד השמאלי",
    wrong_right: "עבור אל העמוד הימני",
    wrong_top: "עבור אל העמוד העליון",
  },
  help_button: { aria_label: "עזרה", tooltip: "זקוקים לעזרה?" },
  help_modal: {
    aria: "סיוע בסריקה",
    back_btn: "חזור",
    barcode_only: {
      blur: {
        details:
          "נסו לדאוג שהטלפון והברקוד יישארו יציבים בזמן הסריקה. תזוזה של כל אחד מהם עלולה לטשטש את התמונה ולהקשות על קריאת הברקוד.",
        details_desktop:
          "נסו לא לזוז בזמן הסקירה. תנועה עלולה לטשטש את התמונה ולהפוך את הברקוד לקשה לקריאה.",
        title: "הישאר יציב בזמן הסריקה",
        title_desktop: "הישאר יציב בזמן הסריקה",
      },
      camera_lens: {
        details_desktop:
          "בדקו את עדשת המצלמה שלכם לאיתור כתמים או אבק. עדשה מלוכלכת גורמת לטשטוש התמונה הסופית, מה שהופך את פרטי הברקוד לבלתי קריאים ומונעת סריקה מוצלחת של הנתונים.",
        title_desktop: "יש לנקות את עדשת המצלמה",
      },
      lighting: {
        details:
          "הימנעו מאור ישיר חזק מכיוון שהוא עלול ליצור סנוור על הברקוד ולהקשות על הסריקה. אם הברקוד אינו נראה לכם ברור, ייתכן שגם המצלמה לא תוכל לקרוא אותו.",
        details_desktop:
          "הימנעו מאור ישיר חזק מכיוון שהוא עלול ליצור סנוור על הברקוד ולהקשות על הסריקה. אם הברקוד אינו נראה לכם ברור, ייתכן שגם המצלמה לא תוכל לקרוא אותו.",
        title: "התרחק מאור חזק",
        title_desktop: "התרחק מאור חזק",
      },
      visibility: {
        details:
          "ודאו שאינכם מכסים חלקים מהברקוד עם האצבע. כמו כן, היזהרו מהשתקפויות על גבי הברקוד שעלולות להפוך אותו לבלתי קריא.",
        details_desktop:
          "ודאו שאינכם מכסים חלקים מהברקוד עם האצבע. כמו כן, היזהרו מהשתקפויות על גבי הברקוד שעלולות להפוך אותו לבלתי קריא.",
        title: "הקפידו שהברקוד יישאר גלוי",
        title_desktop: "הקפידו שהברקוד יישאר גלוי",
      },
    },
    document_with_barcode: {
      blur: {
        details:
          "נסה לשמור על יציבות הטלפון והמסמך בזמן הסריקה. הזזתם עלולה לטשטש את התמונה ולהפוך את הנתונים במסמך לבלתי קריאים.",
        details_desktop:
          "נסו לא לזוז בזמן הסריקה. תנועה עלולה לטשטש את התמונה ולגרום לנתונים במסמך להיות בלתי קריאים.",
        title: "הישאר יציב בזמן הסריקה",
        title_desktop: "הישאר יציב בזמן הסריקה",
      },
      camera_lens: {
        details_desktop:
          "בדקו את עדשת המצלמה שלכם לאיתור כתמים או אבק. עדשה מלוכלכת גורמת לטשטוש התמונה הסופית, מה שהופך את פרטי המסמך לבלתי קריאים ומונעת סריקה מוצלחת של הנתונים.",
        title_desktop: "יש לנקות את עדשת המצלמה",
      },
      lighting: {
        details:
          "הימנע מאור ישיר חזק מכיוון שהוא משתקף מהמסמך ועלול להפוך חלקים מהמסמך לבלתי קריאים. אם אינך יכול לקרוא את הנתונים במסמך, הם לא יהיו גלויים גם למצלמה.",
        details_desktop:
          "הימנע מאור ישיר חזק מכיוון שהוא משתקף מהמסמך ועלול להפוך חלקים מהמסמך לבלתי קריאים. אם אינך יכול לקרוא את הנתונים במסמך, הם לא יהיו גלויים גם למצלמה.",
        title: "התרחק מאור חזק",
        title_desktop: "התרחק מאור חזק",
      },
      visibility: {
        details:
          "ודאו שאינכם מכסים חלקים מהברקוד עם האצבע. כמו כן, היזהרו מהשתקפויות על גבי הברקוד שעלולות להפוך אותו לבלתי קריא.",
        details_desktop:
          "ודאו שאינכם מכסים חלקים מהברקוד עם האצבע. כמו כן, היזהרו מהשתקפויות על גבי הברקוד שעלולות להפוך אותו לבלתי קריא.",
        title: "הקפידו שהברקוד יישאר גלוי",
        title_desktop: "הקפידו שהברקוד יישאר גלוי",
      },
    },
    done_btn: "בוצע",
    done_btn_aria: "המשך סריקה",
    full_document: {
      blur: {
        details:
          "נסה לשמור על יציבות הטלפון והמסמך בזמן הסריקה. הזזתם עלולה לטשטש את התמונה ולהפוך את הנתונים במסמך לבלתי קריאים.",
        details_desktop:
          "נסו לא לזוז בזמן הסריקה. תנועה עלולה לטשטש את התמונה ולגרום לנתונים במסמך להיות בלתי קריאים.",
        title: "הישאר יציב בזמן הסריקה",
        title_desktop: "הישאר יציב בזמן הסריקה",
      },
      camera_lens: {
        details_desktop:
          "בדקו את עדשת המצלמה שלכם לאיתור כתמים או אבק. עדשה מלוכלכת גורמת לטשטוש התמונה הסופית, מה שהופך את פרטי המסמך לבלתי קריאים ומונעת סריקה מוצלחת של הנתונים.",
        title_desktop: "יש לנקות את עדשת המצלמה",
      },
      lighting: {
        details:
          "הימנע מאור ישיר חזק מכיוון שהוא משתקף מהמסמך ועלול להפוך חלקים מהמסמך לבלתי קריאים. אם אינך יכול לקרוא את הנתונים במסמך, הם לא יהיו גלויים גם למצלמה.",
        details_desktop:
          "הימנע מאור ישיר חזק מכיוון שהוא משתקף מהמסמך ועלול להפוך חלקים מהמסמך לבלתי קריאים. אם אינך יכול לקרוא את הנתונים במסמך, הם לא יהיו גלויים גם למצלמה.",
        title: "התרחק מאור חזק",
        title_desktop: "התרחק מאור חזק",
      },
      visibility: {
        details:
          "הקפד לא לכסות חלקים מהמסמך באצבע, כולל השורות התחתונות.כמו כן, היזהר מהשתקפויות הולוגרמה העוברות על שדות המסמך.",
        details_desktop:
          "הקפד לא לכסות חלקים מהמסמך באצבע, כולל השורות התחתונות.כמו כן, היזהר מהשתקפויות הולוגרמה העוברות על שדות המסמך.",
        title: "כל השדות צריכים להיות גלויים",
        title_desktop: "כל השדות צריכים להיות גלויים",
      },
    },
    next_btn: "הבא",
  },
  onboarding_modal: {
    aria: "הנחיות סריקה",
    barcode_only: {
      details:
        "חפשו ברקוד (סדרה של קווים שחורים או קוד מרובע). כוונו את המצלמה שלכם אליו ונסו לא לזוז - הסריקה תתבצע אוטומטית.",
      details_desktop:
        "חפשו ברקוד (סדרה של קווים שחורים או קוד מרובע). ודאו שאתם שומרים על עדשת המצלמה נקייה ושהברקוד מואר היטב.",
      title: "אתרו וסרקו את הברקוד",
      title_desktop: "נקו את העדשה ואתרו את הברקוד",
    },
    btn: "התחלת סריקה",
    document_with_barcode: {
      details:
        "הברקוד בסוגים שונים של מסמכי זיהוי עשויים להיות בפורמטים ובמיקומים שונים. חפשו ברקוד בחלק הקדמי והאחורי של מסמך הזיהוי.",
      details_desktop:
        "בדקו את החלק הקדמי והאחורי של תעודת הזהות כדי לוודא שיש שם ברקוד. וודאו שעדשת המצלמה נקייה ושהמסמך מואר היטב.",
      title: "אתרו את הברקוד על מסמך הזיהוי",
      title_desktop: "נקו את העדשה ואתרו את הברקוד",
    },
    full_document: {
      details:
        "המסמך חייב להיות מואר היטב. כל שדות המסמכים צריכים להיות גלויים על מסך המצלמה.",
      details_desktop:
        "יש לוודא שעדשת המצלמה נקייה ושהמסמך מואר היטב. כל שדות המסמך צריכים להופיע בבירור על מסך המצלמה.",
      title: "כל הפרטים חייבים להיות גלויים",
      title_desktop: "להתכונן לסרוק",
    },
  },
  sdk_aria: "מסך סריקת מסמך",
  timeout_modal: {
    details: "לא ניתן לקרוא את המסמך. נא לנסות שוב.",
    title: "הסריקה נכשלה",
  },
} as const;
