/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ka_GE.
 */
export default {
  document_filtered_modal: {
    details: "სცადეთ სხვა დოკუმენტის დასკანერება.",
    title: "დოკუმენტი უარყოფილია",
  },
  document_not_recognized_modal: {
    details: "დაასკანერეთ მხარდაჭერილი დოკუმენტის წინა მხარე.",
    title: "დოკუმენტის ამოცნობა ვერ მოხერხდა",
  },
  error_modal: { cancel_btn: "გაუქმება", retry_btn: "ხელახლა ცდა" },
  feedback_messages: {
    blur_detected: "არ გაამოძრაოთ დოკუმენტი და ტელეფონი",
    camera_angle_too_steep: "დოკუმენტი ტელეფონის პარალელურად დაიჭირეთ",
    document_scanned_aria: "წარმატებული! დოკუმენტი დასკანერებულია",
    document_too_close_to_edge: "გადადით მოშორებით",
    face_photo_not_fully_visible: "სახის ფოტო სრულად უნდა ჩანდეს",
    flip_document: "ამოატრიალეთ დოკუმენტი",
    flip_to_back_side: "შემოატრიალეთ უკანა მხარეს",
    front_side_scanned_aria: "წარმატებული! წინა მხარე დასკანერებულია",
    glare_detected: "გადახარეთ ან გაამოძრავეთ დოკუმენტი ანარეკლის მოსაშორებლად",
    keep_document_parallel: "დოკუმენტი ეკრანის პარალელურად დაიჭირეთ",
    keep_still: "არ იმოძრაოთ",
    move_closer: "მიუახლოვდით",
    move_farther: "გადადით მოშორებით",
    move_left: "გადადით მარცხენა გვერდზე",
    move_right: "გადადით მარჯვენა გვერდზე",
    move_top: "გადადით ზედა გვერდზე",
    occluded: "დოკუმენტი სრულად უნდა ჩანდეს",
    scan_data_page: "დაასკანერეთ დოკუმენტის მონაცემების გვერდი",
    scan_last_page_barcode: "დაასკანერეთ შტრიხკოდი ბოლო გვერდიდან",
    scan_left_page: "დაასკანერეთ მარცხენა გვერდი",
    scan_right_page: "დაასკანერეთ მარჯვენა გვერდი",
    scan_the_back_side: "დაასკანერეთ დოკუმენტის უკანა მხარე",
    scan_the_barcode: "დაასკანერეთ ბარკოდი",
    scan_the_barcode_side: "დაასკანერეთ დოკუმენტის შტრიხკოდის მხარე",
    scan_the_front_side: "დაასკანერეთ დოკუმენტის წინა მხარე",
    scan_the_mrz_side: "დაასკანერეთ დოკუმენტის MRZ მხარე",
    scan_top_page: "დაასკანერეთ ზედა გვერდი",
    too_bright: "გადადით ნაკლებად განათებულ ადგილას",
    too_dark: "გადადით უფრო განათებულ ადგილას",
    wrong_left: "გადადით მარცხენა გვერდზე",
    wrong_right: "გადადით მარჯვენა გვერდზე",
    wrong_top: "გადადით ზედა გვერდზე",
  },
  help_button: { aria_label: "დახმარება", tooltip: "დახმარება გჭირდებათ?" },
  help_modal: {
    aria: "დასკანერებაში დახმარება",
    back_btn: "უკან",
    barcode_only: {
      blur: {
        details:
          "დასკანერებისას ეცადეთ არ გაამოძრაოთ ტელეფონი და შტრიხკოდი. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და შტრიხკოდი გარჩევადი არ იყოს.",
        details_desktop:
          "დასკანერებისას ეცადეთ არ იმოძრაოთ. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და შტრიხკოდი გარჩევადი არ იყოს.",
        title: "არ იმოძრაოთ დასკანერებისას",
        title_desktop: "არ იმოძრაოთ დასკანერებისას",
      },
      camera_lens: {
        details_desktop:
          "დაათვალიერეთ კამერის ლინზა ლაქების ან მტვრის აღმოსაჩენად. ჭუჭყიანი ლინზა გამოიწვევს საბოლოო ფოტოს დაბურვას, შტრიხკოდი გარჩევადი არ იქნება და მონაცემების წარმატებით დასკანერება ვერ მოხერხდება.",
        title_desktop: "გაწმინდეთ თქვენი კამერის ლინზა",
      },
      lighting: {
        details:
          "მოერიდეთ პირდაპირ მკვეთრ განათებას, რადგან ის შტრიხკოდზე ანარეკლს აჩენს და მის დასკანერებას ართულებს. თუ შტრიხკოდი კარგად არ ჩანს, კამერამ შეიძლება ვერ დააფიქსიროს ის.",
        details_desktop:
          "მოერიდეთ პირდაპირ მკვეთრ განათებას, რადგან ის შტრიხკოდზე ანარეკლს აჩენს და მის დასკანერებას ართულებს. თუ შტრიხკოდი კარგად არ ჩანს, კამერამ შეიძლება ვერ დააფიქსიროს ის.",
        title: "მოერიდეთ მკვეთრ განათებას",
        title_desktop: "მოერიდეთ მკვეთრ განათებას",
      },
      visibility: {
        details:
          "დარწმუნდით, რომ თითით შტრიხკოდის ნაწილებს არ ფარავთ. ასევე, ფრთხილად იყავით ანარეკლებთანაც, რომლებიც შტრიხკოდზე გადადის და მის წაკითხვას შეუძლებელს ხდის.",
        details_desktop:
          "დარწმუნდით, რომ თითით შტრიხკოდის ნაწილებს არ ფარავთ. ასევე, ფრთხილად იყავით ანარეკლებთანაც, რომლებიც შტრიხკოდზე გადადის და მის წაკითხვას შეუძლებელს ხდის.",
        title: "შტრიხკოდი უნდა ჩანდეს",
        title_desktop: "შტრიხკოდი უნდა ჩანდეს",
      },
    },
    document_with_barcode: {
      blur: {
        details:
          "დასკანერებისას ეცადეთ არ გაამოძრაოთ ტელეფონი და დოკუმენტი. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და დოკუმენტში ასახული მონაცემები გარჩევადი არ იყოს.",
        details_desktop:
          "დასკანერებისას ეცადეთ არ იმოძრაოთ. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და დოკუმენტში ასახული მონაცემები გარჩევადი არ იყოს.",
        title: "არ იმოძრაოთ დასკანერებისას",
        title_desktop: "არ იმოძრაოთ დასკანერებისას",
      },
      camera_lens: {
        details_desktop:
          "დაათვალიერეთ კამერის ლინზა ლაქების ან მტვრის აღმოსაჩენად. ჭუჭყიანი ლინზა გამოიწვევს საბოლოო ფოტოს დაბურვას, დოკუმენტის დეტალები გარჩევადი არ იქნება და მონაცემების წარმატებით დასკანერება ვერ მოხერხდება.",
        title_desktop: "გაწმინდეთ თქვენი კამერის ლინზა",
      },
      lighting: {
        details:
          "მოერიდეთ პირდაპირ მკვეთრ განათებას, რადგან ის დოკუმენტზე ანარეკლს აჩენს და დოკუმენტის ნაწილები შესაძლოა გარჩევადი აღარ იყოს. თუ დოკუმენტში მოცემულ მონაცემებს ვერ კითხულობთ, მას ვერც კამერა დააფიქსირებს.",
        details_desktop:
          "მოერიდეთ პირდაპირ მკვეთრ განათებას, რადგან ის დოკუმენტზე ანარეკლს აჩენს და დოკუმენტის ნაწილები შესაძლოა გარჩევადი აღარ იყოს. თუ დოკუმენტში მოცემულ მონაცემებს ვერ კითხულობთ, მას ვერც კამერა დააფიქსირებს.",
        title: "მოერიდეთ მკვეთრ განათებას",
        title_desktop: "მოერიდეთ მკვეთრ განათებას",
      },
      visibility: {
        details:
          "დარწმუნდით, რომ თითით შტრიხკოდის ნაწილებს არ ფარავთ. ასევე, ფრთხილად იყავით ანარეკლებთანაც, რომლებიც შტრიხკოდზე გადადის და მის წაკითხვას შეუძლებელს ხდის.",
        details_desktop:
          "დარწმუნდით, რომ თითით შტრიხკოდის ნაწილებს არ ფარავთ. ასევე, ფრთხილად იყავით ანარეკლებთანაც, რომლებიც შტრიხკოდზე გადადის და მის წაკითხვას შეუძლებელს ხდის.",
        title: "შტრიხკოდი უნდა ჩანდეს",
        title_desktop: "შტრიხკოდი უნდა ჩანდეს",
      },
    },
    document_with_mrz: {
      blur: {
        details:
          "დასკანერებისას ეცადეთ არ გაამოძრაოთ ტელეფონი და დოკუმენტი. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და დოკუმენტში ასახული მონაცემები გარჩევადი არ იყოს.",
        details_desktop:
          "დასკანერებისას ეცადეთ არ იმოძრაოთ. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და დოკუმენტში ასახული მონაცემები გარჩევადი არ იყოს.",
        title: "არ იმოძრაოთ დასკანერებისას",
        title_desktop: "არ იმოძრაოთ დასკანერებისას",
      },
      camera_lens: {
        details_desktop:
          "დაათვალიერეთ კამერის ლინზა ლაქების ან მტვრის აღმოსაჩენად. ჭუჭყიანი ლინზა გამოიწვევს საბოლოო ფოტოს დაბურვას, დოკუმენტის დეტალები გარჩევადი არ იქნება და მონაცემების წარმატებით დასკანერება ვერ მოხერხდება.",
        title_desktop: "გაწმინდეთ თქვენი კამერის ლინზა",
      },
      lighting: {
        details:
          "მოერიდეთ პირდაპირ მკვეთრ განათებას, რადგან ის დოკუმენტზე ანარეკლს აჩენს და დოკუმენტის ნაწილები შესაძლოა გარჩევადი აღარ იყოს. თუ დოკუმენტში მოცემულ მონაცემებს ვერ კითხულობთ, მას ვერც კამერა დააფიქსირებს.",
        details_desktop:
          "მოერიდეთ პირდაპირ მკვეთრ განათებას, რადგან ის დოკუმენტზე ანარეკლს აჩენს და დოკუმენტის ნაწილები შესაძლოა გარჩევადი აღარ იყოს. თუ დოკუმენტში მოცემულ მონაცემებს ვერ კითხულობთ, მას ვერც კამერა დააფიქსირებს.",
        title: "მოერიდეთ მკვეთრ განათებას",
        title_desktop: "მოერიდეთ მკვეთრ განათებას",
      },
      visibility: {
        details:
          "დარწმუნდით, რომ თითით არ ფარავთ MRZ-ის არც ერთ ნაწილს. ასევე, ყურადღება მიაქციეთ, რომ MRZ-ზე არ იყოს ანარეკლი, რომელმაც შეიძლება მისი წაკითხვა შეუძლებელი გახადოს.",
        details_desktop:
          "დარწმუნდით, რომ თითით არ ფარავთ MRZ-ის არც ერთ ნაწილს. ასევე, ყურადღება მიაქციეთ, რომ MRZ-ზე არ იყოს ანარეკლი, რომელმაც შეიძლება მისი წაკითხვა შეუძლებელი გახადოს.",
        title: "MRZ უნდა ჩანდეს",
        title_desktop: "MRZ უნდა ჩანდეს",
      },
    },
    done_btn: "დასრულდა",
    done_btn_aria: "დასკანერების გაგრძელება",
    full_document: {
      blur: {
        details:
          "დასკანერებისას ეცადეთ არ გაამოძრაოთ ტელეფონი და დოკუმენტი. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და დოკუმენტში ასახული მონაცემები გარჩევადი არ იყოს.",
        details_desktop:
          "დასკანერებისას ეცადეთ არ იმოძრაოთ. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და დოკუმენტში ასახული მონაცემები გარჩევადი არ იყოს.",
        title: "არ იმოძრაოთ დასკანერებისას",
        title_desktop: "არ იმოძრაოთ დასკანერებისას",
      },
      camera_lens: {
        details_desktop:
          "დაათვალიერეთ კამერის ლინზა ლაქების ან მტვრის აღმოსაჩენად. ჭუჭყიანი ლინზა გამოიწვევს საბოლოო ფოტოს დაბურვას, დოკუმენტის დეტალები გარჩევადი არ იქნება და მონაცემების წარმატებით დასკანერება ვერ მოხერხდება.",
        title_desktop: "გაწმინდეთ თქვენი კამერის ლინზა",
      },
      lighting: {
        details:
          "მოერიდეთ პირდაპირ მკვეთრ განათებას, რადგან ის დოკუმენტზე ანარეკლს აჩენს და დოკუმენტის ნაწილები შესაძლოა გარჩევადი აღარ იყოს. თუ დოკუმენტში მოცემულ მონაცემებს ვერ კითხულობთ, მას ვერც კამერა დააფიქსირებს.",
        details_desktop:
          "მოერიდეთ პირდაპირ მკვეთრ განათებას, რადგან ის დოკუმენტზე ანარეკლს აჩენს და დოკუმენტის ნაწილები შესაძლოა გარჩევადი აღარ იყოს. თუ დოკუმენტში მოცემულ მონაცემებს ვერ კითხულობთ, მას ვერც კამერა დააფიქსირებს.",
        title: "მოერიდეთ მკვეთრ განათებას",
        title_desktop: "მოერიდეთ მკვეთრ განათებას",
      },
      visibility: {
        details:
          "დარწმუნდით, რომ თითით დოკუმენტის ნაწილებს არ ფარავთ, მათ შორის ქვედა ხაზებსაც. ასევე, ფრთხილად იყავით ჰოლოგრამულ ანარეკლებთანაც, რომლებიც დოკუმენტის ველებზე გადადის.",
        details_desktop:
          "დარწმუნდით, რომ თითით დოკუმენტის ნაწილებს არ ფარავთ, მათ შორის ქვედა ხაზებსაც. ასევე, ფრთხილად იყავით ჰოლოგრამულ ანარეკლებთანაც, რომლებიც დოკუმენტის ველებზე გადადის.",
        title: "ყველა ველი უნდა ჩანდეს",
        title_desktop: "ყველა ველი უნდა ჩანდეს",
      },
    },
    next_btn: "შემდეგი",
  },
  onboarding_modal: {
    aria: "დასკანერების ინსტრუქციები",
    barcode_only: {
      details:
        "მოძებნეთ შტრიხკოდი (შავი ხაზების სერია ან ოთხკუთხედი კოდი). მიმართეთ კამერა მასზე და არ გაამოძრაოთ – დასკანერება ავტომატურად მოხდება.",
      details_desktop:
        "მოძებნეთ შტრიხკოდი (შავი ხაზების სერია ან ოთხკუთხედი კოდი). დარწმუნდით, რომ კამერის ლინზა სუფთაა და შტრიხკოდი კარგადა არის განათებული.",
      title: "მოძებნეთ და დაასკანერეთ შტრიხკოდი",
      title_desktop: "გაწმინდეთ თქვენი კამერის ლინზა და მოძებნეთ შტრიხკოდი",
    },
    btn: "დასკანერების დაწყება",
    document_with_barcode: {
      details:
        "სხვადასხვა ტიპის დოკუმენტს შეიძლება სხვადასხვა ფორმატის შტრიხკოდი ჰქონდეს და ის სხვადასხვა ადგილას იყოს განთავსებული. დაათვალიერეთ დოკუმენტის წინა და უკანა მხარეები შტრიხკოდის საპოვნელად.",
      details_desktop:
        "დაათვალიერეთ დოკუმენტის წინა და უკანა მხარე შტრიხკოდის სანახავად. დარწმუნდით, რომ კამერის ლინზა სუფთაა და დოკუმენტი კარგად არის განათებული.",
      title: "მოძებნეთ შტრიხკოდი დოკუმენტზე",
      title_desktop: "გაწმინდეთ თქვენი კამერის ლინზა და მოძებნეთ შტრიხკოდი",
    },
    document_with_mrz: {
      details:
        "დოკუმენტის წინა ან უკანა მხარეს, ქვედა ნაწილში ნახავთ სიმბოლოების გრძელ მიმდევრობას, რომელიც დაყოფილია 2 ან 3 სტრიქონად და შეიცავს გამყოფ ნიშნებს << ან >>.",
      details_desktop:
        "დაათვალიერეთ დოკუმენტის წინა და უკანა მხარე MRZ-ის სანახავად. მოძებნეთ დოკუმენტის ქვედა ნაწილში სიმბოლოებისა და << ნიშნებისგან შემდგარი 2–3 სტრიქონი. დარწმუნდით, რომ კამერის ლინზა სუფთაა და დოკუმენტი კარგად არის განათებული.",
      title: "მოძებნეთ MRZ დოკუმენტზე",
      title_desktop: "გაწმინდეთ თქვენი კამერის ლინზა და მოძებნეთ MRZ",
    },
    full_document: {
      details:
        "დარწმუნდით, რომ დოკუმენტი კარგად არის განათებული. კამერის ეკრანზე დოკუმენტის ყველა ველი უნდა ჩანდეს.",
      details_desktop:
        "დარწმუნდით, რომ კამერის ლინზა სუფთაა და დოკუმენტი კარგად არის განათებული. კამერის ეკრანზე დოკუმენტის ყველა ველი უნდა ჩანდეს.",
      title: "ყველა დეტალი უნდა ჩანდეს",
      title_desktop: "მოემზადეთ დასკანერებისთვის",
    },
  },
  sdk_aria: "დოკუმენტის დასკანერების ეტაპი",
  timeout_modal: {
    details:
      "დარწმუნდით, რომ დოკუმენტი კარგად არის განათებული, სრულად ჩანს კადრში და არ აქვს ანარეკლი.",
    details_desktop:
      "დარწმუნდით, რომ კამერის ლინზა სუფთაა, დოკუმენტი სრულად ჩანს კადრში, ფოკუსი გასწორებულია და კარგად არის განათებული.",
    title: "დოკუმენტის წაკითხვა ვერ ხერხდება",
  },
} as const;
