/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for kk.
 */
export default {
  alert_cancel_btn: "Бас тарту",
  alert_retry_btn: "Қайталау",
  blur_detected: "Құжат пен телефонды қозғалтпай ұстаңыз",
  camera_angle_too_steep: "Құжатты телефонға параллель етіп ұстаңыз",
  document_filtered: "Құжат қабылданбады",
  document_filtered_details: "Басқа құжатты сканерлеп көріңіз.",
  document_not_recognized: "Құжатын танылмады",
  document_not_recognized_details:
    "Қолдау көрсетілетін құжаттың алдыңғы жағын сканерлеңіз.",
  document_scanned: "Сәтті! Құжат сканерленді",
  document_too_close_to_edge: "Алыстаңыз",
  face_photo_not_fully_visible: "Бет суреті толықтай көрінетін болуы тиіс",
  flip_document: "Құжатты айналдырыңыз",
  flip_to_back_side: "Артқы жаққа айналдырыңыз",
  front_side_scanned: "Сәтті! Алдыңғы жағы сканерленді",
  glare_detected: "Шағылысуды жою үшін құжатты еңкейтіңіз немесе жылжытыңыз",
  help_aria_label: "Анықтама",
  help_modal_back_btn: "Артқа қайту",
  help_modal_blur_details_desktop:
    "Сканерлеу кезінде құрылғы мен құжатты мүмкіндігінше қозғалтпай ұстаңыз. Екеуінің де қозғалысы суретті бұлыңғыр етіп, құжаттағы деректерді оқылмайтындай етіп жіберуі мүмкін.",
  help_modal_camera_lens_details:
    "Камера объективінде дақ немесе шаң бар-жоғын тексеріңіз. Лас объектив қорытынды кескіннің бұлыңғырлануына әкеледі, ал бұл өз кезегінде құжат деректерінің оқылмауына алып келеді және сканерлеуге кедергі келтіреді.",
  help_modal_camera_lens_title: "Камера объективін тазалаңыз",
  help_modal_details_1:
    "Саусағыңызбен құжаттың кейбір бөліктерін, әсіресе төменгі жолдарын жауып қалмаңыз. Сондай-ақ, құжат өрістерінің үстінен өтетін голограммалық шағылыстарға да назар аударыңыз.",
  help_modal_details_2:
    "Тікелей және қатты жарықтан арырақ тұрыңыз, себебі ол құжаттан шағылысып, кейбір бөліктерін оқуға мүмкіндік бермейді. Егер құжаттағы деректер сізге көрінбесе, олар камераға да көрінбейді.",
  help_modal_details_3:
    "Сканерлеу кезінде телефон мен құжатты мүмкіндігінше қозғалтпай ұстаңыз. Екеуінің де қозғалысы суретті бұлыңғыр етіп, құжаттағы деректерді оқылмайтындай етіп жіберуі мүмкін.",
  help_modal_done_btn: "Дайын",
  help_modal_next_btn: "Келесі",
  help_modal_title_1: "Барлық өрістердің көрініп тұрғанына көз жеткізіңіз",
  help_modal_title_2: "Тым жарық жерден әрі тұрыңыз",
  help_modal_title_3: "Сканерлеу кезінде қозғалмаңыз",
  help_tooltip: "Көмек керек пе?",
  keep_document_parallel: "Құжатты экранмен параллель етіп ұстаңыз",
  keep_document_still: "Құжат пен құрылғыны қозғалтпай ұстаңыз",
  move_closer: "Жақындатыңыз",
  move_farther: "Алыстаңыз",
  move_left: "Сол жақтағы бетке ауысыңыз",
  move_right: "Оң жақтағы бетке ауысыңыз",
  move_top: "Жоғарғы жақтағы бетке ауысыңыз",
  occluded: "Құжаттың толықтай көрініп тұрғанына көз жеткізіңіз",
  onboarding_modal_btn: "Сканерлеуді бастау",
  onboarding_modal_details:
    "Құжат жақсы жарықта екеніне көз жеткізіңіз. Құжаттағы барлық өрістер камера экранында көрініп тұруы керек.",
  onboarding_modal_details_desktop:
    "Камера линзасы таза және құжат жақсы жарықта екеніне көз жеткізіңіз. Құжаттағы барлық өрістер камера экранында көрініп тұруы керек.",
  onboarding_modal_title:
    "Мәліметтердің барлығының көрініп тұрғанына көз жеткізіңіз",
  onboarding_modal_title_desktop: "Сканерлеуге дайындалыңыз",
  resume_scanning: "Сканерлеуді жалғастыру",
  scan_data_page: "Құжаттың деректер бетін сканерлеңіз",
  scan_last_page_barcode: "Соңғы беттегі штрихкодты сканерлеңіз",
  scan_left_page: "Сол бетті сканерлеңіз",
  scan_right_page: "Оң бетті сканерлеңіз",
  scan_the_back_side: "Құжаттың артқы жағын сканерлеңіз",
  scan_the_barcode: "Штрих-кодты сканерлеңіз",
  scan_the_front_side: "Құжаттың алдыңғы жағын сканерлеңіз",
  scan_top_page: "Жоғарғы бетті сканерлеңіз",
  scan_unsuccessful: "Сканерлене алмады",
  scan_unsuccessful_details: "Құжатты оқу мүмкін болмады. Әрекетті қайталаңыз.",
  scanning_help: "Сканерлеу анықтамасы",
  scanning_instructions: "Сканерлеу нұсқаулығы",
  scanning_screen: "Құжатты сканерлеу экраны",
  too_bright: "Жарығы азырақ жерге өтіңіз",
  too_dark: "Жарығырақ жерге өтіңіз",
  wrong_left: "Сол бетке өтіңіз",
  wrong_right: "Оң бетке өтіңіз",
  wrong_top: "Жоғарғы бетке ауысыңыз",
} as const;
