/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ps_AF.
 */
export default {
  document_filtered_modal: {
    details: "د بل سند سکین کولو هڅه وکړئ.",
    title: "سند نه دی منل شوی",
  },
  document_not_recognized_modal: {
    details: "د ملاتړ شوي سند مخکینۍ برخه سکین کړئ.",
    title: "سند و نه پېژندل شو",
  },
  error_modal: { cancel_btn: "لغوه کول", retry_btn: "بیا هڅه وکړئ" },
  feedback_messages: {
    blur_detected: "اسناد او تلیفون ارام وساتئ",
    camera_angle_too_steep: "سند د تلیفون سره موازي وساتئ",
    document_scanned_aria: "سند په بریالیتوب سکن شو!",
    document_too_close_to_edge: "نور لاړ شه",
    face_photo_not_fully_visible: "د مخ عکس په بشپړه توګه ښکاره وساتئ",
    flip_document: "سند واړوئ",
    flip_to_back_side: "شاته اړخ ته واړوئ",
    front_side_scanned_aria: "د مخې سکن په بریالیتوب ترسره شو!",
    glare_detected: "د انعکاس لرې کولو لپاره سند ټیټ کړئ یا حرکت ورکړئ",
    keep_document_parallel: "سند له سکرین سره موازي وساتئ",
    keep_document_still: "سند او وسیله بې‌حرکته وساتئ",
    keep_still: "مه یې خوځوئ",
    move_closer: "نږدې شه",
    move_farther: "نور لاړ شه",
    move_left: "په چپ اړخ کې پاڼې ته لاړ شئ",
    move_right: "ښي خوا ته پاڼې ته لاړ شئ",
    move_top: "پورته پاڼې ته لاړ شئ",
    occluded: "سند په بشپړ ډول ښکاره وساتئ",
    scan_data_page: "د سند د معلوماتو پاڼه سکین کړئ",
    scan_last_page_barcode: "د آخري پاڼې څخه بارکوډ سکین کړئ",
    scan_left_page: "کیڼ پاڼه سکین کړئ",
    scan_right_page: "سمه پاڼه سکین کړئ",
    scan_the_back_side: "د سند شاته برخه سکین کړئ",
    scan_the_barcode: "بارکوډ سکین کړئ",
    scan_the_barcode_side: "د سند د بارکوډ برخه سکن کړئ",
    scan_the_front_side: "د سند مخکینۍ برخه سکین کړئ",
    scan_top_page: "پورته پاڼه سکین کړئ",
    too_bright: "هغه ځای ته لاړ شئ چې لږ رڼا ولري",
    too_dark: "روښانه ځای ته لاړ شئ",
    wrong_left: "کیڼ مخ ته لاړ شئ",
    wrong_right: "ښي پاڼې ته لاړ شئ",
    wrong_top: "پورته پاڼې ته لاړ شئ",
  },
  help_button: { aria_label: "مرسته", tooltip: "تاسو مرستې ته اړتیا لرئ؟" },
  help_modal: {
    aria: "د سکین کولو په چارو کې مرسته",
    back_btn: "شاته",
    barcode_only: {
      blur: {
        details:
          "هڅه وکړئ د سکن کولو پر مهال ټلیفون او بارکوډ و نه خوځوئ. د هغوی خوځول د انځور د تت کېدو لامل کېږي او د بارکوډ لوستل ستونزمنېږي.",
        details_desktop:
          "هڅه وکړئ د سکن کولو پر مهال کامره و نه خوځوئ. خوځول د انځور د تت کېدو لامل کېږي او د بارکوډ لوستل ستونزمنېږي.",
        title: "د سکین کولو پرمهال ارام پاتې شئ",
        title_desktop: "د سکین کولو پرمهال ارام پاتې شئ",
      },
      camera_lens: {
        details_desktop:
          "د کامرې لېنز مو له لکو او دوړو پاک کړئ. که لېنز ککړ وي انځور تت کېږي، بارکوډ نه لوستل کېږي او معلومات په بریالیتوب سره نه سکن کېږي.",
        title_desktop: "خپل د کمرې لینز پاک کړئ",
      },
      lighting: {
        details:
          "له مستقیمې او ځلانده روښنایئ څخه ډډه وکړئ ځکه چې دا پر بارکوډ غبرګون مومي او سکن کول ستونزمن کېږي. که بارکوډ تاسو ته په روښانه توګه د لیدلو وړ نه وي، کامره نشي کولای هغه په اسانۍ سره ولولي.",
        details_desktop:
          "له مستقیمې او ځلانده روښنایئ څخه ډډه وکړئ ځکه چې دا پر بارکوډ غبرګون مومي او سکن کول ستونزمن کېږي. که بارکوډ تاسو ته په روښانه توګه د لیدلو وړ نه وي، کامره نشي کولای هغه په اسانۍ سره ولولي.",
        title: "د سختې رڼا لپاره پام وکړئ",
        title_desktop: "د سختې رڼا لپاره پام وکړئ",
      },
      visibility: {
        details:
          "ډاډ حاصل کړئ چې د بارکوډ کومه برخه مو په ګوته پټه نکړئ. همدارنګه د وړانګو هغه غبرګون ته وګورئ چې پر بارکوډ راځي او کېدای شي بارکوډ و نه لوستل شي.",
        details_desktop:
          "ډاډ حاصل کړئ چې د بارکوډ کومه برخه مو په ګوته پټه نکړئ. همدارنګه د وړانګو هغه غبرګون ته وګورئ چې پر بارکوډ راځي او کېدای شي بارکوډ و نه لوستل شي.",
        title: "بارکوډ باید د لیدلو وړ وي",
        title_desktop: "بارکوډ باید د لیدلو وړ وي",
      },
    },
    document_with_barcode: {
      blur: {
        details:
          "هڅه وکړئ چې د سکین کولو پرمهال تلیفون او سند ارام وساتئ. د دواړو خواوو ته حرکت ورکول کولی شي عکس تیاره کړي او په سند کې معلومات د لوستلو وړ نه کړي.",
        details_desktop:
          "هڅه وکړئ د سکن کولو پر مهال کامره و نه خوځوئ. خوځول د انځور د تت کېدو لامل کېږي او د معلوماتو لوستل ستونزمنېږي.",
        title: "د سکین کولو پرمهال ارام پاتې شئ",
        title_desktop: "د سکین کولو پرمهال ارام پاتې شئ",
      },
      camera_lens: {
        details_desktop:
          "خپله د کمرې لینز د داغونو یا دوړو لپاره وګورئ. چټل لینز د وروستي انځور د خړپړ کېدو لامل ګرځي، چې له امله یې د کارت جزئیات د لوستلو وړ نه وي او د معلوماتو بریالی سکین مخه نیسي.",
        title_desktop: "خپل د کمرې لینز پاک کړئ",
      },
      lighting: {
        details:
          "د مستقیم سخت رڼا څخه ډډه وکړئ ځکه چې دا د سند څخه منعکس کیږي او کولی شي د سند برخې د لوستلو وړ نه کړي. که تاسو په سند کې معلومات نشئ لوستلی، نو دا به کیمرې ته هم ونه لیدل شي.",
        details_desktop:
          "د مستقیم سخت رڼا څخه ډډه وکړئ ځکه چې دا د سند څخه منعکس کیږي او کولی شي د سند برخې د لوستلو وړ نه کړي. که تاسو په سند کې معلومات نشئ لوستلی، نو دا به کیمرې ته هم ونه لیدل شي.",
        title: "د سختې رڼا لپاره پام وکړئ",
        title_desktop: "د سختې رڼا لپاره پام وکړئ",
      },
      visibility: {
        details:
          "ډاډ حاصل کړئ چې د بارکوډ کومه برخه مو په ګوته پټه نکړئ. همدارنګه د وړانګو هغه غبرګون ته وګورئ چې پر بارکوډ راځي او کېدای شي بارکوډ و نه لوستل شي.",
        details_desktop:
          "ډاډ حاصل کړئ چې د بارکوډ کومه برخه مو په ګوته پټه نکړئ. همدارنګه د وړانګو هغه غبرګون ته وګورئ چې پر بارکوډ راځي او کېدای شي بارکوډ و نه لوستل شي.",
        title: "بارکوډ باید د لیدلو وړ وي",
        title_desktop: "بارکوډ باید د لیدلو وړ وي",
      },
    },
    done_btn: "وشو",
    done_btn_aria: "د سي وي سکین کول",
    full_document: {
      blur: {
        details:
          "هڅه وکړئ چې د سکین کولو پرمهال تلیفون او سند ارام وساتئ. د دواړو خواوو ته حرکت ورکول کولی شي عکس تیاره کړي او په سند کې معلومات د لوستلو وړ نه کړي.",
        details_desktop:
          "هڅه وکړئ د سکن کولو پر مهال کامره و نه خوځوئ. خوځول د انځور د تت کېدو لامل کېږي او د معلوماتو لوستل ستونزمنېږي.",
        title: "د سکین کولو پرمهال ارام پاتې شئ",
        title_desktop: "د سکین کولو پرمهال ارام پاتې شئ",
      },
      camera_lens: {
        details_desktop:
          "خپله د کمرې لینز د داغونو یا دوړو لپاره وګورئ. چټل لینز د وروستي انځور د خړپړ کېدو لامل ګرځي، چې له امله یې د کارت جزئیات د لوستلو وړ نه وي او د معلوماتو بریالی سکین مخه نیسي.",
        title_desktop: "خپل د کمرې لینز پاک کړئ",
      },
      lighting: {
        details:
          "د مستقیم سخت رڼا څخه ډډه وکړئ ځکه چې دا د سند څخه منعکس کیږي او کولی شي د سند برخې د لوستلو وړ نه کړي. که تاسو په سند کې معلومات نشئ لوستلی، نو دا به کیمرې ته هم ونه لیدل شي.",
        details_desktop:
          "د مستقیم سخت رڼا څخه ډډه وکړئ ځکه چې دا د سند څخه منعکس کیږي او کولی شي د سند برخې د لوستلو وړ نه کړي. که تاسو په سند کې معلومات نشئ لوستلی، نو دا به کیمرې ته هم ونه لیدل شي.",
        title: "د سختې رڼا لپاره پام وکړئ",
        title_desktop: "د سختې رڼا لپاره پام وکړئ",
      },
      visibility: {
        details:
          "ډاډ ترلاسه کړئ چې تاسو د سند ځینې برخې په ګوتو سره نه پوښئ، په شمول د لاندې کرښو. همدارنګه، د هولوگرام انعکاسونو ته پام وکړئ چې د سند په ساحو کې ځي.",
        details_desktop:
          "ډاډ ترلاسه کړئ چې تاسو د سند ځینې برخې په ګوتو سره نه پوښئ، په شمول د لاندې کرښو. همدارنګه، د هولوگرام انعکاسونو ته پام وکړئ چې د سند په ساحو کې ځي.",
        title: "ټول ساحې ښکاره وساتئ",
        title_desktop: "ټول ساحې ښکاره وساتئ",
      },
    },
    next_btn: "بل",
  },
  onboarding_modal: {
    aria: "د سکین کولو اړوند لارښوونې",
    barcode_only: {
      details:
        "بارکوډ وګورئ (د تورو کرښو یوه لړۍ یا یوه مربع شکله کوډ). خپله کامره ور مخامخ کړئ او مه یې خوځوئ — په اتومات ډول به سکن ترسره شي.",
      details_desktop:
        "بارکوډ وګورئ (د تورو کرښو یوه لړۍ یا یوه مربع شکله کوډ). ډاډ حاصل کړئ چې ستاسو د کامرې لېنز پاک دی او بارکوډ ښه روښانه وي.",
      title: "بارکوډ ومومئ او سکن یې کړئ",
      title_desktop: "خپل لېنز پاک کړئ او بارکوډ ومومئ",
    },
    btn: "سکن کول پیل کړئ",
    document_with_barcode: {
      details:
        "بېلا بېلې ID ګانې کېدای شي د بارکوډ متفاوتې بڼې او موقعیتونه ولري. د ID مخ او شا د بارکوډ لپاره وګورئ.",
      details_desktop:
        "د ID مخ او شا د بارکوډ لپاره ولولئ. ډاډ حاصل کړئ چې تاسو د خپلې کامرې لېنزونه پاک کړي دي سند ښه روښانه دی.",
      title: "پر ID موجود بارکوډ ومومئ",
      title_desktop: "خپل لېنز پاک کړئ او بارکوډ ومومئ",
    },
    full_document: {
      details:
        "ډاډ ترلاسه کړئ چې تاسو سند ښه روښانه ساتئ. د اسنادو ټولې ساحې باید د کیمرې په سکرین کې ښکاره شي.",
      details_desktop:
        "ډاډ ترلاسه کړئ چې د کمرې لینز مو پاک وي او سند ښه روښانه وي. د سند ټولې برخې باید د کمرې په سکرین کې ښکاره وي.",
      title: "ټول جزئیات ښکاره وساتئ",
      title_desktop: "د سکین لپاره چمتو شئ",
    },
  },
  sdk_aria: "د سند د سکین کولو سکرین",
  timeout_modal: {
    details: "د سند لوستلو توان نه لرم. مهرباني وکړئ بیا هڅه وکړئ.",
    title: "سکین ناکام شو",
  },
} as const;
