/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for si.
 */
export default {
  document_filtered_modal: {
    details: "වෙනත් ලේඛනයක් ස්කෑන් කිරීමට උත්සාහ කර බලන්න.",
    title: "ලේඛනය පිළිගත නොහැක",
  },
  document_not_recognized_modal: {
    details: "සහාය දක්වන ලේඛනයක ඉදිරි පැත්ත ස්කෑන් කරන්න.",
    title: "ලේඛනය හඳුනාගත නොහැක",
  },
  error_modal: { cancel_btn: "අවලංගු කරන්න", retry_btn: "නැවත උත්සාහ කරන්න" },
  feedback_messages: {
    blur_detected: "ලේඛනය සහ දුරකථනය නොසෙල්වන සේ තබා ගන්න",
    camera_angle_too_steep: "ලේඛනය දුරකථනයට සමාන්තරව තබා ගන්න",
    document_scanned_aria: "සාර්ථකයි! ලේඛනය ස්කෑන් කර ඇත",
    document_too_close_to_edge: "මදක් ඈත් කරන්න",
    face_photo_not_fully_visible:
      "මුහුණේ ඡායාරූපය සම්පූර්ණයෙන් පෙනෙන පරිදි තබා ගන්න",
    flip_document: "ලේඛනය අනෙක් පිට හරවන්න",
    flip_to_back_side: "පිට පැත්ත හරවන්න",
    front_side_scanned_aria: "සාර්ථකයි! ඉදිරි පැත්ත ස්කෑන් කර ඇත",
    glare_detected: "පරාවර්තනය ඉවත් කිරීමට ලේඛනය ඇල කරන්න හෝ  එහා මෙහා කරන්න",
    keep_document_parallel: "ලේඛනය තිරයට සමාන්තරව තබා ගන්න",
    keep_still: "නොසෙල්වී සිටින්න",
    move_closer: "මදක් ළං කරන්න",
    move_farther: "මදක් ඈත් කරන්න",
    move_left: "වම්පස ඇති පිටුවට යන්න",
    move_right: "දකුණුපස ඇති පිටුවට යන්න",
    move_top: "මුදුනේ ඇති පිටුවට යන්න",
    occluded: "ලේඛනය සම්පූර්ණයෙන් පෙනෙන පරිදි තබා ගන්න",
    scan_data_page: "ලේඛනයේ දත්ත සහිත පිටුව ස්කෑන් කරන්න",
    scan_last_page_barcode: "අවසාන පිටුවෙන් බාර්කෝඩ් එක ස්කෑන් කරන්න",
    scan_left_page: "වම් පිටුව ස්කෑන් කරන්න",
    scan_right_page: "දකුණු පිටුව ස්කෑන් කරන්න",
    scan_the_back_side: "ලේඛනයේ පිට පැත්ත ස්කෑන් කරන්න",
    scan_the_barcode: "බාර්කෝඩ් එක ස්කෑන් කරන්න",
    scan_the_barcode_side: "ලේඛනයක බාර්කෝඩ් එක ඇති පැත්ත ස්කෑන් කරන්න",
    scan_the_front_side: "ලේඛනයේ ඉදිරි පැත්ත ස්කෑන් කරන්න",
    scan_the_mrz_side: "ලේඛනයක MRZ එක ඇති පැත්ත ස්කෑන් කරන්න",
    scan_top_page: "මුදුන් පිටුව ස්කෑන් කරන්න",
    too_bright: "ආලෝකය මදක් අඩු තැනකට යන්න",
    too_dark: "ආලෝකය මදක් වැඩි තැනකට යන්න",
    wrong_left: "වම් පිටුවට යන්න",
    wrong_right: "දකුණු පිටුවට යන්න",
    wrong_top: "මුදුන් පිටුවට යන්න",
  },
  help_button: { aria_label: "උදව්", tooltip: "උදව් අවශ්‍ය ද?" },
  help_modal: {
    aria: "ස්කෑන් කිරීමට උදව්",
    back_btn: "ආපසු",
    barcode_only: {
      blur: {
        details:
          "ස්කෑන් කරන අතරතුර දුරකථනය සහ බාර්කෝඩ් එක නොසෙල්වෙන සේ තබා ගැනීමට උත්සාහ කරන්න. මින් එකක් හෝ සෙලවීම රූපය අපැහැදිලි වී බාර්කෝඩ් එක කියවීමට අපහසු වීමට හේතු විය හැක.",
        details_desktop:
          "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටීමට උත්සාහ කරන්න. සෙලවීම රූපය අපැහැදිලි වී බාර්කෝඩ් එක කියවීමට අපහසු වීමට හේතු විය හැක.",
        title: "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටින්න",
        title_desktop: "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටින්න",
      },
      camera_lens: {
        details_desktop:
          "ඔබේ කැමරා කාචයේ පැල්ලම් හෝ දූවිලි ඇත්දැයි පරීක්ෂා කරන්න. කැමරා කාචය අපිරිසිදු වීම ඉන් ලබා ගන්නා අවසාන රූපය බොඳ වීමට හේතුව වන අතර, ඉන් බාර්කෝඩ් එක කියවිය නොහැකි වී, දත්ත සාර්ථකව ස්කෑන් කිරීමට බාධා ඇති වේ.",
        title_desktop: "ඔබේ කැමරා කාචය පිරිසිදු කරන්න",
      },
      lighting: {
        details:
          "බාර්කෝඩ් එක මත දිලිසීමක් ඇති වී එය ස්කෑන් කිරීමට අපහසු විය හැකි බැවින්, සෘජු රළු ආලෝකය වළක්වා ගන්න. ඔබට බාර්කෝඩ් එක පැහැදිලිව නොපෙනේ නම්, කැමරාවට ද එය කියවීමට නොහැකි විය හැක.",
        details_desktop:
          "බාර්කෝඩ් එක මත දිලිසීමක් ඇති වී එය ස්කෑන් කිරීමට අපහසු විය හැකි බැවින්, සෘජු රළු ආලෝකය වළක්වා ගන්න. ඔබට බාර්කෝඩ් එක පැහැදිලිව නොපෙනේ නම්, කැමරාවට ද එය කියවීමට නොහැකි විය හැක.",
        title: "රළු ආලෝකය ගැන සැලකිලිමත් වන්න",
        title_desktop: "රළු ආලෝකය ගැන සැලකිලිමත් වන්න",
      },
      visibility: {
        details:
          "ඔබේ ඇඟිල්ලකින් බාර්කෝඩ් එකේ කොටස් ආවරණය නොවන බවට වග බලා ගන්න. එසේම බාර්කෝඩ් එකේ කොටස් කියවීම අපහසු කළ හැකි, ඒ මත ඇති වන පරාවර්තන පිළිබඳව අවධානයෙන් සිටින්න.",
        details_desktop:
          "ඔබේ ඇඟිල්ලකින් බාර්කෝඩ් එකේ කොටස් ආවරණය නොවන බවට වග බලා ගන්න. එසේම බාර්කෝඩ් එකේ කොටස් කියවීම අපහසු කළ හැකි, ඒ මත ඇති වන පරාවර්තන පිළිබඳව අවධානයෙන් සිටින්න.",
        title: "බාර්කෝඩ් එක පෙනෙන පරිදි තබා ගන්න",
        title_desktop: "බාර්කෝඩ් එක පෙනෙන පරිදි තබා ගන්න",
      },
    },
    document_with_barcode: {
      blur: {
        details:
          "ස්කෑන් කරන අතරතුර දුරකථනය සහ ලේඛනය නොසෙල්වෙන සේ තබා ගන්න. මින් එකක් හෝ සෙලවීම රූපය අපැහැදිලි වී ලේඛනයේ දත්ත කියවීමට නොහැකි වීමට හේතු විය හැක.",
        details_desktop:
          "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටීමට උත්සාහ කරන්න. සෙලවීම රූපය අපැහැදිලි වී ලේඛනයේ දත්ත කියවීමට නොහැකි වීමට හේතු විය හැක.",
        title: "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටින්න",
        title_desktop: "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටින්න",
      },
      camera_lens: {
        details_desktop:
          "ඔබේ කැමරා කාචයේ පැල්ලම් හෝ දූවිලි ඇත්දැයි පරීක්ෂා කරන්න. කැමරා කාචය අපිරිසිදු වීම ඉන් ලබා ගන්නා අවසාන රූපය බොඳ වීමට හේතුව වන අතර, ඉන් ලේඛනයේ විස්තර කියවිය නොහැකි වී, දත්ත සාර්ථකව ස්කෑන් කිරීමට බාධා ඇති වේ.",
        title_desktop: "ඔබේ කැමරා කාචය පිරිසිදු කරන්න",
      },
      lighting: {
        details:
          "ඍජු රළු ආලෝකය ලේඛනයේ වැදී පරාවර්තනය වී ලේඛනයේ ඇති කොටස් කියවීමට නොහැකි විය හැකි බැවින් එය වළක්වා ගන්න. ඔබට ලේඛනයේ දත්ත කියවිය නොහැකි නම්, එය කැමරාවට ද දෘශ්‍යමාන නොවේ.",
        details_desktop:
          "ඍජු රළු ආලෝකය ලේඛනයේ වැදී පරාවර්තනය වී ලේඛනයේ ඇති කොටස් කියවීමට නොහැකි විය හැකි බැවින් එය වළක්වා ගන්න. ඔබට ලේඛනයේ දත්ත කියවිය නොහැකි නම්, එය කැමරාවට ද දෘශ්‍යමාන නොවේ.",
        title: "රළු ආලෝකය ගැන සැලකිලිමත් වන්න",
        title_desktop: "රළු ආලෝකය ගැන සැලකිලිමත් වන්න",
      },
      visibility: {
        details:
          "ඔබේ ඇඟිල්ලකින් බාර්කෝඩ් එකේ කොටස් ආවරණය නොවන බවට වග බලා ගන්න. එසේම බාර්කෝඩ් එකේ කොටස් කියවීම අපහසු කළ හැකි, ඒ මත ඇති වන පරාවර්තන පිළිබඳව අවධානයෙන් සිටින්න.",
        details_desktop:
          "ඔබේ ඇඟිල්ලකින් බාර්කෝඩ් එකේ කොටස් ආවරණය නොවන බවට වග බලා ගන්න. එසේම බාර්කෝඩ් එකේ කොටස් කියවීම අපහසු කළ හැකි, ඒ මත ඇති වන පරාවර්තන පිළිබඳව අවධානයෙන් සිටින්න.",
        title: "බාර්කෝඩ් එක පෙනෙන පරිදි තබා ගන්න",
        title_desktop: "බාර්කෝඩ් එක පෙනෙන පරිදි තබා ගන්න",
      },
    },
    document_with_mrz: {
      blur: {
        details:
          "ස්කෑන් කරන අතරතුර දුරකථනය සහ ලේඛනය නොසෙල්වෙන සේ තබා ගන්න. මින් එකක් හෝ සෙලවීම රූපය අපැහැදිලි වී ලේඛනයේ දත්ත කියවීමට නොහැකි වීමට හේතු විය හැක.",
        details_desktop:
          "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටීමට උත්සාහ කරන්න. සෙලවීම රූපය අපැහැදිලි වී ලේඛනයේ දත්ත කියවීමට නොහැකි වීමට හේතු විය හැක.",
        title: "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටින්න",
        title_desktop: "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටින්න",
      },
      camera_lens: {
        details_desktop:
          "ඔබේ කැමරා කාචයේ පැල්ලම් හෝ දූවිලි ඇත්දැයි පරීක්ෂා කරන්න. කැමරා කාචය අපිරිසිදු වීම ඉන් ලබා ගන්නා අවසාන රූපය බොඳ වීමට හේතුව වන අතර, ඉන් ලේඛනයේ විස්තර කියවිය නොහැකි වී, දත්ත සාර්ථකව ස්කෑන් කිරීමට බාධා ඇති වේ.",
        title_desktop: "ඔබේ කැමරා කාචය පිරිසිදු කරන්න",
      },
      lighting: {
        details:
          "ඍජු රළු ආලෝකය ලේඛනයේ වැදී පරාවර්තනය වී ලේඛනයේ ඇති කොටස් කියවීමට නොහැකි විය හැකි බැවින් එය වළක්වා ගන්න. ඔබට ලේඛනයේ දත්ත කියවිය නොහැකි නම්, එය කැමරාවට ද දෘශ්‍යමාන නොවේ.",
        details_desktop:
          "ඍජු රළු ආලෝකය ලේඛනයේ වැදී පරාවර්තනය වී ලේඛනයේ ඇති කොටස් කියවීමට නොහැකි විය හැකි බැවින් එය වළක්වා ගන්න. ඔබට ලේඛනයේ දත්ත කියවිය නොහැකි නම්, එය කැමරාවට ද දෘශ්‍යමාන නොවේ.",
        title: "රළු ආලෝකය ගැන සැලකිලිමත් වන්න",
        title_desktop: "රළු ආලෝකය ගැන සැලකිලිමත් වන්න",
      },
      visibility: {
        details:
          "ඔබේ ඇඟිල්ලකින් MRZ එකේ කොටස් ආවරණය නොවන බවට වග බලා ගන්න. එසේම බාර්කෝඩ් එකේ කොටස් කියවීම අපහසු කළ හැකි, ඒ මත ඇති වන පරාවර්තන පිළිබඳව අවධානයෙන් සිටින්න.",
        details_desktop:
          "ඔබේ ඇඟිල්ලකින් MRZ එකේ කොටස් ආවරණය නොවන බවට වග බලා ගන්න. එසේම බාර්කෝඩ් එකේ කොටස් කියවීම අපහසු කළ හැකි, ඒ මත ඇති වන පරාවර්තන පිළිබඳව අවධානයෙන් සිටින්න.",
        title: "MRZ එක පෙනෙන පරිදි තබා ගන්න",
        title_desktop: "MRZ එක පෙනෙන පරිදි තබා ගන්න",
      },
    },
    done_btn: "කළා",
    done_btn_aria: "ස්කෑන් කිරීම නැවත අරඹන්න",
    full_document: {
      blur: {
        details:
          "ස්කෑන් කරන අතරතුර දුරකථනය සහ ලේඛනය නොසෙල්වෙන සේ තබා ගන්න. මින් එකක් හෝ සෙලවීම රූපය අපැහැදිලි වී ලේඛනයේ දත්ත කියවීමට නොහැකි වීමට හේතු විය හැක.",
        details_desktop:
          "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටීමට උත්සාහ කරන්න. සෙලවීම රූපය අපැහැදිලි වී ලේඛනයේ දත්ත කියවීමට නොහැකි වීමට හේතු විය හැක.",
        title: "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටින්න",
        title_desktop: "ස්කෑන් කරන අතරතුර නොසෙල්වී සිටින්න",
      },
      camera_lens: {
        details_desktop:
          "ඔබේ කැමරා කාචයේ පැල්ලම් හෝ දූවිලි ඇත්දැයි පරීක්ෂා කරන්න. කැමරා කාචය අපිරිසිදු වීම ඉන් ලබා ගන්නා අවසාන රූපය බොඳ වීමට හේතුව වන අතර, ඉන් ලේඛනයේ විස්තර කියවිය නොහැකි වී, දත්ත සාර්ථකව ස්කෑන් කිරීමට බාධා ඇති වේ.",
        title_desktop: "ඔබේ කැමරා කාචය පිරිසිදු කරන්න",
      },
      lighting: {
        details:
          "ඍජු රළු ආලෝකය ලේඛනයේ වැදී පරාවර්තනය වී ලේඛනයේ ඇති කොටස් කියවීමට නොහැකි විය හැකි බැවින් එය වළක්වා ගන්න. ඔබට ලේඛනයේ දත්ත කියවිය නොහැකි නම්, එය කැමරාවට ද දෘශ්‍යමාන නොවේ.",
        details_desktop:
          "ඍජු රළු ආලෝකය ලේඛනයේ වැදී පරාවර්තනය වී ලේඛනයේ ඇති කොටස් කියවීමට නොහැකි විය හැකි බැවින් එය වළක්වා ගන්න. ඔබට ලේඛනයේ දත්ත කියවිය නොහැකි නම්, එය කැමරාවට ද දෘශ්‍යමාන නොවේ.",
        title: "රළු ආලෝකය ගැන සැලකිලිමත් වන්න",
        title_desktop: "රළු ආලෝකය ගැන සැලකිලිමත් වන්න",
      },
      visibility: {
        details:
          "ඔබේ ඇඟිල්ලකින් ලේඛනයේ පහළ ඇති රේඛා ඇතුළු කොටස් ආවරණය නොවන බවට වග බලා ගන්න. එසේම ලේඛනයේ කොටස් මත ඇතිවන හොලෝග්‍රෑම් පරාවර්තන පිළිබඳව ද අවධානයෙන් සිටින්න.",
        details_desktop:
          "ඔබේ ඇඟිල්ලකින් ලේඛනයේ පහළ ඇති රේඛා ඇතුළු කොටස් ආවරණය නොවන බවට වග බලා ගන්න. එසේම ලේඛනයේ කොටස් මත ඇතිවන හොලෝග්‍රෑම් පරාවර්තන පිළිබඳව ද අවධානයෙන් සිටින්න.",
        title: "සියලු කොටස් හොඳින් පෙනෙන පරිදි තබා ගන්න",
        title_desktop: "සියලු කොටස් හොඳින් පෙනෙන පරිදි තබා ගන්න",
      },
    },
    next_btn: "ඊලඟ",
  },
  onboarding_modal: {
    aria: "ස්කෑන් කිරීමට උපදෙස්",
    barcode_only: {
      details:
        "බාර්කෝඩ් එකක් (කළු රේඛා පෙළක් හෝ සමචතුරශ්‍රාකාර කේතයක්) ඇති තැන සොයා ගන්න. ඔබේ කැමරාව ඒ වෙත යොමු කර නොසොල්වා තබා ගන්න — එය ස්වයංක්‍රීයව ස්කෑන් වනු ඇත",
      details_desktop:
        "බාර්කෝඩ් එකක් (කළු රේඛා පෙළක් හෝ සමචතුරශ්‍රාකාර කේතයක්) ඇති තැන සොයා ගන්න. ඔබේ කැමරා කාචය පිරිසිදුව ඇති බවත් බාර්කෝඩ් එකට හොඳින් ආලෝකය වැටෙන බවත් සහතික කර ගන්න.",
      title: "බාර්කෝඩ් එක ඇති තැන සොයාගෙන එය ස්කෑන් කරන්න",
      title_desktop: "ඔබේ කැමරා කාචය පිරිසිදු කර බාර්කෝඩ් එක ඇති තැන සොයා ගන්න",
    },
    btn: "ස්කෑන් කිරීම ආරම්භ කරන්න",
    document_with_barcode: {
      details:
        "විවිධ වර්ගයේ ලේඛනවල විවිධ බාර්කෝඩ් ආකෘති තිබිය හැකි අතර, එය තිබෙන ස්ථානය ද වෙනස් විය හැක. බාර්කෝඩ් එකක් සොයා ගැනීමට ලේඛනයේ ඉදිරිපස සහ පිටුපස බලන්න.",
      details_desktop:
        "ලේඛනයේ ඉදිරි සහ පිටුපස පැත්තේ බාර්කෝඩ් එකක් ඇත්දැයි පරීක්ෂා කරන්න. ඔබේ කැමරා කාචය පිරිසිදුව ඇති බවත්, බාර්කෝඩ් එකට හොඳින් ආලෝකය වැටෙන බවත් සහතික කර ගන්න.",
      title: "ලේඛනයේ බාර්කෝඩ් එක ඇති තැන සොයා ගන්න",
      title_desktop: "ඔබේ කැමරා කාචය පිරිසිදු කර බාර්කෝඩ් එක ඇති තැන සොයා ගන්න",
    },
    document_with_mrz: {
      details:
        "ලේඛනයේ ඉදිරිපස හෝ පිටුපස පැත්තේ පතුලේ, ඔබට ඊතල (<< හෝ >>) මගින් වෙන් වූ පේළි 2 කට හෝ 3 කට බෙදුණු දිගු අක්ෂර මාලාවක් දක්නට ලැබෙනු ඇත.",
      details_desktop:
        "ලේඛනයේ ඉදිරිපස සහ පසුපස MRZ ඇත්දැයි පරීක්ෂා කරන්න. ලේඛනයේ පතුලේ පේළි 2 ක හෝ 3 ක අකුරු සහ ඊතල සංකේත (<<) ඇත්දැයි බලන්න. ඔබේ කැමරා කාචය පිරිසිදුව ඇති බවත්, ලේඛනයට හොඳින් ආලෝකය වැටෙන බවත් සහතික කර ගන්න.",
      title: "ලේඛනයේ MRZ එක ඇති තැන සොයා ගන්න",
      title_desktop: "ඔබේ කැමරා කාචය පිරිසිදු කර MRZ එක ඇති තැන සොයා ගන්න",
    },
    full_document: {
      details:
        "ලේඛනයට හොඳින් ආලෝකය වැටෙන පරිදි තබා ගැනීමට වග බලා ගන්න. ලේඛනයේ සියලුම කොටස් කැමරා තිරය මත දෘශ්‍යමාන විය යුතු ය.",
      details_desktop:
        "ඔබේ කැමරා කාචය පිරිසිදුවත්, ලේඛනයට හොඳින් ආලෝකය වැටෙන පරිදි තබා ගැනීමටත් වග බලා ගන්න. ලේඛනයේ සියලුම කොටස් කැමරා තිරය මත දෘශ්‍යමාන විය යුතු ය.",
      title: "සියලු විස්තර පෙනෙන පරිදි තබා ගන්න",
      title_desktop: "ස්කෑන් කිරීමට සූදානම් වන්න",
    },
  },
  sdk_aria: "ලේඛන ස්කෑන් කිරීමේ තිරය",
  timeout_modal: {
    details:
      "ලේඛනයට හොඳින් ආලෝකය වැටෙන බවත්, සම්පූර්ණයෙන් පෙනෙන බවත්, දිලිසීමෙන් තොර බවත් සහතික කර ගන්න.",
    details_desktop:
      "ඔබේ කැමරා කාචය පිරිසිදුව ඇති බවත්, ලේඛනය සම්පූර්ණයෙන් පෙනෙන පරිදි නාභිගත වී ඇති බවත්, හොඳින් ආලෝකය වැටෙන බවත් සහතික කර ගන්න.",
    title: "ලේඛනය කියවිය නොහැක",
  },
} as const;
