/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for th.
 */
export default {
  document_filtered_modal: {
    details: "ลองสแกนเอกสารอย่างอื่นดู",
    title: "ไม่รองรับเอกสารนี้",
  },
  document_not_recognized_modal: {
    details: "สแกนด้านหน้าของเอกสารที่ได้รับการรองรับ",
    title: "ไม่รู้จักเอกสาร",
  },
  error_modal: { cancel_btn: "ยกเลิก", retry_btn: "ลองอีกครั้ง" },
  feedback_messages: {
    blur_detected: "ประคองให้เอกสารและโทรศัพท์อยู่นิ่ง ๆ",
    camera_angle_too_steep: "จัดเอกสารให้ขนานกับโทรศัพท์",
    document_scanned_aria: "สำเร็จ! สแกนเอกสารแล้ว",
    document_too_close_to_edge: "เลื่อนออกห่าง",
    face_photo_not_fully_visible: "ถ่ายให้เห็นรูปภาพใบหน้าอย่างชัดเจน",
    flip_document: "พลิกเอกสาร",
    flip_to_back_side: "พลิกเอกสาร",
    front_side_scanned_aria: "สำเร็จ! สแกนด้านหน้าแล้ว",
    glare_detected: "เอียงหรือย้ายเอกสารเพื่อลบแสงสะท้อน",
    keep_document_parallel: "จัดเอกสารให้ขนานกับหน้าจอ",
    keep_document_still: "จับเอกสารและอุปกรณ์ให้นิ่ง",
    keep_still: "ถือนิ่งๆ",
    move_closer: "เลื่อนเข้าใกล้",
    move_farther: "เลื่อนออกห่าง",
    move_left: "ย้ายไปยังหน้าทางด้านซ้าย",
    move_right: "ย้ายไปหน้าขวามือ",
    move_top: "ย้ายไปยังหน้าที่อยู่บนสุด",
    occluded: "ทำให้สามารถเห็นเอกสารเต็มขั้นตลอด",
    scan_data_page: "สแกนหน้าข้อมูลของเอกสาร",
    scan_last_page_barcode: "สแกนบาร์โค้ดที่หน้าสุดท้าย",
    scan_left_page: "สแกนหน้าด้านซ้าย",
    scan_right_page: "สแกนหน้าด้านขวา",
    scan_the_back_side: "สแกนด้านหลังของเอกสาร",
    scan_the_barcode: "สแกนบาร์โค้ด",
    scan_the_barcode_side: "สแกนด้านบาร์โค้ดของเอกสาร",
    scan_the_front_side: "สแกนด้านหน้าของเอกสาร",
    scan_top_page: "สแกนหน้าบนสุด",
    too_bright: "ย้ายไปยังจุดที่มีแสงสว่างน้อยกว่า",
    too_dark: "ย้ายไปยังจุดที่สว่างกว่า",
    wrong_left: "ย้ายไปยังหน้าด้านซ้าย",
    wrong_right: "ย้ายไปยังหน้าด้านขวา",
    wrong_top: "ย้ายไปยังหน้าบนสุด",
  },
  help_button: { aria_label: "ช่วยเหลือ", tooltip: "ต้องการความช่วยเหลือ?" },
  help_modal: {
    aria: "ความช่วยเหลือในการสแกน",
    back_btn: "ย้อนกลับ",
    barcode_only: {
      blur: {
        details:
          "พยายามถือโทรศัพท์และบาร์โค้ดให้นิ่งขณะสแกน การเคลื่อนไหวอาจทำให้ภาพพร่ามัวและทำให้อ่านข้อมูลบาร์โค้ดไม่ออก",
        details_desktop:
          "พยายามถือให้นิ่งขณะสแกน การเคลื่อนไหวอาจทำให้ภาพพร่ามัวและทำให้อ่านข้อมูลบาร์โค้ดไม่ออก",
        title: "ถือนิ่งๆ ขณะสแกน",
        title_desktop: "ถือนิ่งๆ ขณะสแกน",
      },
      camera_lens: {
        details_desktop:
          "ตรวจสอบว่าเลนส์กล้องมีรอยเปื้อนหรือฝุ่นหรือไม่ เลนส์ที่ไม่สะอาดจะส่งผลให้รูปภาพเบลอ ทำให้อ่านข้อมูลบาร์โค้ดไม่ออก และไม่สามารถสแกนบัตรได้โดยสำเร็จ",
        title_desktop: "ทำความสะอาดเลนส์กล้องของคุณ",
      },
      lighting: {
        details:
          "หลีกเลี่ยงแสงจ้าที่ส่องตรงๆ เพราะแสงสะท้อนบนบาร์โค้ดอาจทำให้สแกนไม่ได้ หากคุณเห็นว่าบาร์โค้ดไม่ชัดเจน กล้องก็อาจจะมองไม่เห็นเช่นกัน",
        details_desktop:
          "หลีกเลี่ยงแสงจ้าที่ส่องตรงๆ เพราะแสงสะท้อนบนบาร์โค้ดอาจทำให้สแกนไม่ได้ หากคุณเห็นว่าบาร์โค้ดไม่ชัดเจน กล้องก็อาจจะมองไม่เห็นเช่นกัน",
        title: "ระวังแสงจ้า",
        title_desktop: "ระวังแสงจ้า",
      },
      visibility: {
        details:
          "ตรวจสอบให้แน่ใจว่าคุณไม่ได้ใช้นิ้วบังส่วนต่างๆ ของบาร์โค้ด นอกจากนี้ ระวังแสงสะท้อนบนบาร์โค้ดและอาจทำให้ไม่สามารถอ่านได้",
        details_desktop:
          "ตรวจสอบให้แน่ใจว่าคุณไม่ได้ใช้นิ้วบังส่วนต่างๆ ของบาร์โค้ด นอกจากนี้ ระวังแสงสะท้อนบนบาร์โค้ดและอาจทำให้ไม่สามารถอ่านได้",
        title: "ทำให้บาร์โค้ดมองเห็นได้ชัดเจน",
        title_desktop: "ทำให้บาร์โค้ดมองเห็นได้ชัดเจน",
      },
    },
    document_with_barcode: {
      blur: {
        details:
          "ถือโทรศัพท์และวางเอกสารไว้นิ่งๆ ขณะสแกน การเคลื่อนไหวอาจทำให้ภาพพร่ามัวและทำให้ข้อมูลบนเอกสารอ่านไม่ออก",
        details_desktop:
          "ถือไว้นิ่งๆ ขณะสแกน การเคลื่อนไหวอาจทำให้ภาพพร่ามัวและทำให้ข้อมูลบนเอกสารอ่านไม่ออก",
        title: "ถือนิ่งๆ ขณะสแกน",
        title_desktop: "ถือนิ่งๆ ขณะสแกน",
      },
      camera_lens: {
        details_desktop:
          "ตรวจสอบเลนส์กล้องว่ามีคราบรอยเปื้อนหรือฝุ่นหรือไม่ เลนส์ที่สกปรกจะทำให้ภาพสุดท้ายเบลอ ทำให้รายละเอียดบนเอกสารไม่สามารถอ่านได้ และทำให้ไม่สามารถสแกนข้อมูลได้สำเร็จ",
        title_desktop: "ทำความสะอาดเลนส์กล้องของคุณ",
      },
      lighting: {
        details:
          "หลีกเลี่ยงแสงจ้าที่ส่องตรงๆ เพราะแสงสะท้อนจากเอกสารและเอกสารอ่านไม่ออกบางส่วนได้ หากคุณอ่านข้อมูลบนเอกสารไม่ได้ กล้องก็จะมองไม่เห็นเช่นกัน",
        details_desktop:
          "หลีกเลี่ยงแสงจ้าที่ส่องตรงๆ เพราะแสงสะท้อนจากเอกสารและเอกสารอ่านไม่ออกบางส่วนได้ หากคุณอ่านข้อมูลบนเอกสารไม่ได้ กล้องก็จะมองไม่เห็นเช่นกัน",
        title: "ระวังแสงจ้า",
        title_desktop: "ระวังแสงจ้า",
      },
      visibility: {
        details:
          "ตรวจสอบให้แน่ใจว่าคุณไม่ได้ใช้นิ้วบังส่วนต่างๆ ของบาร์โค้ด นอกจากนี้ ระวังแสงสะท้อนบนบาร์โค้ดและอาจทำให้ไม่สามารถอ่านได้",
        details_desktop:
          "ตรวจสอบให้แน่ใจว่าคุณไม่ได้ใช้นิ้วบังส่วนต่างๆ ของบาร์โค้ด นอกจากนี้ ระวังแสงสะท้อนบนบาร์โค้ดและอาจทำให้ไม่สามารถอ่านได้",
        title: "ทำให้บาร์โค้ดมองเห็นได้ชัดเจน",
        title_desktop: "ทำให้บาร์โค้ดมองเห็นได้ชัดเจน",
      },
    },
    done_btn: "เสร็จสิ้น",
    done_btn_aria: "สแกนต่อ",
    full_document: {
      blur: {
        details:
          "ถือโทรศัพท์และวางเอกสารไว้นิ่งๆ ขณะสแกน การเคลื่อนไหวอาจทำให้ภาพพร่ามัวและทำให้ข้อมูลบนเอกสารอ่านไม่ออก",
        details_desktop:
          "ถือไว้นิ่งๆ ขณะสแกน การเคลื่อนไหวอาจทำให้ภาพพร่ามัวและทำให้ข้อมูลบนเอกสารอ่านไม่ออก",
        title: "ถือนิ่งๆ ขณะสแกน",
        title_desktop: "ถือนิ่งๆ ขณะสแกน",
      },
      camera_lens: {
        details_desktop:
          "ตรวจสอบเลนส์กล้องว่ามีคราบรอยเปื้อนหรือฝุ่นหรือไม่ เลนส์ที่สกปรกจะทำให้ภาพสุดท้ายเบลอ ทำให้รายละเอียดบนเอกสารไม่สามารถอ่านได้ และทำให้ไม่สามารถสแกนข้อมูลได้สำเร็จ",
        title_desktop: "ทำความสะอาดเลนส์กล้องของคุณ",
      },
      lighting: {
        details:
          "หลีกเลี่ยงแสงจ้าที่ส่องตรงๆ เพราะแสงสะท้อนจากเอกสารและเอกสารอ่านไม่ออกบางส่วนได้ หากคุณอ่านข้อมูลบนเอกสารไม่ได้ กล้องก็จะมองไม่เห็นเช่นกัน",
        details_desktop:
          "หลีกเลี่ยงแสงจ้าที่ส่องตรงๆ เพราะแสงสะท้อนจากเอกสารและเอกสารอ่านไม่ออกบางส่วนได้ หากคุณอ่านข้อมูลบนเอกสารไม่ได้ กล้องก็จะมองไม่เห็นเช่นกัน",
        title: "ระวังแสงจ้า",
        title_desktop: "ระวังแสงจ้า",
      },
      visibility: {
        details:
          "ตรวจสอบให้แน่ใจว่านิ้วของคุณไม่ได้บังส่วนใดของเอกสาร รวมถึงบรรทัดล่างสุด นอกจากนี้ ระวังแสงสะท้อนของโฮโลแกรมที่จะทับส่วนต่างๆ ของเอกสารด้วย",
        details_desktop:
          "ตรวจสอบให้แน่ใจว่านิ้วของคุณไม่ได้บังส่วนใดของเอกสาร รวมถึงบรรทัดล่างสุด นอกจากนี้ ระวังแสงสะท้อนของโฮโลแกรมที่จะทับส่วนต่างๆ ของเอกสารด้วย",
        title: "สังเกตว่าทุกส่วนมองเห็นได้ชัด",
        title_desktop: "สังเกตว่าทุกส่วนมองเห็นได้ชัด",
      },
    },
    next_btn: "ถัดไป",
  },
  onboarding_modal: {
    aria: "คำแนะนำในการสแกน",
    barcode_only: {
      details:
        "หาบาร์โค้ด (กลุ่มเส้นหลายๆ ขีดหรือรหัสแบบสี่เหลี่ยม) ส่องกล้องของคุณที่บาร์โค้ดแล้วถือไว้นิ่งๆ การสแกนจะเริ่มโดยอัตโนมัติ",
      details_desktop:
        "หาบาร์โค้ด (กลุ่มเส้นหลายๆ ขีดหรือรหัสแบบสี่เหลี่ยม) ตรวจสอบว่าเลนส์กล้องของคุณสะอาดและสามารถมองเห็นรหัสบาร์โค้ดได้ชัดเจนดี",
      title: "หาและสแกนบาร์โค้ด",
      title_desktop: "ทำความสะอาดเลนส์กล้องของคุณและหาบาร์โค้ด",
    },
    btn: "เริ่มการสแกน",
    document_with_barcode: {
      details:
        "บัตรประจำตัวต่างๆ อาจมีรูปแบบบาร์โค้ดและตำแหน่งที่แตกต่างกัน ดูบาร์โค้ดที่ด้านหน้าและด้านหลังบัตรประจำตัว",
      details_desktop:
        "ตรวจสอบด้านหน้าและด้านหลังของบัตรประจำตัวว่ามีบาร์โค้ดหรือไม่ ตรวจสอบว่าเลนส์กล้องของคุณสะอาดและสามารถมองเห็นรหัสบาร์โค้ดได้ชัดเจนดี",
      title: "หาบาร์โค้ดบนบัตรประจำตัว",
      title_desktop: "ทำความสะอาดเลนส์กล้องของคุณและหาบาร์โค้ด",
    },
    full_document: {
      details:
        "ตรวจสอบว่าเอกสารของคุณมีแสงสว่างเพียงพอ คุณควรมองเห็นทุกส่วนของเอกสารบนหน้าจอกล้อง",
      details_desktop:
        "ตรวจสอบให้แน่ใจว่าเลนส์กล้องสะอาดและเอกสารมีแสงสว่างเพียงพอ ช่องข้อมูลทั้งหมดของเอกสารควรมองเห็นได้ชัดเจนบนหน้าจอกล้อง",
      title: "สังเกตว่ารายละเอียดมองเห็นได้ชัด",
      title_desktop: "เตรียมพร้อมสำหรับการสแกน",
    },
  },
  sdk_aria: "หน้าจอสแกนเอกสาร",
  timeout_modal: {
    details: "ไม่สามารถอ่านเอกสาร โปรดลองอีกครั้ง",
    title: "สแกนไม่สำเร็จ",
  },
} as const;
