/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for uk.
 */
export default {
  document_filtered_modal: {
    details: "Спробуйте відсканувати інший документ.",
    title: "Документ не прийнято",
  },
  document_not_recognized_modal: {
    details: "Відскануйте лицьову сторону підтримуваного документа.",
    title: "Документ не розпізнано",
  },
  error_modal: { cancel_btn: "Скасувати", retry_btn: "Повторити спробу" },
  feedback_messages: {
    blur_detected: "Тримайте документ і телефон нерухомо",
    camera_angle_too_steep: "Тримайте документ паралельно телефону",
    document_scanned_aria: "Готово! Документ відскановано.",
    document_too_close_to_edge: "Віддаляйтесь",
    face_photo_not_fully_visible: "Тримайте фото обличчя повністю видимим",
    flip_document: "Переверніть документ",
    flip_to_back_side: "Переверніть на зворотній бік",
    front_side_scanned_aria: "Готово! Передній бік відскановано.",
    glare_detected: "Нахиліть або перемістіть документ, щоб прибрати відблиск",
    keep_document_parallel: "Тримайте документ паралельно екрану",
    keep_still: "Не рухайтеся",
    move_closer: "Наблизьтесь",
    move_farther: "Віддаляйтесь",
    move_left: "Перейдіть на сторінку ліворуч",
    move_right: "Перейдіть на сторінку праворуч",
    move_top: "Перейдіть на верхню сторінку",
    occluded: "Тримайте документ повністю у полі зору",
    scan_data_page: "Відскануйте сторінку з даними документа",
    scan_last_page_barcode: "Відскануйте штрихкод з останньої сторінки",
    scan_left_page: "Відскануйте ліву сторінку",
    scan_right_page: "Відскануйте праву сторінку",
    scan_the_back_side: "Скануйте зворотній бік документа",
    scan_the_barcode: "Відскануйте штрих-код",
    scan_the_barcode_side: "Відскануйте сторону документа зі штрих-кодом",
    scan_the_front_side: "Відскануйте лицьову сторону документа",
    scan_the_mrz_side: "Відскануйте сторону документа з MRZ",
    scan_top_page: "Відскануйте верхню сторінку",
    too_bright: "Перейдіть у місце з менш яскравим освітленням",
    too_dark: "Перейдіть у більш освітлене місце",
    wrong_left: "Перейдіть на ліву сторінку",
    wrong_right: "Перейдіть на праву сторінку",
    wrong_top: "Перейдіть на верхню сторінку",
  },
  help_button: { aria_label: "Допомога", tooltip: "Потрібна допомога?" },
  help_modal: {
    aria: "Допомога зі скануванням",
    back_btn: "Назад",
    barcode_only: {
      blur: {
        details:
          "Під час сканування намагайтеся тримати телефон і штрих-код нерухомими. Рух одного з них може розмити зображення та ускладнити зчитування штрих-коду.",
        details_desktop:
          "Під час сканування намагайтеся не рухатися. Рух може розмити зображення та ускладнити зчитування штрих-коду.",
        title: "Не рухайтеся під час сканування",
        title_desktop: "Не рухайтеся під час сканування",
      },
      camera_lens: {
        details_desktop:
          "Перевірте об'єктив камери на наявність плям або пилу. Брудний об'єктив призводить до розмиття кінцевого зображення, що робить штрих-код нечитабельним і заважає успішному скануванню даних.",
        title_desktop: "Очистіть об'єктив камери",
      },
      lighting: {
        details:
          "Уникайте прямого яскравого світла, оскільки воно може створювати відблиски на штрих-коді й ускладнювати його сканування. Якщо штрих-код чітко не видно вам, камера також може не зчитати його.",
        details_desktop:
          "Уникайте прямого яскравого світла, оскільки воно може створювати відблиски на штрих-коді й ускладнювати його сканування. Якщо штрих-код чітко не видно вам, камера також може не зчитати його.",
        title: "Обережно з яскравим світлом",
        title_desktop: "Обережно з яскравим світлом",
      },
      visibility: {
        details:
          "Переконайтеся, що ви не закриваєте частини штрих-коду пальцем. Також стежте за відблисками, які перекривають штрих-код і можуть зробити його нечитабельним.",
        details_desktop:
          "Переконайтеся, що ви не закриваєте частини штрих-коду пальцем. Також стежте за відблисками, які перекривають штрих-код і можуть зробити його нечитабельним.",
        title: "Тримайте штрих-код повністю видимим",
        title_desktop: "Тримайте штрих-код повністю видимим",
      },
    },
    document_with_barcode: {
      blur: {
        details:
          "Намагайтеся тримати телефон і документ нерухомо під час сканування. Рух одного з них може розмити зображення та зробити дані на документі нечитабельними.",
        details_desktop:
          "Під час сканування намагайтеся тримати телефон і документ нерухомо. Рух одного з них може розмити зображення та зробити дані на документі нечитабельними.",
        title: "Не рухайтеся під час сканування",
        title_desktop: "Не рухайтеся під час сканування",
      },
      camera_lens: {
        details_desktop:
          "Перевірте об'єктив камери на наявність плям або пилу. Брудний об'єктив призводить до розмиття кінцевого зображення, що робить деталі документу нечитабельними та заважає успішному скануванню даних.",
        title_desktop: "Очистіть об'єктив камери",
      },
      lighting: {
        details:
          "Уникайте прямого яскравого світла, адже воно відбивається від документа і може зробити частини документа нечитабельними. Якщо ви не можете прочитати дані на документі, камера їх також не зчитає.",
        details_desktop:
          "Уникайте прямого яскравого світла, адже воно відбивається від документа і може зробити частини документа нечитабельними. Якщо ви не можете прочитати дані на документі, камера їх також не зчитає.",
        title: "Обережно з яскравим світлом",
        title_desktop: "Обережно з яскравим світлом",
      },
      visibility: {
        details:
          "Переконайтеся, що ви не закриваєте частини штрих-коду пальцем. Також стежте за відблисками, які перекривають штрих-код і можуть зробити його нечитабельним.",
        details_desktop:
          "Переконайтеся, що ви не закриваєте частини штрих-коду пальцем. Також стежте за відблисками, які перекривають штрих-код і можуть зробити його нечитабельним.",
        title: "Тримайте штрих-код повністю видимим",
        title_desktop: "Тримайте штрих-код повністю видимим",
      },
    },
    document_with_mrz: {
      blur: {
        details:
          "Намагайтеся тримати телефон і документ нерухомо під час сканування. Рух одного з них може розмити зображення та зробити дані на документі нечитабельними.",
        details_desktop:
          "Під час сканування намагайтеся тримати телефон і документ нерухомо. Рух одного з них може розмити зображення та зробити дані на документі нечитабельними.",
        title: "Не рухайтеся під час сканування",
        title_desktop: "Не рухайтеся під час сканування",
      },
      camera_lens: {
        details_desktop:
          "Перевірте об'єктив камери на наявність плям або пилу. Брудний об'єктив призводить до розмиття кінцевого зображення, що робить деталі документу нечитабельними та заважає успішному скануванню даних.",
        title_desktop: "Очистіть об'єктив камери",
      },
      lighting: {
        details:
          "Уникайте прямого яскравого світла, адже воно відбивається від документа і може зробити частини документа нечитабельними. Якщо ви не можете прочитати дані на документі, камера їх також не зчитає.",
        details_desktop:
          "Уникайте прямого яскравого світла, адже воно відбивається від документа і може зробити частини документа нечитабельними. Якщо ви не можете прочитати дані на документі, камера їх також не зчитає.",
        title: "Обережно з яскравим світлом",
        title_desktop: "Обережно з яскравим світлом",
      },
      visibility: {
        details:
          "Переконайтеся, що ви не закриваєте частини MRZ пальцем. Також стежте за відблисками, які перекривають MRZ і можуть зробити його нечитабельним.",
        details_desktop:
          "Переконайтеся, що ви не закриваєте частини MRZ пальцем. Також стежте за відблисками, які перекривають MRZ і можуть зробити його нечитабельним.",
        title: "Тримайте MRZ повністю видимим",
        title_desktop: "Тримайте MRZ повністю видимим",
      },
    },
    done_btn: "Готово",
    done_btn_aria: "Відновити сканування",
    full_document: {
      blur: {
        details:
          "Намагайтеся тримати телефон і документ нерухомо під час сканування. Рух одного з них може розмити зображення та зробити дані на документі нечитабельними.",
        details_desktop:
          "Під час сканування намагайтеся тримати телефон і документ нерухомо. Рух одного з них може розмити зображення та зробити дані на документі нечитабельними.",
        title: "Не рухайтеся під час сканування",
        title_desktop: "Не рухайтеся під час сканування",
      },
      camera_lens: {
        details_desktop:
          "Перевірте об'єктив камери на наявність плям або пилу. Брудний об'єктив призводить до розмиття кінцевого зображення, що робить деталі документу нечитабельними та заважає успішному скануванню даних.",
        title_desktop: "Очистіть об'єктив камери",
      },
      lighting: {
        details:
          "Уникайте прямого яскравого світла, адже воно відбивається від документа і може зробити частини документа нечитабельними. Якщо ви не можете прочитати дані на документі, камера їх також не зчитає.",
        details_desktop:
          "Уникайте прямого яскравого світла, адже воно відбивається від документа і може зробити частини документа нечитабельними. Якщо ви не можете прочитати дані на документі, камера їх також не зчитає.",
        title: "Обережно з яскравим світлом",
        title_desktop: "Обережно з яскравим світлом",
      },
      visibility: {
        details:
          "Переконайтеся, що ви не закриваєте частини документа пальцем, зокрема нижні рядки. Також стежте за відблисками від голограм, які перекривають поля документа.",
        details_desktop:
          "Переконайтеся, що ви не закриваєте частини документа пальцем, зокрема нижні рядки. Також стежте за відблисками від голограм, які перекривають поля документа.",
        title: "Тримайте всі поля видимими",
        title_desktop: "Тримайте всі поля видимими",
      },
    },
    next_btn: "Далі",
  },
  onboarding_modal: {
    aria: "Інструкції щодо сканування",
    barcode_only: {
      details:
        "Знайдіть штрих-код (ряд чорних ліній або квадратний код). Наведіть на нього камеру й тримайте нерухомо — сканування відбудеться автоматично.",
      details_desktop:
        "Знайдіть штрих-код (ряд чорних ліній або квадратний код). Переконайтеся, що об'єктив камери чистий, а документ добре освітлений.",
      title: "Знайдіть і відскануйте штрих-код",
      title_desktop: "Очистьте об’єктив і знайдіть штрих-код",
    },
    btn: "Почати сканування",
    document_with_barcode: {
      details:
        "Різні типи документів можуть мати різні формати та розташування штрих-коду. Щоб знайти штрих-код, перегляньте лицьовий та зворотний бік документа.",
      details_desktop:
        "Перевірте передню та задню сторони документа на наявність штрих-коду. Переконайтеся, що об'єктив камери чистий, а документ добре освітлений.",
      title: "Знайдіть штрих-код на документі",
      title_desktop: "Очистьте об’єктив і знайдіть штрих-код",
    },
    document_with_mrz: {
      details:
        "Ви знайдете довгий рядок символів внизу передньої або задньої сторони документа, розділений на 2 або 3 рядки та відокремлений стрілками (<< або >>).",
      details_desktop:
        "Перевірте передню та задню сторони посвідчення особи на наявність MRZ. Шукайте 2–3 рядки символів та символи стрілок (<<) внизу документа. Переконайтеся, що об'єктив камери чистий, а документ добре освітлений.",
      title: "Знайдіть MRZ на документі",
      title_desktop: "Очистьте об’єктив і знайдіть MRZ",
    },
    full_document: {
      details:
        "Переконайтеся, що документ добре освітлений. Усі поля документа мають бути видимими на екрані камери.",
      details_desktop:
        "Переконайтеся, що об'єктив камери чистий, а документ добре освітлений. Усі поля документа мають бути видимими на екрані камери.",
      title: "Тримайте всі деталі видимими",
      title_desktop: "Підготуйтеся до сканування",
    },
  },
  sdk_aria: "Екран сканування документів",
  timeout_modal: {
    details:
      "Переконайтеся, що документ добре освітлений, повністю видимий та без відблисків.",
    details_desktop:
      "Переконайтеся, що об’єктив камери чистий, що документ повністю видно, що він у фокусі та добре освітлений.",
    title: "Не вдалося зчитати документ",
  },
} as const;
