/**
 * Copyright (c) 2026 Microblink Ltd. All rights reserved.
 */

/**
 * Localization strings for ur.
 */
export default {
  document_filtered_modal: {
    details: "کسی اور دستاویز کو اسکین کرنے کی کوشش کریں۔",
    title: "دستاویز قبول نہیں کی گئی",
  },
  document_not_recognized_modal: {
    details: "معاونت یافتہ دستاویز کے سامنے والے حصے کو اسکین کریں۔",
    title: "دستاویز شناخت نہیں ہوئی",
  },
  error_modal: { cancel_btn: "منسوخ کریں", retry_btn: "دوبارہ کوشش کریں" },
  feedback_messages: {
    blur_detected: "دستاویز اور فون کو ساکن رکھیں",
    camera_angle_too_steep: "دستاویز کو فون کے متوازی رکھیں",
    document_scanned_aria: "کامیابی! دستاویز اسکین ہو گئی ہے",
    document_too_close_to_edge: "اور دور جائیں",
    face_photo_not_fully_visible: "چہرے کی تصویر کو مکمل طور پر نمایاں رکھیں",
    flip_document: "دستاویز کو پلٹیں",
    flip_to_back_side: "پچھلے حصے کی طرف پلٹیں",
    front_side_scanned_aria: "کامیابی! سامنے کا رخ اسکین ہو گیا ہے",
    glare_detected: "عکس ختم کرنے کے لئے دستاویز کو جھکائیں یا حرکت دیں",
    keep_document_parallel: "دستاویز کو سکرین کے متوازی رکھیں",
    keep_still: "ساکن رہیں",
    move_closer: "اور قریب جائیں",
    move_farther: "اور دور جائیں",
    move_left: "بائیں جانب والے صفحے پر جائیں",
    move_right: "دائیں جانب والے صفحے پر جائیں",
    move_top: "اوپر والے صفحے پر جائیں",
    occluded: "دستاویز کو مکمل طور پر نمایاں رکھیں",
    scan_data_page: "دستاویز کے ڈیٹا صفحہ کو اسکین کریں",
    scan_last_page_barcode: "آخری صفحے سے بارکوڈ کو اسکین کریں",
    scan_left_page: "بائیں صفحے کو اسکین کریں",
    scan_right_page: "دائیں صفحے کو اسکین کریں",
    scan_the_back_side: "دستاویز کے پچھلے حصے کو اسکین کریں",
    scan_the_barcode: "بار کوڈ اسکین کریں",
    scan_the_barcode_side: "دستاویز کی بار کوڈ والی سائیڈ اسکین کریں",
    scan_the_front_side: "دستاویز کے سامنے والے حصے کو اسکین کریں",
    scan_the_mrz_side: "دستاویز کے MRZ والے رخ کو اسکین کریں",
    scan_top_page: "اوپری صفحے کو اسکین کریں",
    too_bright: "کم روشنی والی جگہ پر جائیں",
    too_dark: "زیادہ روشن جگہ پر جائیں",
    wrong_left: "بائیں صفحے پر جائیں",
    wrong_right: "دائیں صفحے پر جائیں",
    wrong_top: "اوپری صفحے پر جائیں",
  },
  help_button: { aria_label: "مدد", tooltip: "مدد چاہیے؟" },
  help_modal: {
    aria: "اسکیننگ میں مدد",
    back_btn: "پیچھے",
    barcode_only: {
      blur: {
        details:
          "اسکین کرتے وقت فون اور بار کوڈ دونوں کو ساکن رکھنے کی کوشش کریں۔ ان میں سے کسی ایک کی بھی حرکت تصویر کو دھندلا کر سکتی ہے اور بار کوڈ پڑھنے میں دشواری پیش آ سکتی ہے۔",
        details_desktop:
          "اسکین کرتے وقت ساکن رہنے کی کوشش کریں۔ حرکت کرنے سے تصویر دھندلی ہو سکتی ہے اور بار کوڈ پڑھنے میں دشواری پیش آ سکتی ہے۔",
        title: "اسکین کرتے وقت ساکن رہیں",
        title_desktop: "اسکین کرتے وقت ساکن رہیں",
      },
      camera_lens: {
        details_desktop:
          "اپنے کیمرے کے لینز پر دھبوں یا گردوغبار کو چیک کریں۔ گندا لینز تصویر کو دھندلا کر دیتا ہے، جس کی وجہ سے بار کوڈ پڑھا نہیں جاتا اور ڈیٹا کامیابی سے اسکین نہیں ہو پاتا۔",
        title_desktop: "اپنے کیمرہ کے لینز کو صاف کریں",
      },
      lighting: {
        details:
          "براہ راست تیز روشنی سے گریز کریں کیونکہ اس سے بار کوڈ پر چمک پیدا ہو سکتی ہے اور اسے اسکین کرنا مشکل ہو جاتا ہے۔ اگر آپ کو بار کوڈ واضح طور پر نظر نہیں آ رہا، تو ممکن ہے کہ کیمرہ بھی اسے پڑھ نہ سکے۔",
        details_desktop:
          "براہ راست تیز روشنی سے گریز کریں کیونکہ اس سے بار کوڈ پر چمک پیدا ہو سکتی ہے اور اسے اسکین کرنا مشکل ہو جاتا ہے۔ اگر آپ کو بار کوڈ واضح طور پر نظر نہیں آ رہا، تو ممکن ہے کہ کیمرہ بھی اسے پڑھ نہ سکے۔",
        title: "تیز روشنی سے بچیں",
        title_desktop: "تیز روشنی سے بچیں",
      },
      visibility: {
        details:
          "یقینی بنائیں کہ آپ کی انگلی بار کوڈ کے کسی حصے کو چھپا نہ رہی ہو۔ اس کے علاوہ، اس عکس کا بھی دھیان رکھیں جو بار کوڈ پر پڑتا ہے اور اس کو پڑھنے میں دشواری پیدا کرتا ہے۔",
        details_desktop:
          "یقینی بنائیں کہ آپ کی انگلی بار کوڈ کے کسی حصے کو چھپا نہ رہی ہو۔ اس کے علاوہ، اس عکس کا بھی دھیان رکھیں جو بار کوڈ پر پڑتا ہے اور اس کو پڑھنے میں دشواری پیدا کرتا ہے۔",
        title: "بار کوڈ کو نمایاں رکھیں",
        title_desktop: "بار کوڈ کو نمایاں رکھیں",
      },
    },
    document_with_barcode: {
      blur: {
        details:
          "اسکین کرتے وقت فون اور دستاویز کو ساکن رکھنے کی کوشش کریں۔ ان میں سے کسی کو بھی حرکت دینے سے تصویر دھندلا سکتی ہے اور دستاویز پر موجود ڈیٹا پڑھنے کے قابل نہیں رہتا۔",
        details_desktop:
          "اسکین کرتے وقت ساکن رہنے کی کوشش کریں۔ حرکت کرنے سے تصویر دھندلی ہو سکتی ہے اور بار کوڈ پڑھنے میں دشواری پیش آ سکتی ہے۔",
        title: "اسکین کرتے وقت ساکن رہیں",
        title_desktop: "اسکین کرتے وقت ساکن رہیں",
      },
      camera_lens: {
        details_desktop:
          "اپنے کیمرے کے لینز پر دھبوں یا گردوغبار کی جانچ کریں۔ گندا لینز حتمی تصویر کو دھندلا کر دیتا ہے، جس سے دستاویز کی تفصیلات پڑھنے کے قابل نہیں رہتیں اور ڈیٹا کامیابی سے اسکین نہیں ہو پاتا۔",
        title_desktop: "اپنے کیمرہ کے لینز کو صاف کریں",
      },
      lighting: {
        details:
          "براہِ راست تیز روشنی سے پرہیز کریں کیونکہ یہ دستاویز پر عکس ڈالتی ہے اور اس کے کچھ حصے پڑھنے کے قابل نہیں رہتے۔ اگر آپ خود دستاویز پر موجود ڈیٹا نہیں پڑھ سکتے تو یہ کیمرے پر بھی نظر نہیں آئے گا۔",
        details_desktop:
          "براہِ راست تیز روشنی سے پرہیز کریں کیونکہ یہ دستاویز پر عکس ڈالتی ہے اور اس کے کچھ حصے پڑھنے کے قابل نہیں رہتے۔ اگر آپ خود دستاویز پر موجود ڈیٹا نہیں پڑھ سکتے تو یہ کیمرے پر بھی نظر نہیں آئے گا۔",
        title: "تیز روشنی سے بچیں",
        title_desktop: "تیز روشنی سے بچیں",
      },
      visibility: {
        details:
          "یقینی بنائیں کہ آپ کی انگلی بار کوڈ کے کسی حصے کو چھپا نہ رہی ہو۔ اس کے علاوہ، اس عکس کا بھی دھیان رکھیں جو بار کوڈ پر پڑتا ہے اور اس کو پڑھنے میں دشواری پیدا کرتا ہے۔",
        details_desktop:
          "یقینی بنائیں کہ آپ کی انگلی بار کوڈ کے کسی حصے کو چھپا نہ رہی ہو۔ اس کے علاوہ، اس عکس کا بھی دھیان رکھیں جو بار کوڈ پر پڑتا ہے اور اس کو پڑھنے میں دشواری پیدا کرتا ہے۔",
        title: "بار کوڈ کو نمایاں رکھیں",
        title_desktop: "بار کوڈ کو نمایاں رکھیں",
      },
    },
    document_with_mrz: {
      blur: {
        details:
          "اسکین کرتے وقت فون اور دستاویز کو ساکن رکھنے کی کوشش کریں۔ ان میں سے کسی کو بھی حرکت دینے سے تصویر دھندلا سکتی ہے اور دستاویز پر موجود ڈیٹا پڑھنے کے قابل نہیں رہتا۔",
        details_desktop:
          "اسکین کرتے وقت ساکن رہنے کی کوشش کریں۔ حرکت کرنے سے تصویر دھندلی ہو سکتی ہے اور بار کوڈ پڑھنے میں دشواری پیش آ سکتی ہے۔",
        title: "اسکین کرتے وقت ساکن رہیں",
        title_desktop: "اسکین کرتے وقت ساکن رہیں",
      },
      camera_lens: {
        details_desktop:
          "اپنے کیمرے کے لینز پر دھبوں یا گردوغبار کی جانچ کریں۔ گندا لینز حتمی تصویر کو دھندلا کر دیتا ہے، جس سے دستاویز کی تفصیلات پڑھنے کے قابل نہیں رہتیں اور ڈیٹا کامیابی سے اسکین نہیں ہو پاتا۔",
        title_desktop: "اپنے کیمرہ کے لینز کو صاف کریں",
      },
      lighting: {
        details:
          "براہِ راست تیز روشنی سے پرہیز کریں کیونکہ یہ دستاویز پر عکس ڈالتی ہے اور اس کے کچھ حصے پڑھنے کے قابل نہیں رہتے۔ اگر آپ خود دستاویز پر موجود ڈیٹا نہیں پڑھ سکتے تو یہ کیمرے پر بھی نظر نہیں آئے گا۔",
        details_desktop:
          "براہِ راست تیز روشنی سے پرہیز کریں کیونکہ یہ دستاویز پر عکس ڈالتی ہے اور اس کے کچھ حصے پڑھنے کے قابل نہیں رہتے۔ اگر آپ خود دستاویز پر موجود ڈیٹا نہیں پڑھ سکتے تو یہ کیمرے پر بھی نظر نہیں آئے گا۔",
        title: "تیز روشنی سے بچیں",
        title_desktop: "تیز روشنی سے بچیں",
      },
      visibility: {
        details:
          "یقینی بنائیں کہ آپ کی انگلی سے MRZ کا کوی حصہ نہ ڈھکا ہو۔ اس کے علاوہ، MRZ پر پڑنے والے انعکاس سے بھی بچیں، کیونکہ اس سے متن پڑھنے کے قابل نہیں رہ سکتا۔",
        details_desktop:
          "یقینی بنائیں کہ آپ کی انگلی سے MRZ کا کوی حصہ نہ ڈھکا ہو۔ اس کے علاوہ، MRZ پر پڑنے والے انعکاس سے بھی بچیں، کیونکہ اس سے متن پڑھنے کے قابل نہیں رہ سکتا۔",
        title: "MRZ کو نمایاں رکھیں",
        title_desktop: "MRZ کو نمایاں رکھیں",
      },
    },
    done_btn: "ہو گیا",
    done_btn_aria: "اسکیننگ دوبارہ شروع کریں",
    full_document: {
      blur: {
        details:
          "اسکین کرتے وقت فون اور دستاویز کو ساکن رکھنے کی کوشش کریں۔ ان میں سے کسی کو بھی حرکت دینے سے تصویر دھندلا سکتی ہے اور دستاویز پر موجود ڈیٹا پڑھنے کے قابل نہیں رہتا۔",
        details_desktop:
          "اسکین کرتے وقت ساکن رہنے کی کوشش کریں۔ حرکت کرنے سے تصویر دھندلی ہو سکتی ہے اور بار کوڈ پڑھنے میں دشواری پیش آ سکتی ہے۔",
        title: "اسکین کرتے وقت ساکن رہیں",
        title_desktop: "اسکین کرتے وقت ساکن رہیں",
      },
      camera_lens: {
        details_desktop:
          "اپنے کیمرے کے لینز پر دھبوں یا گردوغبار کی جانچ کریں۔ گندا لینز حتمی تصویر کو دھندلا کر دیتا ہے، جس سے دستاویز کی تفصیلات پڑھنے کے قابل نہیں رہتیں اور ڈیٹا کامیابی سے اسکین نہیں ہو پاتا۔",
        title_desktop: "اپنے کیمرہ کے لینز کو صاف کریں",
      },
      lighting: {
        details:
          "براہِ راست تیز روشنی سے پرہیز کریں کیونکہ یہ دستاویز پر عکس ڈالتی ہے اور اس کے کچھ حصے پڑھنے کے قابل نہیں رہتے۔ اگر آپ خود دستاویز پر موجود ڈیٹا نہیں پڑھ سکتے تو یہ کیمرے پر بھی نظر نہیں آئے گا۔",
        details_desktop:
          "براہِ راست تیز روشنی سے پرہیز کریں کیونکہ یہ دستاویز پر عکس ڈالتی ہے اور اس کے کچھ حصے پڑھنے کے قابل نہیں رہتے۔ اگر آپ خود دستاویز پر موجود ڈیٹا نہیں پڑھ سکتے تو یہ کیمرے پر بھی نظر نہیں آئے گا۔",
        title: "تیز روشنی سے بچیں",
        title_desktop: "تیز روشنی سے بچیں",
      },
      visibility: {
        details:
          "یقینی بنائیں کہ آپ اپنی انگلی سے دستاویز کے کسی حصے کو، خاص طور پر نچلی سطروں کو ڈھانپ نہیں رہے۔ اس کے علاوہ ہولوگرام کے عکس سے بھی بچیں جو دستاویز کے خانوں پر پڑ سکتا ہے۔",
        details_desktop:
          "یقینی بنائیں کہ آپ اپنی انگلی سے دستاویز کے کسی حصے کو، خاص طور پر نچلی سطروں کو ڈھانپ نہیں رہے۔ اس کے علاوہ ہولوگرام کے عکس سے بھی بچیں جو دستاویز کے خانوں پر پڑ سکتا ہے۔",
        title: "تمام خانے نمایاں رکھیں",
        title_desktop: "تمام خانے نمایاں رکھیں",
      },
    },
    next_btn: "اگلا",
  },
  onboarding_modal: {
    aria: "اسکیننگ کی ہدایات",
    barcode_only: {
      details:
        "بار کوڈ تلاش کریں (سیاہ لائنز کی ایک سیریز یا مربع نما کوڈ)۔ اپنے کیمرے کو اس کی طرف رکھیں اور ساکن رہیں — اسکیننگ خودکار طور پر ہو جائے گی۔",
      details_desktop:
        "بار کوڈ تلاش کریں (سیاہ لائنز کی ایک سیریز یا مربع نما کوڈ)۔ یقینی بنائیں کہ آپ کے کیمرے کا لینز صاف ہو اور بار کوڈ مناسب روشنی میں ہو۔",
      title: "بار کوڈ کو تلاش اور اسکین کریں",
      title_desktop: "اپنا لینز صاف کریں اور بار کوڈ تلاش کریں",
    },
    btn: "اسکیننگ شروع کریں",
    document_with_barcode: {
      details:
        "مختلف اقسام کی دستاویزات میں بارکوڈ کے فارمیٹس اور مقامات مختلف ہو سکتے ہیں۔ بارکوڈ تلاش کرنے کے لیے دستاویز کے اگلے اور پچھلے رخ کو دیکھیں۔",
      details_desktop:
        "دستاویز کے اگلے اور پچھلے رخ پر بارکوڈ تلاش کریں۔ یقینی بنائیں کہ کیمرے کا لینز صاف ہو اور دستاویز پر مناسب روشنی پڑ رہی ہو۔",
      title: "دستاویز پر بارکوڈ تلاش کریں",
      title_desktop: "اپنا لینز صاف کریں اور بار کوڈ تلاش کریں",
    },
    document_with_mrz: {
      details:
        "دستاویز کے اگلے یا پچھلے رخ کے نچلے حصے میں حروف کی ایک طویل لڑی موجود ہوگی، جو 2 یا 3 سطروں میں تقسیم اور تیر کے نشانات (<< یا >>) سے جدا ہوگی۔",
      details_desktop:
        "دستاویز کے اگلے اور پچھلے حصے پر MRZ تلاش کریں۔ دستاویز کے نچلے حصے میں حروف اور تیر کے نشانات (<<) پر مشتمل 2 سے 3 سطریں دیکھیں۔ یقینی بنائیں کہ کیمرے کا لینز صاف ہو اور دستاویز پر مناسب روشنی پڑ رہی ہو۔",
      title: "دستاویز پر MRZ تلاش کریں",
      title_desktop: "کیمرے کا لینز صاف کریں اور MRZ تلاش کریں",
    },
    full_document: {
      details:
        "یقینی بنائیں کہ دستاویز اچھی طرح روشن ہو۔ دستاویز کے تمام خانے کیمرہ اسکرین پر واضح نظر آنے چاہئیں۔",
      details_desktop:
        "یقینی بنائیں کہ آپ کا کیمرہ لینز صاف ہو اور دستاویز اچھی طرح روشن ہو۔ دستاویز کے تمام خانے کیمرہ اسکرین پر واضح نظر آنے چاہئیں۔",
      title: "تمام تفصیلات نمایاں رکھیں",
      title_desktop: "اسکین کرنے کے لیے تیار ہو جائیں",
    },
  },
  sdk_aria: "دستاویز اسکین کرنے کی اسکرین",
  timeout_modal: {
    details:
      "یقینی بنائیں کہ دستاویز پر مناسب روشنی پڑ رہی ہو، وہ مکمل طور پر نظر آ رہی ہو اور اس پر چمک نہ ہو۔",
    details_desktop:
      "یقینی بنائیں کہ کیمرے کا لینز صاف ہو اور دستاویز مکمل طور پر نظر آ رہی ہو، فوکس میں ہو اور اس پر مناسب روشنی پڑ رہی ہو۔",
    title: "دستاویز پڑھی نہیں جا سکی",
  },
} as const;
